Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_nvm.h
/*
 * SPDX-License-Identifier: MIT
 *
 * Goal:     stm32V873_nvm equates.
 */
#pragma once

#include    <stdint.h>

// NVM address definitions
// -----------------------

typedef struct {
    volatile    uint32_t    ACR;
    volatile    uint32_t    KEYR;
    volatile    uint32_t    SKEYR;
    volatile    uint32_t    OPTKEYR;
    volatile    uint32_t    RESERVED0;
    volatile    uint32_t    OBKKEYR;
    volatile    uint32_t    RESERVED1[2];
    volatile    uint32_t    SR;
    volatile    uint32_t    SSR;
    volatile    uint32_t    CR;
    volatile    uint32_t    SCR;
    volatile    uint32_t    CCR;
    volatile    uint32_t    SCCR;
    volatile    uint32_t    OPTCR;
    volatile    uint32_t    PRIVCFGR;
    volatile    uint32_t    SECCFGR;
    volatile    uint32_t    RCFGLOCKR;
    volatile    uint32_t    RESERVED2[2];
    volatile    uint32_t    OPTSR1_CUR;
    volatile    uint32_t    OPTSR1_PRG;
    volatile    uint32_t    RESERVED3[2];
    volatile    uint32_t    EPOCHR_CUR;
    volatile    uint32_t    RESERVED4;
    volatile    uint32_t    SEPOCHR_CUR;
    volatile    uint32_t    RESERVED5;
    volatile    uint32_t    OPTSR2_CUR;
    volatile    uint32_t    OPTSR2_PRG;
    volatile    uint32_t    RESERVED6[2];
    volatile    uint32_t    VTORNSR_CUR;
    volatile    uint32_t    VTORNSR_PRG;
    volatile    uint32_t    BOOTR_CUR;
    volatile    uint32_t    BOOTR_PRG;
    volatile    uint32_t    OTPBLR1_CUR;
    volatile    uint32_t    OTPBLR1_PRG;
    volatile    uint32_t    OTPBLR2_CUR;
    volatile    uint32_t    OTPBLR2_PRG;
    volatile    uint32_t    OBK1WRMR_CUR;
    volatile    uint32_t    OBK1WRMR_PRG;
    volatile    uint32_t    OBK2WRMR_CUR;
    volatile    uint32_t    OBK2WRMR_PRG;
    volatile    uint32_t    OBK3SWRMR_CUR;
    volatile    uint32_t    OBK3SWRMR_PRG;
    volatile    uint32_t    OBK3NSWRMR_CUR;
    volatile    uint32_t    OBK3NSWRMR_PRG;
    volatile    uint32_t    RESERVED7[8];
    volatile    uint32_t    ECCSFADDR;
    volatile    uint32_t    ECCDFADDR;
    volatile    uint32_t    ECCTFADDR;
    volatile    uint32_t    SECCSFADDR;
    volatile    uint32_t    SECCDFADDR;
    volatile    uint32_t    SECCTFADDR;
    volatile    uint32_t    OPSR;
    volatile    uint32_t    RESERVED8;
    volatile    uint32_t    OBK1CR;
    volatile    uint32_t    OBK2CR;
    volatile    uint32_t    OBK3SCR;
    volatile    uint32_t    OBK3NSCR;
    volatile    uint32_t    IASR;
    volatile    uint32_t    IACR;
    volatile    uint32_t    IAESR;
    volatile    uint32_t    IADDR;
    volatile    uint32_t    CNTR_CUR;
    volatile    uint32_t    CNTR_PRG;
    volatile    uint32_t    SCNTR_CUR;
    volatile    uint32_t    SCNTR_PRG;
    volatile    uint32_t    RESERVED9[52];
    volatile    uint32_t    SECBB1R1;
    volatile    uint32_t    SECBB1R2;
    volatile    uint32_t    SECBB1R3;
    volatile    uint32_t    SECBB1R4;
    volatile    uint32_t    SECBB1R5;
    volatile    uint32_t    SECBB1R6;
    volatile    uint32_t    SECBB1R7;
    volatile    uint32_t    SECBB1R8;
    volatile    uint32_t    RESERVED10[8];
    volatile    uint32_t    PRIVBB1R1;
    volatile    uint32_t    PRIVBB1R2;
    volatile    uint32_t    PRIVBB1R3;
    volatile    uint32_t    PRIVBB1R4;
    volatile    uint32_t    PRIVBB1R5;
    volatile    uint32_t    PRIVBB1R6;
    volatile    uint32_t    PRIVBB1R7;
    volatile    uint32_t    PRIVBB1R8;
    volatile    uint32_t    RESERVED11[8];
    volatile    uint32_t    SECWM1R_CUR;
    volatile    uint32_t    SECWM1R_PRG;
    volatile    uint32_t    HDP1R_CUR;
    volatile    uint32_t    HDP1R_PRG;
    volatile    uint32_t    WRP1R1_CUR;
    volatile    uint32_t    WRP1R1_PRG;
    volatile    uint32_t    WRP1R2_CUR;
    volatile    uint32_t    WRP1R2_PRG;
    volatile    uint32_t    RESERVED12[4];
    volatile    uint32_t    WRM1R1_CUR;
    volatile    uint32_t    WRM1R1_PRG;
    volatile    uint32_t    WRM1R2_CUR;
    volatile    uint32_t    WRM1R2_PRG;
    volatile    uint32_t    RESERVED13[4];
    volatile    uint32_t    EDATA1R_CUR;
    volatile    uint32_t    EDATA1R_PRG;
    volatile    uint32_t    RESERVED14[2];
    volatile    uint32_t    HDPEXT1R;
    volatile    uint32_t    RESERVED15[3];
    volatile    uint32_t    LPC1R;
    volatile    uint32_t    LPS1R;
    volatile    uint32_t    WRPLOCK1R_CUR;
    volatile    uint32_t    WRPLOCK1R_PRG;
    volatile    uint32_t    LOCKBB1R;
    volatile    uint32_t    RESERVED16[63];
    volatile    uint32_t    SECBB2R1;
    volatile    uint32_t    SECBB2R2;
    volatile    uint32_t    SECBB2R3;
    volatile    uint32_t    SECBB2R4;
    volatile    uint32_t    SECBB2R5;
    volatile    uint32_t    SECBB2R6;
    volatile    uint32_t    SECBB2R7;
    volatile    uint32_t    SECBB2R8;
    volatile    uint32_t    RESERVED17[8];
    volatile    uint32_t    PRIVBB2R1;
    volatile    uint32_t    PRIVBB2R2;
    volatile    uint32_t    PRIVBB2R3;
    volatile    uint32_t    PRIVBB2R4;
    volatile    uint32_t    PRIVBB2R5;
    volatile    uint32_t    PRIVBB2R6;
    volatile    uint32_t    PRIVBB2R7;
    volatile    uint32_t    PRIVBB2R8;
    volatile    uint32_t    RESERVED18[8];
    volatile    uint32_t    SECWM2R_CUR;
    volatile    uint32_t    SECWM2R_PRG;
    volatile    uint32_t    HDP2R_CUR;
    volatile    uint32_t    HDP2R_PRG;
    volatile    uint32_t    WRP2R1_CUR;
    volatile    uint32_t    WRP2R1_PRG;
    volatile    uint32_t    WRP2R2_CUR;
    volatile    uint32_t    WRP2R2_PRG;
    volatile    uint32_t    RESERVED19[4];
    volatile    uint32_t    WRM2R1_CUR;
    volatile    uint32_t    WRM2R1_PRG;
    volatile    uint32_t    WRM2R2_CUR;
    volatile    uint32_t    WRM2R2_PRG;
    volatile    uint32_t    RESERVED20[4];
    volatile    uint32_t    EDATA2R_CUR;
    volatile    uint32_t    EDATA2R_PRG;
    volatile    uint32_t    RESERVED21[2];
    volatile    uint32_t    HDPEXT2R;
    volatile    uint32_t    RESERVED22[3];
    volatile    uint32_t    LPC2R;
    volatile    uint32_t    LPS2R;
    volatile    uint32_t    WRPLOCK2R_CUR;
    volatile    uint32_t    WRPLOCK2R_PRG;
    volatile    uint32_t    LOCKBB2R;
} NVM_TypeDef;

#if (defined(__cplusplus))
#define NVM_NS  reinterpret_cast<NVM_TypeDef *>(0x48022000u)
#define NVM_S   reinterpret_cast<NVM_TypeDef *>(0x58022000u)

#else
#define NVM_NS  ((NVM_TypeDef *)0x48022000u)
#define NVM_S   ((NVM_TypeDef *)0x58022000u)
#endif

// ACR Configuration

#define NVM_ACR_PRFTEN                          (0x1u<<8)
#define NVM_ACR_LATENCY2                        (0x3u<<4)
#define NVM_ACR_LATENCY2_0                      (0x1u<<4)
#define NVM_ACR_LATENCY                         (0xFu<<0)
#define NVM_ACR_LATENCY_0                       (0x1u<<0)

#define NVM_ACR_PRFTEN_B_0X0                    (0x0u<<8)
#define NVM_ACR_PRFTEN_B_0X1                    (0x1u<<8)
#define NVM_ACR_LATENCY2_B_0X0                  (0x0u<<4)
#define NVM_ACR_LATENCY2_B_0X1                  (0x1u<<4)
#define NVM_ACR_LATENCY2_B_0X2                  (0x2u<<4)
#define NVM_ACR_LATENCY2_B_0X3                  (0x3u<<4)
#define NVM_ACR_LATENCY_B_0X0                   (0x0u<<0)
#define NVM_ACR_LATENCY_B_0X1                   (0x1u<<0)
#define NVM_ACR_LATENCY_B_0XF                   (0xFu<<0)

