Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_nvm.h
// KEYR Configuration

#define NVM_KEYR_KEY                            (0xFFFFFFFFu<<0)
#define NVM_KEYR_KEY_0                          (0x1u<<0)

// SKEYR Configuration

#define NVM_SKEYR_KEY                           (0xFFFFFFFFu<<0)
#define NVM_SKEYR_KEY_0                         (0x1u<<0)

// OPTKEYR Configuration

#define NVM_OPTKEYR_KEY                         (0xFFFFFFFFu<<0)
#define NVM_OPTKEYR_KEY_0                       (0x1u<<0)

// OBKKEYR Configuration

#define NVM_OBKKEYR_KEY                         (0xFFFFFFFFu<<0)
#define NVM_OBKKEYR_KEY_0                       (0x1u<<0)

// SR Configuration

#define NVM_SR_RMWERR                           (0x1u<<30)
#define NVM_SR_TRECCERR                         (0x1u<<29)
#define NVM_SR_DBECCERR                         (0x1u<<28)
#define NVM_SR_SNECCERR                         (0x1u<<27)
#define NVM_SR_WFAILS                           (0x3u<<25)
#define NVM_SR_WFAILS_0                         (0x1u<<25)
#define NVM_SR_WRERR                            (0x1u<<24)
#define NVM_SR_OPTCHANGEERR                     (0x1u<<23)
#define NVM_SR_INCERR                           (0x1u<<20)
#define NVM_SR_STRBERR                          (0x1u<<19)
#define NVM_SR_PGSERR                           (0x1u<<18)
#define NVM_SR_WRPERR                           (0x1u<<17)
#define NVM_SR_EOP                              (0x1u<<16)
#define NVM_SR_BOG                              (0x1u<<3)
#define NVM_SR_WBNE                             (0x1u<<1)
#define NVM_SR_BSY                              (0x1u<<0)

#define NVM_SR_WFAILS_B_0X0                     (0x0u<<25)
#define NVM_SR_WFAILS_B_0X1                     (0x1u<<25)
#define NVM_SR_WFAILS_B_0X2                     (0x2u<<25)
#define NVM_SR_WFAILS_B_0X3                     (0x3u<<25)
#define NVM_SR_BOG_B_0X0                        (0x0u<<3)
#define NVM_SR_BOG_B_0X1                        (0x1u<<3)
#define NVM_SR_WBNE_B_0X0                       (0x0u<<1)
#define NVM_SR_WBNE_B_0X1                       (0x1u<<1)
#define NVM_SR_BSY_B_0X0                        (0x0u<<0)
#define NVM_SR_BSY_B_0X1                        (0x1u<<0)

// SSR Configuration

#define NVM_SSR_RMWERR                          (0x1u<<30)
#define NVM_SSR_TRECCERR                        (0x1u<<29)
#define NVM_SSR_DBECCERR                        (0x1u<<28)
#define NVM_SSR_SNECCERR                        (0x1u<<27)
#define NVM_SSR_WFAILS                          (0x3u<<25)
#define NVM_SSR_WFAILS_0                        (0x1u<<25)
#define NVM_SSR_WRERR                           (0x1u<<24)
#define NVM_SSR_OBKWERR                         (0x1u<<22)
#define NVM_SSR_OBKERR                          (0x1u<<21)
#define NVM_SSR_INCERR                          (0x1u<<20)
#define NVM_SSR_STRBERR                         (0x1u<<19)
#define NVM_SSR_PGSERR                          (0x1u<<18)
#define NVM_SSR_WRPERR                          (0x1u<<17)
#define NVM_SSR_EOP                             (0x1u<<16)
#define NVM_SSR_BOG                             (0x1u<<3)
#define NVM_SSR_WBNE                            (0x1u<<1)
#define NVM_SSR_BSY                             (0x1u<<0)

#define NVM_SSR_WFAILS_B_0X0                    (0x0u<<25)
#define NVM_SSR_WFAILS_B_0X1                    (0x1u<<25)
#define NVM_SSR_WFAILS_B_0X2                    (0x2u<<25)
#define NVM_SSR_WFAILS_B_0X3                    (0x3u<<25)
#define NVM_SSR_BOG_B_0X0                       (0x0u<<3)
#define NVM_SSR_BOG_B_0X1                       (0x1u<<3)
#define NVM_SSR_WBNE_B_0X0                      (0x0u<<1)
#define NVM_SSR_WBNE_B_0X1                      (0x1u<<1)
#define NVM_SSR_BSY_B_0X0                       (0x0u<<0)
#define NVM_SSR_BSY_B_0X1                       (0x1u<<0)

// CR Configuration

#define NVM_CR_RMWERRIE                         (0x1u<<30)
#define NVM_CR_DBECCERRIE                       (0x1u<<28)
#define NVM_CR_SNECCERRIE                       (0x1u<<27)
#define NVM_CR_WRERRIE                          (0x1u<<24)
#define NVM_CR_OPTCHANGEERRIE                   (0x1u<<23)
#define NVM_CR_INCERRIE                         (0x1u<<20)
#define NVM_CR_STRBERRIE                        (0x1u<<19)
#define NVM_CR_PGSERRIE                         (0x1u<<18)
#define NVM_CR_WRPERRIE                         (0x1u<<17)
#define NVM_CR_EOPIE                            (0x1u<<16)
#define NVM_CR_RMW                              (0x1u<<4)
#define NVM_CR_BWR                              (0x1u<<2)
#define NVM_CR_PG                               (0x1u<<1)
#define NVM_CR_LOCK                             (0x1u<<0)

#define NVM_CR_RMWERRIE_B_0X0                   (0x0u<<30)
#define NVM_CR_RMWERRIE_B_0X1                   (0x1u<<30)
#define NVM_CR_DBECCERRIE_B_0X0                 (0x0u<<28)
#define NVM_CR_DBECCERRIE_B_0X1                 (0x1u<<28)
#define NVM_CR_SNECCERRIE_B_0X0                 (0x0u<<27)
#define NVM_CR_SNECCERRIE_B_0X1                 (0x1u<<27)
#define NVM_CR_WRERRIE_B_0X0                    (0x0u<<24)
#define NVM_CR_WRERRIE_B_0X1                    (0x1u<<24)
#define NVM_CR_OPTCHANGEERRIE_B_0X0             (0x0u<<23)
#define NVM_CR_OPTCHANGEERRIE_B_0X1             (0x1u<<23)
#define NVM_CR_INCERRIE_B_0X0                   (0x0u<<20)
#define NVM_CR_INCERRIE_B_0X1                   (0x1u<<20)
#define NVM_CR_STRBERRIE_B_0X0                  (0x0u<<19)
#define NVM_CR_STRBERRIE_B_0X1                  (0x1u<<19)
#define NVM_CR_PGSERRIE_B_0X0                   (0x0u<<18)
#define NVM_CR_PGSERRIE_B_0X1                   (0x1u<<18)
#define NVM_CR_WRPERRIE_B_0X0                   (0x0u<<17)
#define NVM_CR_WRPERRIE_B_0X1                   (0x1u<<17)
#define NVM_CR_EOPIE_B_0X0                      (0x0u<<16)
#define NVM_CR_EOPIE_B_0X1                      (0x1u<<16)
#define NVM_CR_RMW_B_0X0                        (0x0u<<4)
#define NVM_CR_RMW_B_0X1                        (0x1u<<4)
#define NVM_CR_PG_B_0X0                         (0x0u<<1)
#define NVM_CR_PG_B_0X1                         (0x1u<<1)

// SCR Configuration

