Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_nvm.h
#define NVM_SCR_BST                             (0x1u<<31)
#define NVM_SCR_RMWERRIE                        (0x1u<<30)
#define NVM_SCR_DBECCERRIE                      (0x1u<<28)
#define NVM_SCR_SNECCERRIE                      (0x1u<<27)
#define NVM_SCR_WRERRIE                         (0x1u<<24)
#define NVM_SCR_OBKWERRIE                       (0x1u<<22)
#define NVM_SCR_OBKERRIE                        (0x1u<<21)
#define NVM_SCR_INCERRIE                        (0x1u<<20)
#define NVM_SCR_STRBERRIE                       (0x1u<<19)
#define NVM_SCR_PGSERRIE                        (0x1u<<18)
#define NVM_SCR_WRPERRIE                        (0x1u<<17)
#define NVM_SCR_EOPIE                           (0x1u<<16)
#define NVM_SCR_RMW                             (0x1u<<4)
#define NVM_SCR_BWR                             (0x1u<<2)
#define NVM_SCR_PG                              (0x1u<<1)
#define NVM_SCR_LOCK                            (0x1u<<0)

#define NVM_SCR_BST_B_0X0                       (0x0u<<31)
#define NVM_SCR_BST_B_0X1                       (0x1u<<31)
#define NVM_SCR_RMWERRIE_B_0X0                  (0x0u<<30)
#define NVM_SCR_RMWERRIE_B_0X1                  (0x1u<<30)
#define NVM_SCR_DBECCERRIE_B_0X0                (0x0u<<28)
#define NVM_SCR_DBECCERRIE_B_0X1                (0x1u<<28)
#define NVM_SCR_SNECCERRIE_B_0X0                (0x0u<<27)
#define NVM_SCR_SNECCERRIE_B_0X1                (0x1u<<27)
#define NVM_SCR_WRERRIE_B_0X0                   (0x0u<<24)
#define NVM_SCR_WRERRIE_B_0X1                   (0x1u<<24)
#define NVM_SCR_OBKWERRIE_B_0X0                 (0x0u<<22)
#define NVM_SCR_OBKWERRIE_B_0X1                 (0x1u<<22)
#define NVM_SCR_OBKERRIE_B_0X0                  (0x0u<<21)
#define NVM_SCR_OBKERRIE_B_0X1                  (0x1u<<21)
#define NVM_SCR_INCERRIE_B_0X0                  (0x0u<<20)
#define NVM_SCR_INCERRIE_B_0X1                  (0x1u<<20)
#define NVM_SCR_STRBERRIE_B_0X0                 (0x0u<<19)
#define NVM_SCR_STRBERRIE_B_0X1                 (0x1u<<19)
#define NVM_SCR_PGSERRIE_B_0X0                  (0x0u<<18)
#define NVM_SCR_PGSERRIE_B_0X1                  (0x1u<<18)
#define NVM_SCR_WRPERRIE_B_0X0                  (0x0u<<17)
#define NVM_SCR_WRPERRIE_B_0X1                  (0x1u<<17)
#define NVM_SCR_EOPIE_B_0X0                     (0x0u<<16)
#define NVM_SCR_EOPIE_B_0X1                     (0x1u<<16)
#define NVM_SCR_RMW_B_0X0                       (0x0u<<4)
#define NVM_SCR_RMW_B_0X1                       (0x1u<<4)
#define NVM_SCR_PG_B_0X0                        (0x0u<<1)
#define NVM_SCR_PG_B_0X1                        (0x1u<<1)

// CCR Configuration

#define NVM_CCR_RMWERR                          (0x1u<<30)
#define NVM_CCR_TRECCERR                        (0x1u<<29)
#define NVM_CCR_DBECCERR                        (0x1u<<28)
#define NVM_CCR_SNECCERR                        (0x1u<<27)
#define NVM_CCR_WRERR                           (0x1u<<24)
#define NVM_CCR_OPTCHANGEERR                    (0x1u<<23)
#define NVM_CCR_INCERR                          (0x1u<<20)
#define NVM_CCR_STRBERR                         (0x1u<<19)
#define NVM_CCR_PGSERR                          (0x1u<<18)
#define NVM_CCR_WRPERR                          (0x1u<<17)
#define NVM_CCR_EOP                             (0x1u<<16)

// SCCR Configuration

#define NVM_SCCR_RMWERR                         (0x1u<<30)
#define NVM_SCCR_TRECCERR                       (0x1u<<29)
#define NVM_SCCR_DBECCERR                       (0x1u<<28)
#define NVM_SCCR_SNECCERR                       (0x1u<<27)
#define NVM_SCCR_WRERR                          (0x1u<<24)
#define NVM_SCCR_OBKWERR                        (0x1u<<22)
#define NVM_SCCR_OBKERR                         (0x1u<<21)
#define NVM_SCCR_INCERR                         (0x1u<<20)
#define NVM_SCCR_STRBERR                        (0x1u<<19)
#define NVM_SCCR_PGSERR                         (0x1u<<18)
#define NVM_SCCR_WRPERR                         (0x1u<<17)
#define NVM_SCCR_EOP                            (0x1u<<16)

// OPTCR Configuration

#define NVM_OPTCR_OPTSTRT                       (0x1u<<1)
#define NVM_OPTCR_OPTLOCK                       (0x1u<<0)

// PRIVCFGR Configuration

#define NVM_PRIVCFGR_PERF                       (0x1u<<4)
#define NVM_PRIVCFGR_LP                         (0x1u<<3)
#define NVM_PRIVCFGR_SYS                        (0x1u<<2)
#define NVM_PRIVCFGR_PRIV                       (0x1u<<1)
#define NVM_PRIVCFGR_SPRIV                      (0x1u<<0)

#define NVM_PRIVCFGR_PERF_B_0X0                 (0x0u<<4)
#define NVM_PRIVCFGR_PERF_B_0X1                 (0x1u<<4)
#define NVM_PRIVCFGR_LP_B_0X0                   (0x0u<<3)
#define NVM_PRIVCFGR_LP_B_0X1                   (0x1u<<3)
#define NVM_PRIVCFGR_SYS_B_0X0                  (0x0u<<2)
#define NVM_PRIVCFGR_SYS_B_0X1                  (0x1u<<2)
#define NVM_PRIVCFGR_PRIV_B_0X0                 (0x0u<<1)
#define NVM_PRIVCFGR_PRIV_B_0X1                 (0x1u<<1)
#define NVM_PRIVCFGR_SPRIV_B_0X0                (0x0u<<0)
#define NVM_PRIVCFGR_SPRIV_B_0X1                (0x1u<<0)

// SECCFGR Configuration

#define NVM_SECCFGR_PERF                        (0x1u<<4)
#define NVM_SECCFGR_LP                          (0x1u<<3)
#define NVM_SECCFGR_SYS                         (0x1u<<2)

#define NVM_SECCFGR_PERF_B_0X0                  (0x0u<<4)
#define NVM_SECCFGR_PERF_B_0X1                  (0x1u<<4)
#define NVM_SECCFGR_LP_B_0X0                    (0x0u<<3)
#define NVM_SECCFGR_LP_B_0X1                    (0x1u<<3)
#define NVM_SECCFGR_SYS_B_0X0                   (0x0u<<2)
#define NVM_SECCFGR_SYS_B_0X1                   (0x1u<<2)

// RCFGLOCKR Configuration

#define NVM_RCFGLOCKR_PERF                      (0x1u<<4)
#define NVM_RCFGLOCKR_LP                        (0x1u<<3)
#define NVM_RCFGLOCKR_SYS                       (0x1u<<2)
#define NVM_RCFGLOCKR_PRIV                      (0x1u<<1)
#define NVM_RCFGLOCKR_SPRIV                     (0x1u<<0)

#define NVM_RCFGLOCKR_PERF_B_0X0                (0x0u<<4)
#define NVM_RCFGLOCKR_PERF_B_0X1                (0x1u<<4)
#define NVM_RCFGLOCKR_LP_B_0X0                  (0x0u<<3)
#define NVM_RCFGLOCKR_LP_B_0X1                  (0x1u<<3)
#define NVM_RCFGLOCKR_SYS_B_0X0                 (0x0u<<2)
#define NVM_RCFGLOCKR_SYS_B_0X1                 (0x1u<<2)
#define NVM_RCFGLOCKR_PRIV_B_0X0                (0x0u<<1)
#define NVM_RCFGLOCKR_PRIV_B_0X1                (0x1u<<1)
#define NVM_RCFGLOCKR_SPRIV_B_0X0               (0x0u<<0)
#define NVM_RCFGLOCKR_SPRIV_B_0X1               (0x1u<<0)

// OPTSR1_CUR Configuration

#define NVM_OPTSR1_CUR_BDRST_POR                (0x1u<<31)
#define NVM_OPTSR1_CUR_BOOT_UBE                 (0xFFu<<22)
#define NVM_OPTSR1_CUR_BOOT_UBE_0               (0x1u<<22)
#define NVM_OPTSR1_CUR_IWDG_STDBY               (0x1u<<21)
#define NVM_OPTSR1_CUR_IWDG_STOP                (0x1u<<20)
#define NVM_OPTSR1_CUR_IO_VDDUSB_HSLV           (0x1u<<19)
#define NVM_OPTSR1_CUR_IO_VDDXSPI2_HSLV         (0x1u<<18)
#define NVM_OPTSR1_CUR_IO_VDDXSPI1_HSLV         (0x1u<<17)
#define NVM_OPTSR1_CUR_IO_VDD_HSLV              (0x1u<<16)
#define NVM_OPTSR1_CUR_PRODUCT_STATE            (0xFFu<<8)
#define NVM_OPTSR1_CUR_PRODUCT_STATE_0          (0x1u<<8)
#define NVM_OPTSR1_CUR_NRST_STDBY               (0x1u<<7)
#define NVM_OPTSR1_CUR_NRST_STOP                (0x1u<<6)
#define NVM_OPTSR1_CUR_WWDG_SW                  (0x1u<<4)
#define NVM_OPTSR1_CUR_IWDG_SW                  (0x1u<<3)
#define NVM_OPTSR1_CUR_BOR_LEV                  (0x3u<<0)
#define NVM_OPTSR1_CUR_BOR_LEV_0                (0x1u<<0)

#define NVM_OPTSR1_CUR_BDRST_POR_B_0X0          (0x0u<<31)
#define NVM_OPTSR1_CUR_BDRST_POR_B_0X1          (0x1u<<31)
#define NVM_OPTSR1_CUR_BOOT_UBE_B_0XC3          (0xC3u<<22)
#define NVM_OPTSR1_CUR_BOOT_UBE_B_0XB4          (0xB4u<<22)
#define NVM_OPTSR1_CUR_IWDG_STDBY_B_0X0         (0x0u<<21)
#define NVM_OPTSR1_CUR_IWDG_STDBY_B_0X1         (0x1u<<21)
#define NVM_OPTSR1_CUR_IWDG_STOP_B_0X0          (0x0u<<20)
#define NVM_OPTSR1_CUR_IWDG_STOP_B_0X1          (0x1u<<20)
#define NVM_OPTSR1_CUR_IO_VDDUSB_HSLV_B_0X0     (0x0u<<19)
#define NVM_OPTSR1_CUR_IO_VDDUSB_HSLV_B_0X1     (0x1u<<19)
#define NVM_OPTSR1_CUR_IO_VDDXSPI2_HSLV_B_0X0   (0x0u<<18)
#define NVM_OPTSR1_CUR_IO_VDDXSPI2_HSLV_B_0X1   (0x1u<<18)
#define NVM_OPTSR1_CUR_IO_VDDXSPI1_HSLV_B_0X0   (0x0u<<17)
#define NVM_OPTSR1_CUR_IO_VDDXSPI1_HSLV_B_0X1   (0x1u<<17)
#define NVM_OPTSR1_CUR_IO_VDD_HSLV_B_0X0        (0x0u<<16)
#define NVM_OPTSR1_CUR_IO_VDD_HSLV_B_0X1        (0x1u<<16)
#define NVM_OPTSR1_CUR_NRST_STDBY_B_0X0         (0x0u<<7)
#define NVM_OPTSR1_CUR_NRST_STDBY_B_0X1         (0x1u<<7)
#define NVM_OPTSR1_CUR_NRST_STOP_B_0X0          (0x0u<<6)
#define NVM_OPTSR1_CUR_NRST_STOP_B_0X1          (0x1u<<6)
#define NVM_OPTSR1_CUR_WWDG_SW_B_0X0            (0x0u<<4)
#define NVM_OPTSR1_CUR_WWDG_SW_B_0X1            (0x1u<<4)
#define NVM_OPTSR1_CUR_IWDG_SW_B_0X0            (0x0u<<3)
#define NVM_OPTSR1_CUR_IWDG_SW_B_0X1            (0x1u<<3)
#define NVM_OPTSR1_CUR_BOR_LEV_B_0X0            (0x0u<<0)
#define NVM_OPTSR1_CUR_BOR_LEV_B_0X1            (0x1u<<0)
#define NVM_OPTSR1_CUR_BOR_LEV_B_0X2            (0x2u<<0)
#define NVM_OPTSR1_CUR_BOR_LEV_B_0X3            (0x3u<<0)

// OPTSR1_PRG Configuration

#define NVM_OPTSR1_PRG_BDRST_POR                (0x1u<<31)
#define NVM_OPTSR1_PRG_BOOT_UBE                 (0xFFu<<22)
#define NVM_OPTSR1_PRG_BOOT_UBE_0               (0x1u<<22)
#define NVM_OPTSR1_PRG_IWDG_STDBY               (0x1u<<21)
#define NVM_OPTSR1_PRG_IWDG_STOP                (0x1u<<20)
#define NVM_OPTSR1_PRG_IO_VDDUSB_HSLV           (0x1u<<19)
#define NVM_OPTSR1_PRG_IO_VDDXSPI2_HSLV         (0x1u<<18)
#define NVM_OPTSR1_PRG_IO_VDDXSPI1_HSLV         (0x1u<<17)
#define NVM_OPTSR1_PRG_IO_VDD_HSLV              (0x1u<<16)
#define NVM_OPTSR1_PRG_PRODUCT_STATE            (0xFFu<<8)
#define NVM_OPTSR1_PRG_PRODUCT_STATE_0          (0x1u<<8)
#define NVM_OPTSR1_PRG_NRST_STDBY               (0x1u<<7)
#define NVM_OPTSR1_PRG_NRST_STOP                (0x1u<<6)
#define NVM_OPTSR1_PRG_WWDG_SW                  (0x1u<<4)
#define NVM_OPTSR1_PRG_IWDG_SW                  (0x1u<<3)
#define NVM_OPTSR1_PRG_BOR_LEV                  (0x3u<<0)
#define NVM_OPTSR1_PRG_BOR_LEV_0                (0x1u<<0)

#define NVM_OPTSR1_PRG_BDRST_POR_B_0X0          (0x0u<<31)
#define NVM_OPTSR1_PRG_BDRST_POR_B_0X1          (0x1u<<31)
#define NVM_OPTSR1_PRG_BOOT_UBE_B_0XB4          (0xB4u<<22)
#define NVM_OPTSR1_PRG_BOOT_UBE_B_0XC3          (0xC3u<<22)
#define NVM_OPTSR1_PRG_IWDG_STDBY_B_0X0         (0x0u<<21)
#define NVM_OPTSR1_PRG_IWDG_STDBY_B_0X1         (0x1u<<21)
#define NVM_OPTSR1_PRG_IWDG_STOP_B_0X0          (0x0u<<20)
#define NVM_OPTSR1_PRG_IWDG_STOP_B_0X1          (0x1u<<20)
#define NVM_OPTSR1_PRG_IO_VDDUSB_HSLV_B_0X0     (0x0u<<19)
#define NVM_OPTSR1_PRG_IO_VDDUSB_HSLV_B_0X1     (0x1u<<19)
#define NVM_OPTSR1_PRG_IO_VDDXSPI2_HSLV_B_0X0   (0x0u<<18)
#define NVM_OPTSR1_PRG_IO_VDDXSPI2_HSLV_B_0X1   (0x1u<<18)
#define NVM_OPTSR1_PRG_IO_VDDXSPI1_HSLV_B_0X0   (0x0u<<17)
#define NVM_OPTSR1_PRG_IO_VDDXSPI1_HSLV_B_0X1   (0x1u<<17)
#define NVM_OPTSR1_PRG_IO_VDD_HSLV_B_0X0        (0x0u<<16)
#define NVM_OPTSR1_PRG_IO_VDD_HSLV_B_0X1        (0x1u<<16)
#define NVM_OPTSR1_PRG_NRST_STDBY_B_0X0         (0x0u<<7)
#define NVM_OPTSR1_PRG_NRST_STDBY_B_0X1         (0x1u<<7)
#define NVM_OPTSR1_PRG_NRST_STOP_B_0X0          (0x0u<<6)
#define NVM_OPTSR1_PRG_NRST_STOP_B_0X1          (0x1u<<6)
#define NVM_OPTSR1_PRG_WWDG_SW_B_0X0            (0x0u<<4)
#define NVM_OPTSR1_PRG_WWDG_SW_B_0X1            (0x1u<<4)
#define NVM_OPTSR1_PRG_IWDG_SW_B_0X0            (0x0u<<3)
#define NVM_OPTSR1_PRG_IWDG_SW_B_0X1            (0x1u<<3)
#define NVM_OPTSR1_PRG_BOR_LEV_B_0X0            (0x0u<<0)
#define NVM_OPTSR1_PRG_BOR_LEV_B_0X1            (0x1u<<0)
#define NVM_OPTSR1_PRG_BOR_LEV_B_0X2            (0x2u<<0)
#define NVM_OPTSR1_PRG_BOR_LEV_B_0X3            (0x3u<<0)

