Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_nvm.h
// EPOCHR_CUR Configuration

#define NVM_EPOCHR_CUR_EPOCH                    (0xFFFFFFu<<0)
#define NVM_EPOCHR_CUR_EPOCH_0                  (0x1u<<0)

// SEPOCHR_CUR Configuration

#define NVM_SEPOCHR_CUR_EPOCH                   (0xFFFFFFu<<0)
#define NVM_SEPOCHR_CUR_EPOCH_0                 (0x1u<<0)

// OPTSR2_CUR Configuration

#define NVM_OPTSR2_CUR_SWAP_BANK                (0xFFu<<24)
#define NVM_OPTSR2_CUR_SWAP_BANK_0              (0x1u<<24)
#define NVM_OPTSR2_CUR_CPU_FREQ_BOOST           (0x1u<<23)
#define NVM_OPTSR2_CUR_DTCM_AXI_SHARE           (0x1u<<20)
#define NVM_OPTSR2_CUR_ITCM_AXI_SHARE           (0x3u<<16)
#define NVM_OPTSR2_CUR_ITCM_AXI_SHARE_0         (0x1u<<16)
#define NVM_OPTSR2_CUR_NVM256                   (0xFFu<<8)
#define NVM_OPTSR2_CUR_NVM256_0                 (0x1u<<8)
#define NVM_OPTSR2_CUR_AXI_SRAM6_FLEX_ECC       (0x1u<<7)
#define NVM_OPTSR2_CUR_AXI_SRAM6_FIX_ECC        (0x1u<<6)
#define NVM_OPTSR2_CUR_AXI_SRAM1_ECC            (0x1u<<5)
#define NVM_OPTSR2_CUR_BKPSRAM_ECC              (0x1u<<4)

#define NVM_OPTSR2_CUR_SWAP_BANK_B_0X74         (0x74u<<24)
#define NVM_OPTSR2_CUR_SWAP_BANK_B_0X8B         (0x8Bu<<24)
#define NVM_OPTSR2_CUR_CPU_FREQ_BOOST_B_0X0     (0x0u<<23)
#define NVM_OPTSR2_CUR_CPU_FREQ_BOOST_B_0X1     (0x1u<<23)
#define NVM_OPTSR2_CUR_DTCM_AXI_SHARE_B_0X0     (0x0u<<20)
#define NVM_OPTSR2_CUR_DTCM_AXI_SHARE_B_0X1     (0x1u<<20)
#define NVM_OPTSR2_CUR_ITCM_AXI_SHARE_B_0X0     (0x0u<<16)
#define NVM_OPTSR2_CUR_ITCM_AXI_SHARE_B_0X1     (0x1u<<16)
#define NVM_OPTSR2_CUR_ITCM_AXI_SHARE_B_0X2     (0x2u<<16)
#define NVM_OPTSR2_CUR_ITCM_AXI_SHARE_B_0X3     (0x3u<<16)
#define NVM_OPTSR2_CUR_NVM256_B_0X2E            (0x2Eu<<8)
#define NVM_OPTSR2_CUR_NVM256_B_0XD1            (0xD1u<<8)
#define NVM_OPTSR2_CUR_AXI_SRAM6_FLEX_ECC_B_0X0 (0x0u<<7)
#define NVM_OPTSR2_CUR_AXI_SRAM6_FLEX_ECC_B_0X1 (0x1u<<7)
#define NVM_OPTSR2_CUR_AXI_SRAM6_FIX_ECC_B_0X0  (0x0u<<6)
#define NVM_OPTSR2_CUR_AXI_SRAM6_FIX_ECC_B_0X1  (0x1u<<6)
#define NVM_OPTSR2_CUR_AXI_SRAM1_ECC_B_0X0      (0x0u<<5)
#define NVM_OPTSR2_CUR_AXI_SRAM1_ECC_B_0X1      (0x1u<<5)
#define NVM_OPTSR2_CUR_BKPSRAM_ECC_B_0X0        (0x0u<<4)
#define NVM_OPTSR2_CUR_BKPSRAM_ECC_B_0X1        (0x1u<<4)

// OPTSR2_PRG Configuration

#define NVM_OPTSR2_PRG_SWAP_BANK                (0xFFu<<24)
#define NVM_OPTSR2_PRG_SWAP_BANK_0              (0x1u<<24)
#define NVM_OPTSR2_PRG_CPU_FREQ_BOOST           (0x1u<<23)
#define NVM_OPTSR2_PRG_DTCM_AXI_SHARE           (0x1u<<20)
#define NVM_OPTSR2_PRG_ITCM_AXI_SHARE           (0x3u<<16)
#define NVM_OPTSR2_PRG_ITCM_AXI_SHARE_0         (0x1u<<16)
#define NVM_OPTSR2_PRG_NVM256                   (0xFFu<<8)
#define NVM_OPTSR2_PRG_NVM256_0                 (0x1u<<8)
#define NVM_OPTSR2_PRG_AXI_SRAM6_FLEX_ECC       (0x1u<<7)
#define NVM_OPTSR2_PRG_AXI_SRAM6_FIX_ECC        (0x1u<<6)
#define NVM_OPTSR2_PRG_AXI_SRAM1_ECC            (0x1u<<5)
#define NVM_OPTSR2_PRG_BKPSRAM_ECC              (0x1u<<4)

#define NVM_OPTSR2_PRG_SWAP_BANK_B_0X74         (0x74u<<24)
#define NVM_OPTSR2_PRG_SWAP_BANK_B_0X8B         (0x8Bu<<24)
#define NVM_OPTSR2_PRG_CPU_FREQ_BOOST_B_0X0     (0x0u<<23)
#define NVM_OPTSR2_PRG_CPU_FREQ_BOOST_B_0X1     (0x1u<<23)
#define NVM_OPTSR2_PRG_DTCM_AXI_SHARE_B_0X0     (0x0u<<20)
#define NVM_OPTSR2_PRG_DTCM_AXI_SHARE_B_0X1     (0x1u<<20)
#define NVM_OPTSR2_PRG_ITCM_AXI_SHARE_B_0X0     (0x0u<<16)
#define NVM_OPTSR2_PRG_ITCM_AXI_SHARE_B_0X1     (0x1u<<16)
#define NVM_OPTSR2_PRG_ITCM_AXI_SHARE_B_0X2     (0x2u<<16)
#define NVM_OPTSR2_PRG_ITCM_AXI_SHARE_B_0X3     (0x3u<<16)
#define NVM_OPTSR2_PRG_NVM256_B_0X2E            (0x2Eu<<8)
#define NVM_OPTSR2_PRG_NVM256_B_0XD1            (0xD1u<<8)
#define NVM_OPTSR2_PRG_AXI_SRAM6_FLEX_ECC_B_0X0 (0x0u<<7)
#define NVM_OPTSR2_PRG_AXI_SRAM6_FLEX_ECC_B_0X1 (0x1u<<7)
#define NVM_OPTSR2_PRG_AXI_SRAM6_FIX_ECC_B_0X0  (0x0u<<6)
#define NVM_OPTSR2_PRG_AXI_SRAM6_FIX_ECC_B_0X1  (0x1u<<6)
#define NVM_OPTSR2_PRG_AXI_SRAM1_ECC_B_0X0      (0x0u<<5)
#define NVM_OPTSR2_PRG_AXI_SRAM1_ECC_B_0X1      (0x1u<<5)
#define NVM_OPTSR2_PRG_BKPSRAM_ECC_B_0X0        (0x0u<<4)
#define NVM_OPTSR2_PRG_BKPSRAM_ECC_B_0X1        (0x1u<<4)

// VTORNSR_CUR Configuration

#define NVM_VTORNSR_CUR_VTORNS                  (0xFFFFFFu<<8)
#define NVM_VTORNSR_CUR_VTORNS_0                (0x1u<<8)
#define NVM_VTORNSR_CUR_VTORNSLOCK              (0xFFu<<0)
#define NVM_VTORNSR_CUR_VTORNSLOCK_0            (0x1u<<0)

#define NVM_VTORNSR_CUR_VTORNSLOCK_B_0XC3       (0xC3u<<0)
#define NVM_VTORNSR_CUR_VTORNSLOCK_B_0XB4       (0xB4u<<0)

// VTORNSR_PRG Configuration

#define NVM_VTORNSR_PRG_VTORNS                  (0xFFFFFFu<<8)
#define NVM_VTORNSR_PRG_VTORNS_0                (0x1u<<8)
#define NVM_VTORNSR_PRG_VTORNSLOCK              (0xFFu<<0)
#define NVM_VTORNSR_PRG_VTORNSLOCK_0            (0x1u<<0)

#define NVM_VTORNSR_PRG_VTORNSLOCK_B_0XC3       (0xC3u<<0)
#define NVM_VTORNSR_PRG_VTORNSLOCK_B_0XB4       (0xB4u<<0)

// BOOTR_CUR Configuration

#define NVM_BOOTR_CUR_BOOTADD                   (0xFFFFFFu<<8)
#define NVM_BOOTR_CUR_BOOTADD_0                 (0x1u<<8)
#define NVM_BOOTR_CUR_BOOTLOCK                  (0xFFu<<0)
#define NVM_BOOTR_CUR_BOOTLOCK_0                (0x1u<<0)

#define NVM_BOOTR_CUR_BOOTLOCK_B_0XC3           (0xC3u<<0)
#define NVM_BOOTR_CUR_BOOTLOCK_B_0XB4           (0xB4u<<0)

// BOOTR_PRG Configuration

#define NVM_BOOTR_PRG_BOOTADD                   (0xFFFFFFu<<8)
#define NVM_BOOTR_PRG_BOOTADD_0                 (0x1u<<8)
#define NVM_BOOTR_PRG_BOOTLOCK                  (0xFFu<<0)
#define NVM_BOOTR_PRG_BOOTLOCK_0                (0x1u<<0)

#define NVM_BOOTR_PRG_BOOTLOCK_B_0XC3           (0xC3u<<0)
#define NVM_BOOTR_PRG_BOOTLOCK_B_0XB4           (0xB4u<<0)

// OTPBLR1_CUR Configuration

#define NVM_OTPBLR1_CUR_LOCKBL31                (0x1u<<31)
#define NVM_OTPBLR1_CUR_LOCKBL30                (0x1u<<30)
#define NVM_OTPBLR1_CUR_LOCKBL29                (0x1u<<29)
#define NVM_OTPBLR1_CUR_LOCKBL28                (0x1u<<28)
#define NVM_OTPBLR1_CUR_LOCKBL27                (0x1u<<27)
#define NVM_OTPBLR1_CUR_LOCKBL26                (0x1u<<26)
#define NVM_OTPBLR1_CUR_LOCKBL25                (0x1u<<25)
#define NVM_OTPBLR1_CUR_LOCKBL24                (0x1u<<24)
#define NVM_OTPBLR1_CUR_LOCKBL23                (0x1u<<23)
#define NVM_OTPBLR1_CUR_LOCKBL22                (0x1u<<22)
#define NVM_OTPBLR1_CUR_LOCKBL21                (0x1u<<21)
#define NVM_OTPBLR1_CUR_LOCKBL20                (0x1u<<20)
#define NVM_OTPBLR1_CUR_LOCKBL19                (0x1u<<19)
#define NVM_OTPBLR1_CUR_LOCKBL18                (0x1u<<18)
#define NVM_OTPBLR1_CUR_LOCKBL17                (0x1u<<17)
#define NVM_OTPBLR1_CUR_LOCKBL16                (0x1u<<16)
#define NVM_OTPBLR1_CUR_LOCKBL15                (0x1u<<15)
#define NVM_OTPBLR1_CUR_LOCKBL14                (0x1u<<14)
#define NVM_OTPBLR1_CUR_LOCKBL13                (0x1u<<13)
#define NVM_OTPBLR1_CUR_LOCKBL12                (0x1u<<12)
#define NVM_OTPBLR1_CUR_LOCKBL11                (0x1u<<11)
#define NVM_OTPBLR1_CUR_LOCKBL10                (0x1u<<10)
#define NVM_OTPBLR1_CUR_LOCKBL9                 (0x1u<<9)
#define NVM_OTPBLR1_CUR_LOCKBL8                 (0x1u<<8)
#define NVM_OTPBLR1_CUR_LOCKBL7                 (0x1u<<7)
#define NVM_OTPBLR1_CUR_LOCKBL6                 (0x1u<<6)
#define NVM_OTPBLR1_CUR_LOCKBL5                 (0x1u<<5)
#define NVM_OTPBLR1_CUR_LOCKBL4                 (0x1u<<4)
#define NVM_OTPBLR1_CUR_LOCKBL3                 (0x1u<<3)
#define NVM_OTPBLR1_CUR_LOCKBL2                 (0x1u<<2)
#define NVM_OTPBLR1_CUR_LOCKBL1                 (0x1u<<1)
#define NVM_OTPBLR1_CUR_LOCKBL0                 (0x1u<<0)

#define NVM_OTPBLR1_CUR_LOCKBL31_B_0X0          (0x0u<<31)
#define NVM_OTPBLR1_CUR_LOCKBL31_B_0X1          (0x1u<<31)
#define NVM_OTPBLR1_CUR_LOCKBL30_B_0X0          (0x0u<<30)
#define NVM_OTPBLR1_CUR_LOCKBL30_B_0X1          (0x1u<<30)
#define NVM_OTPBLR1_CUR_LOCKBL29_B_0X0          (0x0u<<29)
#define NVM_OTPBLR1_CUR_LOCKBL29_B_0X1          (0x1u<<29)
#define NVM_OTPBLR1_CUR_LOCKBL28_B_0X0          (0x0u<<28)
#define NVM_OTPBLR1_CUR_LOCKBL28_B_0X1          (0x1u<<28)
#define NVM_OTPBLR1_CUR_LOCKBL27_B_0X0          (0x0u<<27)
#define NVM_OTPBLR1_CUR_LOCKBL27_B_0X1          (0x1u<<27)
#define NVM_OTPBLR1_CUR_LOCKBL26_B_0X0          (0x0u<<26)
#define NVM_OTPBLR1_CUR_LOCKBL26_B_0X1          (0x1u<<26)
#define NVM_OTPBLR1_CUR_LOCKBL25_B_0X0          (0x0u<<25)
#define NVM_OTPBLR1_CUR_LOCKBL25_B_0X1          (0x1u<<25)
#define NVM_OTPBLR1_CUR_LOCKBL24_B_0X0          (0x0u<<24)
#define NVM_OTPBLR1_CUR_LOCKBL24_B_0X1          (0x1u<<24)
#define NVM_OTPBLR1_CUR_LOCKBL23_B_0X0          (0x0u<<23)
#define NVM_OTPBLR1_CUR_LOCKBL23_B_0X1          (0x1u<<23)
#define NVM_OTPBLR1_CUR_LOCKBL22_B_0X0          (0x0u<<22)
#define NVM_OTPBLR1_CUR_LOCKBL22_B_0X1          (0x1u<<22)
#define NVM_OTPBLR1_CUR_LOCKBL21_B_0X0          (0x0u<<21)
#define NVM_OTPBLR1_CUR_LOCKBL21_B_0X1          (0x1u<<21)
#define NVM_OTPBLR1_CUR_LOCKBL20_B_0X0          (0x0u<<20)
#define NVM_OTPBLR1_CUR_LOCKBL20_B_0X1          (0x1u<<20)
#define NVM_OTPBLR1_CUR_LOCKBL19_B_0X0          (0x0u<<19)
#define NVM_OTPBLR1_CUR_LOCKBL19_B_0X1          (0x1u<<19)
#define NVM_OTPBLR1_CUR_LOCKBL18_B_0X0          (0x0u<<18)
#define NVM_OTPBLR1_CUR_LOCKBL18_B_0X1          (0x1u<<18)
#define NVM_OTPBLR1_CUR_LOCKBL17_B_0X0          (0x0u<<17)
#define NVM_OTPBLR1_CUR_LOCKBL17_B_0X1          (0x1u<<17)
#define NVM_OTPBLR1_CUR_LOCKBL16_B_0X0          (0x0u<<16)
#define NVM_OTPBLR1_CUR_LOCKBL16_B_0X1          (0x1u<<16)
#define NVM_OTPBLR1_CUR_LOCKBL15_B_0X0          (0x0u<<15)
#define NVM_OTPBLR1_CUR_LOCKBL15_B_0X1          (0x1u<<15)
#define NVM_OTPBLR1_CUR_LOCKBL14_B_0X0          (0x0u<<14)
#define NVM_OTPBLR1_CUR_LOCKBL14_B_0X1          (0x1u<<14)
#define NVM_OTPBLR1_CUR_LOCKBL13_B_0X0          (0x0u<<13)
#define NVM_OTPBLR1_CUR_LOCKBL13_B_0X1          (0x1u<<13)
#define NVM_OTPBLR1_CUR_LOCKBL12_B_0X0          (0x0u<<12)
#define NVM_OTPBLR1_CUR_LOCKBL12_B_0X1          (0x1u<<12)
#define NVM_OTPBLR1_CUR_LOCKBL11_B_0X0          (0x0u<<11)
#define NVM_OTPBLR1_CUR_LOCKBL11_B_0X1          (0x1u<<11)
#define NVM_OTPBLR1_CUR_LOCKBL10_B_0X0          (0x0u<<10)
#define NVM_OTPBLR1_CUR_LOCKBL10_B_0X1          (0x1u<<10)
#define NVM_OTPBLR1_CUR_LOCKBL9_B_0X0           (0x0u<<9)
#define NVM_OTPBLR1_CUR_LOCKBL9_B_0X1           (0x1u<<9)
#define NVM_OTPBLR1_CUR_LOCKBL8_B_0X0           (0x0u<<8)
#define NVM_OTPBLR1_CUR_LOCKBL8_B_0X1           (0x1u<<8)
#define NVM_OTPBLR1_CUR_LOCKBL7_B_0X0           (0x0u<<7)
#define NVM_OTPBLR1_CUR_LOCKBL7_B_0X1           (0x1u<<7)
#define NVM_OTPBLR1_CUR_LOCKBL6_B_0X0           (0x0u<<6)
#define NVM_OTPBLR1_CUR_LOCKBL6_B_0X1           (0x1u<<6)
#define NVM_OTPBLR1_CUR_LOCKBL5_B_0X0           (0x0u<<5)
#define NVM_OTPBLR1_CUR_LOCKBL5_B_0X1           (0x1u<<5)
#define NVM_OTPBLR1_CUR_LOCKBL4_B_0X0           (0x0u<<4)
#define NVM_OTPBLR1_CUR_LOCKBL4_B_0X1           (0x1u<<4)
#define NVM_OTPBLR1_CUR_LOCKBL3_B_0X0           (0x0u<<3)
#define NVM_OTPBLR1_CUR_LOCKBL3_B_0X1           (0x1u<<3)
#define NVM_OTPBLR1_CUR_LOCKBL2_B_0X0           (0x0u<<2)
#define NVM_OTPBLR1_CUR_LOCKBL2_B_0X1           (0x1u<<2)
#define NVM_OTPBLR1_CUR_LOCKBL1_B_0X0           (0x0u<<1)
#define NVM_OTPBLR1_CUR_LOCKBL1_B_0X1           (0x1u<<1)
#define NVM_OTPBLR1_CUR_LOCKBL0_B_0X0           (0x0u<<0)
#define NVM_OTPBLR1_CUR_LOCKBL0_B_0X1           (0x1u<<0)

// OTPBLR1_PRG Configuration

