Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_nvm.h
#define NVM_OTPBLR1_PRG_LOCKBL31                (0x1u<<31)
#define NVM_OTPBLR1_PRG_LOCKBL30                (0x1u<<30)
#define NVM_OTPBLR1_PRG_LOCKBL29                (0x1u<<29)
#define NVM_OTPBLR1_PRG_LOCKBL28                (0x1u<<28)
#define NVM_OTPBLR1_PRG_LOCKBL27                (0x1u<<27)
#define NVM_OTPBLR1_PRG_LOCKBL26                (0x1u<<26)
#define NVM_OTPBLR1_PRG_LOCKBL25                (0x1u<<25)
#define NVM_OTPBLR1_PRG_LOCKBL24                (0x1u<<24)
#define NVM_OTPBLR1_PRG_LOCKBL23                (0x1u<<23)
#define NVM_OTPBLR1_PRG_LOCKBL22                (0x1u<<22)
#define NVM_OTPBLR1_PRG_LOCKBL21                (0x1u<<21)
#define NVM_OTPBLR1_PRG_LOCKBL20                (0x1u<<20)
#define NVM_OTPBLR1_PRG_LOCKBL19                (0x1u<<19)
#define NVM_OTPBLR1_PRG_LOCKBL18                (0x1u<<18)
#define NVM_OTPBLR1_PRG_LOCKBL17                (0x1u<<17)
#define NVM_OTPBLR1_PRG_LOCKBL16                (0x1u<<16)
#define NVM_OTPBLR1_PRG_LOCKBL15                (0x1u<<15)
#define NVM_OTPBLR1_PRG_LOCKBL14                (0x1u<<14)
#define NVM_OTPBLR1_PRG_LOCKBL13                (0x1u<<13)
#define NVM_OTPBLR1_PRG_LOCKBL12                (0x1u<<12)
#define NVM_OTPBLR1_PRG_LOCKBL11                (0x1u<<11)
#define NVM_OTPBLR1_PRG_LOCKBL10                (0x1u<<10)
#define NVM_OTPBLR1_PRG_LOCKBL9                 (0x1u<<9)
#define NVM_OTPBLR1_PRG_LOCKBL8                 (0x1u<<8)
#define NVM_OTPBLR1_PRG_LOCKBL7                 (0x1u<<7)
#define NVM_OTPBLR1_PRG_LOCKBL6                 (0x1u<<6)
#define NVM_OTPBLR1_PRG_LOCKBL5                 (0x1u<<5)
#define NVM_OTPBLR1_PRG_LOCKBL4                 (0x1u<<4)
#define NVM_OTPBLR1_PRG_LOCKBL3                 (0x1u<<3)
#define NVM_OTPBLR1_PRG_LOCKBL2                 (0x1u<<2)
#define NVM_OTPBLR1_PRG_LOCKBL1                 (0x1u<<1)
#define NVM_OTPBLR1_PRG_LOCKBL0                 (0x1u<<0)

#define NVM_OTPBLR1_PRG_LOCKBL31_B_0X0          (0x0u<<31)
#define NVM_OTPBLR1_PRG_LOCKBL31_B_0X1          (0x1u<<31)
#define NVM_OTPBLR1_PRG_LOCKBL30_B_0X0          (0x0u<<30)
#define NVM_OTPBLR1_PRG_LOCKBL30_B_0X1          (0x1u<<30)
#define NVM_OTPBLR1_PRG_LOCKBL29_B_0X0          (0x0u<<29)
#define NVM_OTPBLR1_PRG_LOCKBL29_B_0X1          (0x1u<<29)
#define NVM_OTPBLR1_PRG_LOCKBL28_B_0X0          (0x0u<<28)
#define NVM_OTPBLR1_PRG_LOCKBL28_B_0X1          (0x1u<<28)
#define NVM_OTPBLR1_PRG_LOCKBL27_B_0X0          (0x0u<<27)
#define NVM_OTPBLR1_PRG_LOCKBL27_B_0X1          (0x1u<<27)
#define NVM_OTPBLR1_PRG_LOCKBL26_B_0X0          (0x0u<<26)
#define NVM_OTPBLR1_PRG_LOCKBL26_B_0X1          (0x1u<<26)
#define NVM_OTPBLR1_PRG_LOCKBL25_B_0X0          (0x0u<<25)
#define NVM_OTPBLR1_PRG_LOCKBL25_B_0X1          (0x1u<<25)
#define NVM_OTPBLR1_PRG_LOCKBL24_B_0X0          (0x0u<<24)
#define NVM_OTPBLR1_PRG_LOCKBL24_B_0X1          (0x1u<<24)
#define NVM_OTPBLR1_PRG_LOCKBL23_B_0X0          (0x0u<<23)
#define NVM_OTPBLR1_PRG_LOCKBL23_B_0X1          (0x1u<<23)
#define NVM_OTPBLR1_PRG_LOCKBL22_B_0X0          (0x0u<<22)
#define NVM_OTPBLR1_PRG_LOCKBL22_B_0X1          (0x1u<<22)
#define NVM_OTPBLR1_PRG_LOCKBL21_B_0X0          (0x0u<<21)
#define NVM_OTPBLR1_PRG_LOCKBL21_B_0X1          (0x1u<<21)
#define NVM_OTPBLR1_PRG_LOCKBL20_B_0X0          (0x0u<<20)
#define NVM_OTPBLR1_PRG_LOCKBL20_B_0X1          (0x1u<<20)
#define NVM_OTPBLR1_PRG_LOCKBL19_B_0X0          (0x0u<<19)
#define NVM_OTPBLR1_PRG_LOCKBL19_B_0X1          (0x1u<<19)
#define NVM_OTPBLR1_PRG_LOCKBL18_B_0X0          (0x0u<<18)
#define NVM_OTPBLR1_PRG_LOCKBL18_B_0X1          (0x1u<<18)
#define NVM_OTPBLR1_PRG_LOCKBL17_B_0X0          (0x0u<<17)
#define NVM_OTPBLR1_PRG_LOCKBL17_B_0X1          (0x1u<<17)
#define NVM_OTPBLR1_PRG_LOCKBL16_B_0X0          (0x0u<<16)
#define NVM_OTPBLR1_PRG_LOCKBL16_B_0X1          (0x1u<<16)
#define NVM_OTPBLR1_PRG_LOCKBL15_B_0X0          (0x0u<<15)
#define NVM_OTPBLR1_PRG_LOCKBL15_B_0X1          (0x1u<<15)
#define NVM_OTPBLR1_PRG_LOCKBL14_B_0X0          (0x0u<<14)
#define NVM_OTPBLR1_PRG_LOCKBL14_B_0X1          (0x1u<<14)
#define NVM_OTPBLR1_PRG_LOCKBL13_B_0X0          (0x0u<<13)
#define NVM_OTPBLR1_PRG_LOCKBL13_B_0X1          (0x1u<<13)
#define NVM_OTPBLR1_PRG_LOCKBL12_B_0X0          (0x0u<<12)
#define NVM_OTPBLR1_PRG_LOCKBL12_B_0X1          (0x1u<<12)
#define NVM_OTPBLR1_PRG_LOCKBL11_B_0X0          (0x0u<<11)
#define NVM_OTPBLR1_PRG_LOCKBL11_B_0X1          (0x1u<<11)
#define NVM_OTPBLR1_PRG_LOCKBL10_B_0X0          (0x0u<<10)
#define NVM_OTPBLR1_PRG_LOCKBL10_B_0X1          (0x1u<<10)
#define NVM_OTPBLR1_PRG_LOCKBL9_B_0X0           (0x0u<<9)
#define NVM_OTPBLR1_PRG_LOCKBL9_B_0X1           (0x1u<<9)
#define NVM_OTPBLR1_PRG_LOCKBL8_B_0X0           (0x0u<<8)
#define NVM_OTPBLR1_PRG_LOCKBL8_B_0X1           (0x1u<<8)
#define NVM_OTPBLR1_PRG_LOCKBL7_B_0X0           (0x0u<<7)
#define NVM_OTPBLR1_PRG_LOCKBL7_B_0X1           (0x1u<<7)
#define NVM_OTPBLR1_PRG_LOCKBL6_B_0X0           (0x0u<<6)
#define NVM_OTPBLR1_PRG_LOCKBL6_B_0X1           (0x1u<<6)
#define NVM_OTPBLR1_PRG_LOCKBL5_B_0X0           (0x0u<<5)
#define NVM_OTPBLR1_PRG_LOCKBL5_B_0X1           (0x1u<<5)
#define NVM_OTPBLR1_PRG_LOCKBL4_B_0X0           (0x0u<<4)
#define NVM_OTPBLR1_PRG_LOCKBL4_B_0X1           (0x1u<<4)
#define NVM_OTPBLR1_PRG_LOCKBL3_B_0X0           (0x0u<<3)
#define NVM_OTPBLR1_PRG_LOCKBL3_B_0X1           (0x1u<<3)
#define NVM_OTPBLR1_PRG_LOCKBL2_B_0X0           (0x0u<<2)
#define NVM_OTPBLR1_PRG_LOCKBL2_B_0X1           (0x1u<<2)
#define NVM_OTPBLR1_PRG_LOCKBL1_B_0X0           (0x0u<<1)
#define NVM_OTPBLR1_PRG_LOCKBL1_B_0X1           (0x1u<<1)
#define NVM_OTPBLR1_PRG_LOCKBL0_B_0X0           (0x0u<<0)
#define NVM_OTPBLR1_PRG_LOCKBL0_B_0X1           (0x1u<<0)

// OTPBLR2_CUR Configuration

#define NVM_OTPBLR2_CUR_LOCKBL63                (0x1u<<31)
#define NVM_OTPBLR2_CUR_LOCKBL62                (0x1u<<30)
#define NVM_OTPBLR2_CUR_LOCKBL61                (0x1u<<29)
#define NVM_OTPBLR2_CUR_LOCKBL60                (0x1u<<28)
#define NVM_OTPBLR2_CUR_LOCKBL59                (0x1u<<27)
#define NVM_OTPBLR2_CUR_LOCKBL58                (0x1u<<26)
#define NVM_OTPBLR2_CUR_LOCKBL57                (0x1u<<25)
#define NVM_OTPBLR2_CUR_LOCKBL56                (0x1u<<24)
#define NVM_OTPBLR2_CUR_LOCKBL55                (0x1u<<23)
#define NVM_OTPBLR2_CUR_LOCKBL54                (0x1u<<22)
#define NVM_OTPBLR2_CUR_LOCKBL53                (0x1u<<21)
#define NVM_OTPBLR2_CUR_LOCKBL52                (0x1u<<20)
#define NVM_OTPBLR2_CUR_LOCKBL51                (0x1u<<19)
#define NVM_OTPBLR2_CUR_LOCKBL50                (0x1u<<18)
#define NVM_OTPBLR2_CUR_LOCKBL49                (0x1u<<17)
#define NVM_OTPBLR2_CUR_LOCKBL48                (0x1u<<16)
#define NVM_OTPBLR2_CUR_LOCKBL47                (0x1u<<15)
#define NVM_OTPBLR2_CUR_LOCKBL46                (0x1u<<14)
#define NVM_OTPBLR2_CUR_LOCKBL45                (0x1u<<13)
#define NVM_OTPBLR2_CUR_LOCKBL44                (0x1u<<12)
#define NVM_OTPBLR2_CUR_LOCKBL43                (0x1u<<11)
#define NVM_OTPBLR2_CUR_LOCKBL42                (0x1u<<10)
#define NVM_OTPBLR2_CUR_LOCKBL41                (0x1u<<9)
#define NVM_OTPBLR2_CUR_LOCKBL40                (0x1u<<8)
#define NVM_OTPBLR2_CUR_LOCKBL39                (0x1u<<7)
#define NVM_OTPBLR2_CUR_LOCKBL38                (0x1u<<6)
#define NVM_OTPBLR2_CUR_LOCKBL37                (0x1u<<5)
#define NVM_OTPBLR2_CUR_LOCKBL36                (0x1u<<4)
#define NVM_OTPBLR2_CUR_LOCKBL35                (0x1u<<3)
#define NVM_OTPBLR2_CUR_LOCKBL34                (0x1u<<2)
#define NVM_OTPBLR2_CUR_LOCKBL33                (0x1u<<1)
#define NVM_OTPBLR2_CUR_LOCKBL32                (0x1u<<0)

#define NVM_OTPBLR2_CUR_LOCKBL63_B_0X0          (0x0u<<31)
#define NVM_OTPBLR2_CUR_LOCKBL63_B_0X1          (0x1u<<31)
#define NVM_OTPBLR2_CUR_LOCKBL62_B_0X0          (0x0u<<30)
#define NVM_OTPBLR2_CUR_LOCKBL62_B_0X1          (0x1u<<30)
#define NVM_OTPBLR2_CUR_LOCKBL61_B_0X0          (0x0u<<29)
#define NVM_OTPBLR2_CUR_LOCKBL61_B_0X1          (0x1u<<29)
#define NVM_OTPBLR2_CUR_LOCKBL60_B_0X0          (0x0u<<28)
#define NVM_OTPBLR2_CUR_LOCKBL60_B_0X1          (0x1u<<28)
#define NVM_OTPBLR2_CUR_LOCKBL59_B_0X0          (0x0u<<27)
#define NVM_OTPBLR2_CUR_LOCKBL59_B_0X1          (0x1u<<27)
#define NVM_OTPBLR2_CUR_LOCKBL58_B_0X0          (0x0u<<26)
#define NVM_OTPBLR2_CUR_LOCKBL58_B_0X1          (0x1u<<26)
#define NVM_OTPBLR2_CUR_LOCKBL57_B_0X0          (0x0u<<25)
#define NVM_OTPBLR2_CUR_LOCKBL57_B_0X1          (0x1u<<25)
#define NVM_OTPBLR2_CUR_LOCKBL56_B_0X0          (0x0u<<24)
#define NVM_OTPBLR2_CUR_LOCKBL56_B_0X1          (0x1u<<24)
#define NVM_OTPBLR2_CUR_LOCKBL55_B_0X0          (0x0u<<23)
#define NVM_OTPBLR2_CUR_LOCKBL55_B_0X1          (0x1u<<23)
#define NVM_OTPBLR2_CUR_LOCKBL54_B_0X0          (0x0u<<22)
#define NVM_OTPBLR2_CUR_LOCKBL54_B_0X1          (0x1u<<22)
#define NVM_OTPBLR2_CUR_LOCKBL53_B_0X0          (0x0u<<21)
#define NVM_OTPBLR2_CUR_LOCKBL53_B_0X1          (0x1u<<21)
#define NVM_OTPBLR2_CUR_LOCKBL52_B_0X0          (0x0u<<20)
#define NVM_OTPBLR2_CUR_LOCKBL52_B_0X1          (0x1u<<20)
#define NVM_OTPBLR2_CUR_LOCKBL51_B_0X0          (0x0u<<19)
#define NVM_OTPBLR2_CUR_LOCKBL51_B_0X1          (0x1u<<19)
#define NVM_OTPBLR2_CUR_LOCKBL50_B_0X0          (0x0u<<18)
#define NVM_OTPBLR2_CUR_LOCKBL50_B_0X1          (0x1u<<18)
#define NVM_OTPBLR2_CUR_LOCKBL49_B_0X0          (0x0u<<17)
#define NVM_OTPBLR2_CUR_LOCKBL49_B_0X1          (0x1u<<17)
#define NVM_OTPBLR2_CUR_LOCKBL48_B_0X0          (0x0u<<16)
#define NVM_OTPBLR2_CUR_LOCKBL48_B_0X1          (0x1u<<16)
#define NVM_OTPBLR2_CUR_LOCKBL47_B_0X0          (0x0u<<15)
#define NVM_OTPBLR2_CUR_LOCKBL47_B_0X1          (0x1u<<15)
#define NVM_OTPBLR2_CUR_LOCKBL46_B_0X0          (0x0u<<14)
#define NVM_OTPBLR2_CUR_LOCKBL46_B_0X1          (0x1u<<14)
#define NVM_OTPBLR2_CUR_LOCKBL45_B_0X0          (0x0u<<13)
#define NVM_OTPBLR2_CUR_LOCKBL45_B_0X1          (0x1u<<13)
#define NVM_OTPBLR2_CUR_LOCKBL44_B_0X0          (0x0u<<12)
#define NVM_OTPBLR2_CUR_LOCKBL44_B_0X1          (0x1u<<12)
#define NVM_OTPBLR2_CUR_LOCKBL43_B_0X0          (0x0u<<11)
#define NVM_OTPBLR2_CUR_LOCKBL43_B_0X1          (0x1u<<11)
#define NVM_OTPBLR2_CUR_LOCKBL42_B_0X0          (0x0u<<10)
#define NVM_OTPBLR2_CUR_LOCKBL42_B_0X1          (0x1u<<10)
#define NVM_OTPBLR2_CUR_LOCKBL41_B_0X0          (0x0u<<9)
#define NVM_OTPBLR2_CUR_LOCKBL41_B_0X1          (0x1u<<9)
#define NVM_OTPBLR2_CUR_LOCKBL40_B_0X0          (0x0u<<8)
#define NVM_OTPBLR2_CUR_LOCKBL40_B_0X1          (0x1u<<8)
#define NVM_OTPBLR2_CUR_LOCKBL39_B_0X0          (0x0u<<7)
#define NVM_OTPBLR2_CUR_LOCKBL39_B_0X1          (0x1u<<7)
#define NVM_OTPBLR2_CUR_LOCKBL38_B_0X0          (0x0u<<6)
#define NVM_OTPBLR2_CUR_LOCKBL38_B_0X1          (0x1u<<6)
#define NVM_OTPBLR2_CUR_LOCKBL37_B_0X0          (0x0u<<5)
#define NVM_OTPBLR2_CUR_LOCKBL37_B_0X1          (0x1u<<5)
#define NVM_OTPBLR2_CUR_LOCKBL36_B_0X0          (0x0u<<4)
#define NVM_OTPBLR2_CUR_LOCKBL36_B_0X1          (0x1u<<4)
#define NVM_OTPBLR2_CUR_LOCKBL35_B_0X0          (0x0u<<3)
#define NVM_OTPBLR2_CUR_LOCKBL35_B_0X1          (0x1u<<3)
#define NVM_OTPBLR2_CUR_LOCKBL34_B_0X0          (0x0u<<2)
#define NVM_OTPBLR2_CUR_LOCKBL34_B_0X1          (0x1u<<2)
#define NVM_OTPBLR2_CUR_LOCKBL33_B_0X0          (0x0u<<1)
#define NVM_OTPBLR2_CUR_LOCKBL33_B_0X1          (0x1u<<1)
#define NVM_OTPBLR2_CUR_LOCKBL32_B_0X0          (0x0u<<0)
#define NVM_OTPBLR2_CUR_LOCKBL32_B_0X1          (0x1u<<0)

// OTPBLR2_PRG Configuration

#define NVM_OTPBLR2_PRG_LOCKBL63                (0x1u<<31)
#define NVM_OTPBLR2_PRG_LOCKBL62                (0x1u<<30)
#define NVM_OTPBLR2_PRG_LOCKBL61                (0x1u<<29)
#define NVM_OTPBLR2_PRG_LOCKBL60                (0x1u<<28)
#define NVM_OTPBLR2_PRG_LOCKBL59                (0x1u<<27)
#define NVM_OTPBLR2_PRG_LOCKBL58                (0x1u<<26)
#define NVM_OTPBLR2_PRG_LOCKBL57                (0x1u<<25)
#define NVM_OTPBLR2_PRG_LOCKBL56                (0x1u<<24)
#define NVM_OTPBLR2_PRG_LOCKBL55                (0x1u<<23)
#define NVM_OTPBLR2_PRG_LOCKBL54                (0x1u<<22)
#define NVM_OTPBLR2_PRG_LOCKBL53                (0x1u<<21)
#define NVM_OTPBLR2_PRG_LOCKBL52                (0x1u<<20)
#define NVM_OTPBLR2_PRG_LOCKBL51                (0x1u<<19)
#define NVM_OTPBLR2_PRG_LOCKBL50                (0x1u<<18)
#define NVM_OTPBLR2_PRG_LOCKBL49                (0x1u<<17)
#define NVM_OTPBLR2_PRG_LOCKBL48                (0x1u<<16)
#define NVM_OTPBLR2_PRG_LOCKBL47                (0x1u<<15)
#define NVM_OTPBLR2_PRG_LOCKBL46                (0x1u<<14)
#define NVM_OTPBLR2_PRG_LOCKBL45                (0x1u<<13)
#define NVM_OTPBLR2_PRG_LOCKBL44                (0x1u<<12)
#define NVM_OTPBLR2_PRG_LOCKBL43                (0x1u<<11)
#define NVM_OTPBLR2_PRG_LOCKBL42                (0x1u<<10)
#define NVM_OTPBLR2_PRG_LOCKBL41                (0x1u<<9)
#define NVM_OTPBLR2_PRG_LOCKBL40                (0x1u<<8)
#define NVM_OTPBLR2_PRG_LOCKBL39                (0x1u<<7)
#define NVM_OTPBLR2_PRG_LOCKBL38                (0x1u<<6)
#define NVM_OTPBLR2_PRG_LOCKBL37                (0x1u<<5)
#define NVM_OTPBLR2_PRG_LOCKBL36                (0x1u<<4)
#define NVM_OTPBLR2_PRG_LOCKBL35                (0x1u<<3)
#define NVM_OTPBLR2_PRG_LOCKBL34                (0x1u<<2)
#define NVM_OTPBLR2_PRG_LOCKBL33                (0x1u<<1)
#define NVM_OTPBLR2_PRG_LOCKBL32                (0x1u<<0)

#define NVM_OTPBLR2_PRG_LOCKBL63_B_0X0          (0x0u<<31)
#define NVM_OTPBLR2_PRG_LOCKBL63_B_0X1          (0x1u<<31)
#define NVM_OTPBLR2_PRG_LOCKBL62_B_0X0          (0x0u<<30)
#define NVM_OTPBLR2_PRG_LOCKBL62_B_0X1          (0x1u<<30)
#define NVM_OTPBLR2_PRG_LOCKBL61_B_0X0          (0x0u<<29)
#define NVM_OTPBLR2_PRG_LOCKBL61_B_0X1          (0x1u<<29)
#define NVM_OTPBLR2_PRG_LOCKBL60_B_0X0          (0x0u<<28)
#define NVM_OTPBLR2_PRG_LOCKBL60_B_0X1          (0x1u<<28)
#define NVM_OTPBLR2_PRG_LOCKBL59_B_0X0          (0x0u<<27)
#define NVM_OTPBLR2_PRG_LOCKBL59_B_0X1          (0x1u<<27)
#define NVM_OTPBLR2_PRG_LOCKBL58_B_0X0          (0x0u<<26)
#define NVM_OTPBLR2_PRG_LOCKBL58_B_0X1          (0x1u<<26)
#define NVM_OTPBLR2_PRG_LOCKBL57_B_0X0          (0x0u<<25)
#define NVM_OTPBLR2_PRG_LOCKBL57_B_0X1          (0x1u<<25)
#define NVM_OTPBLR2_PRG_LOCKBL56_B_0X0          (0x0u<<24)
#define NVM_OTPBLR2_PRG_LOCKBL56_B_0X1          (0x1u<<24)
#define NVM_OTPBLR2_PRG_LOCKBL55_B_0X0          (0x0u<<23)
#define NVM_OTPBLR2_PRG_LOCKBL55_B_0X1          (0x1u<<23)
#define NVM_OTPBLR2_PRG_LOCKBL54_B_0X0          (0x0u<<22)
#define NVM_OTPBLR2_PRG_LOCKBL54_B_0X1          (0x1u<<22)
#define NVM_OTPBLR2_PRG_LOCKBL53_B_0X0          (0x0u<<21)
#define NVM_OTPBLR2_PRG_LOCKBL53_B_0X1          (0x1u<<21)
#define NVM_OTPBLR2_PRG_LOCKBL52_B_0X0          (0x0u<<20)
#define NVM_OTPBLR2_PRG_LOCKBL52_B_0X1          (0x1u<<20)
#define NVM_OTPBLR2_PRG_LOCKBL51_B_0X0          (0x0u<<19)
#define NVM_OTPBLR2_PRG_LOCKBL51_B_0X1          (0x1u<<19)
#define NVM_OTPBLR2_PRG_LOCKBL50_B_0X0          (0x0u<<18)
#define NVM_OTPBLR2_PRG_LOCKBL50_B_0X1          (0x1u<<18)
#define NVM_OTPBLR2_PRG_LOCKBL49_B_0X0          (0x0u<<17)
#define NVM_OTPBLR2_PRG_LOCKBL49_B_0X1          (0x1u<<17)
#define NVM_OTPBLR2_PRG_LOCKBL48_B_0X0          (0x0u<<16)
#define NVM_OTPBLR2_PRG_LOCKBL48_B_0X1          (0x1u<<16)
#define NVM_OTPBLR2_PRG_LOCKBL47_B_0X0          (0x0u<<15)
#define NVM_OTPBLR2_PRG_LOCKBL47_B_0X1          (0x1u<<15)
#define NVM_OTPBLR2_PRG_LOCKBL46_B_0X0          (0x0u<<14)
#define NVM_OTPBLR2_PRG_LOCKBL46_B_0X1          (0x1u<<14)
#define NVM_OTPBLR2_PRG_LOCKBL45_B_0X0          (0x0u<<13)
#define NVM_OTPBLR2_PRG_LOCKBL45_B_0X1          (0x1u<<13)
#define NVM_OTPBLR2_PRG_LOCKBL44_B_0X0          (0x0u<<12)
#define NVM_OTPBLR2_PRG_LOCKBL44_B_0X1          (0x1u<<12)
#define NVM_OTPBLR2_PRG_LOCKBL43_B_0X0          (0x0u<<11)
#define NVM_OTPBLR2_PRG_LOCKBL43_B_0X1          (0x1u<<11)
#define NVM_OTPBLR2_PRG_LOCKBL42_B_0X0          (0x0u<<10)
#define NVM_OTPBLR2_PRG_LOCKBL42_B_0X1          (0x1u<<10)
#define NVM_OTPBLR2_PRG_LOCKBL41_B_0X0          (0x0u<<9)
#define NVM_OTPBLR2_PRG_LOCKBL41_B_0X1          (0x1u<<9)
#define NVM_OTPBLR2_PRG_LOCKBL40_B_0X0          (0x0u<<8)
#define NVM_OTPBLR2_PRG_LOCKBL40_B_0X1          (0x1u<<8)
#define NVM_OTPBLR2_PRG_LOCKBL39_B_0X0          (0x0u<<7)
#define NVM_OTPBLR2_PRG_LOCKBL39_B_0X1          (0x1u<<7)
#define NVM_OTPBLR2_PRG_LOCKBL38_B_0X0          (0x0u<<6)
#define NVM_OTPBLR2_PRG_LOCKBL38_B_0X1          (0x1u<<6)
#define NVM_OTPBLR2_PRG_LOCKBL37_B_0X0          (0x0u<<5)
#define NVM_OTPBLR2_PRG_LOCKBL37_B_0X1          (0x1u<<5)
#define NVM_OTPBLR2_PRG_LOCKBL36_B_0X0          (0x0u<<4)
#define NVM_OTPBLR2_PRG_LOCKBL36_B_0X1          (0x1u<<4)
#define NVM_OTPBLR2_PRG_LOCKBL35_B_0X0          (0x0u<<3)
#define NVM_OTPBLR2_PRG_LOCKBL35_B_0X1          (0x1u<<3)
#define NVM_OTPBLR2_PRG_LOCKBL34_B_0X0          (0x0u<<2)
#define NVM_OTPBLR2_PRG_LOCKBL34_B_0X1          (0x1u<<2)
#define NVM_OTPBLR2_PRG_LOCKBL33_B_0X0          (0x0u<<1)
#define NVM_OTPBLR2_PRG_LOCKBL33_B_0X1          (0x1u<<1)
#define NVM_OTPBLR2_PRG_LOCKBL32_B_0X0          (0x0u<<0)
#define NVM_OTPBLR2_PRG_LOCKBL32_B_0X1          (0x1u<<0)

// OBK1WRMR_CUR Configuration

#define NVM_OBK1WRMR_CUR_WRM                    (0x1u<<0)

#define NVM_OBK1WRMR_CUR_WRM_B_0X0              (0x0u<<0)
#define NVM_OBK1WRMR_CUR_WRM_B_0X1              (0x1u<<0)

// OBK1WRMR_PRG Configuration

#define NVM_OBK1WRMR_PRG_WRM                    (0x1u<<0)

#define NVM_OBK1WRMR_PRG_WRM_B_0X0              (0x0u<<0)
#define NVM_OBK1WRMR_PRG_WRM_B_0X1              (0x1u<<0)

// OBK2WRMR_CUR Configuration

#define NVM_OBK2WRMR_CUR_WRM                    (0x1u<<0)

