Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_nvm.h
#define NVM_OBK2WRMR_CUR_WRM_B_0X0              (0x0u<<0)
#define NVM_OBK2WRMR_CUR_WRM_B_0X1              (0x1u<<0)

// OBK2WRMR_PRG Configuration

#define NVM_OBK2WRMR_PRG_WRM                    (0x1u<<0)

#define NVM_OBK2WRMR_PRG_WRM_B_0X0              (0x0u<<0)
#define NVM_OBK2WRMR_PRG_WRM_B_0X1              (0x1u<<0)

// OBK3SWRMR_CUR Configuration

#define NVM_OBK3SWRMR_CUR_WRM                   (0x1u<<0)

#define NVM_OBK3SWRMR_CUR_WRM_B_0X0             (0x0u<<0)
#define NVM_OBK3SWRMR_CUR_WRM_B_0X1             (0x1u<<0)

// OBK3SWRMR_PRG Configuration

#define NVM_OBK3SWRMR_PRG_WRM                   (0x1u<<0)

#define NVM_OBK3SWRMR_PRG_WRM_B_0X0             (0x0u<<0)
#define NVM_OBK3SWRMR_PRG_WRM_B_0X1             (0x1u<<0)

// OBK3NSWRMR_CUR Configuration

#define NVM_OBK3NSWRMR_CUR_WRM                  (0x1u<<0)

#define NVM_OBK3NSWRMR_CUR_WRM_B_0X0            (0x0u<<0)
#define NVM_OBK3NSWRMR_CUR_WRM_B_0X1            (0x1u<<0)

// OBK3NSWRMR_PRG Configuration

#define NVM_OBK3NSWRMR_PRG_WRM                  (0x1u<<0)

#define NVM_OBK3NSWRMR_PRG_WRM_B_0X0            (0x0u<<0)
#define NVM_OBK3NSWRMR_PRG_WRM_B_0X1            (0x1u<<0)

// ECCSFADDR Configuration

#define NVM_ECCSFADDR_ADD                       (0xFFFFFFFFu<<0)
#define NVM_ECCSFADDR_ADD_0                     (0x1u<<0)

// ECCDFADDR Configuration

#define NVM_ECCDFADDR_ADD                       (0xFFFFFFFFu<<0)
#define NVM_ECCDFADDR_ADD_0                     (0x1u<<0)

// ECCTFADDR Configuration

#define NVM_ECCTFADDR_ADD                       (0xFFFFFFFFu<<0)
#define NVM_ECCTFADDR_ADD_0                     (0x1u<<0)

// SECCSFADDR Configuration

#define NVM_SECCSFADDR_ADD                      (0xFFFFFFFFu<<0)
#define NVM_SECCSFADDR_ADD_0                    (0x1u<<0)

// SECCDFADDR Configuration

#define NVM_SECCDFADDR_ADD                      (0xFFFFFFFFu<<0)
#define NVM_SECCDFADDR_ADD_0                    (0x1u<<0)

// SECCTFADDR Configuration

#define NVM_SECCTFADDR_ADD                      (0xFFFFFFFFu<<0)
#define NVM_SECCTFADDR_ADD_0                    (0x1u<<0)

// OPSR Configuration

#define NVM_OPSR_ADD                            (0xFFFFFFFu<<4)
#define NVM_OPSR_ADD_0                          (0x1u<<4)
#define NVM_OPSR_CODE                           (0xFu<<0)
#define NVM_OPSR_CODE_0                         (0x1u<<0)

#define NVM_OPSR_CODE_B_0X0                     (0x0u<<0)
#define NVM_OPSR_CODE_B_0X1                     (0x1u<<0)
#define NVM_OPSR_CODE_B_0X3                     (0x3u<<0)
#define NVM_OPSR_CODE_B_0X2                     (0x2u<<0)
#define NVM_OPSR_CODE_B_0X6                     (0x6u<<0)
#define NVM_OPSR_CODE_B_0X7                     (0x7u<<0)

// OBK1CR Configuration

#define NVM_OBK1CR_SWAPOFFSET                   (0xFFu<<16)
#define NVM_OBK1CR_SWAPOFFSET_0                 (0x1u<<16)
#define NVM_OBK1CR_OBKCMD                       (0x3u<<3)
#define NVM_OBK1CR_OBKCMD_0                     (0x1u<<3)
#define NVM_OBK1CR_ALTSECT                      (0x1u<<2)
#define NVM_OBK1CR_LOCK                         (0x1u<<0)

#define NVM_OBK1CR_SWAPOFFSET_B_0X0             (0x0u<<16)
#define NVM_OBK1CR_SWAPOFFSET_B_0X1             (0x1u<<16)
#define NVM_OBK1CR_SWAPOFFSET_B_0X2             (0x2u<<16)
#define NVM_OBK1CR_OBKCMD_B_0X1                 (0x1u<<3)
#define NVM_OBK1CR_OBKCMD_B_0X2                 (0x2u<<3)
#define NVM_OBK1CR_ALTSECT_B_0X0                (0x0u<<2)
#define NVM_OBK1CR_ALTSECT_B_0X1                (0x1u<<2)

// OBK2CR Configuration

#define NVM_OBK2CR_SWAPOFFSET                   (0x1FFu<<16)
#define NVM_OBK2CR_SWAPOFFSET_0                 (0x1u<<16)
#define NVM_OBK2CR_OBKCMD                       (0x3u<<3)
#define NVM_OBK2CR_OBKCMD_0                     (0x1u<<3)
#define NVM_OBK2CR_ALTSECT                      (0x1u<<2)
#define NVM_OBK2CR_LOCK                         (0x1u<<0)

#define NVM_OBK2CR_SWAPOFFSET_B_0X0             (0x0u<<16)
#define NVM_OBK2CR_SWAPOFFSET_B_0X1             (0x1u<<16)
#define NVM_OBK2CR_SWAPOFFSET_B_0X2             (0x2u<<16)
#define NVM_OBK2CR_OBKCMD_B_0X1                 (0x1u<<3)
#define NVM_OBK2CR_OBKCMD_B_0X2                 (0x2u<<3)
#define NVM_OBK2CR_ALTSECT_B_0X0                (0x0u<<2)
#define NVM_OBK2CR_ALTSECT_B_0X1                (0x1u<<2)

// OBK3SCR Configuration

#define NVM_OBK3SCR_SWAPOFFSET                  (0x1FFu<<16)
#define NVM_OBK3SCR_SWAPOFFSET_0                (0x1u<<16)
#define NVM_OBK3SCR_OBKCMD                      (0x3u<<3)
#define NVM_OBK3SCR_OBKCMD_0                    (0x1u<<3)
#define NVM_OBK3SCR_ALTSECT                     (0x1u<<2)
#define NVM_OBK3SCR_LOCK                        (0x1u<<0)

#define NVM_OBK3SCR_SWAPOFFSET_B_0X0            (0x0u<<16)
#define NVM_OBK3SCR_SWAPOFFSET_B_0X1            (0x1u<<16)
#define NVM_OBK3SCR_SWAPOFFSET_B_0X2            (0x2u<<16)
#define NVM_OBK3SCR_OBKCMD_B_0X1                (0x1u<<3)
#define NVM_OBK3SCR_OBKCMD_B_0X2                (0x2u<<3)
#define NVM_OBK3SCR_ALTSECT_B_0X0               (0x0u<<2)
#define NVM_OBK3SCR_ALTSECT_B_0X1               (0x1u<<2)

// OBK3NSCR Configuration

#define NVM_OBK3NSCR_SWAPOFFSET                 (0xFFu<<16)
#define NVM_OBK3NSCR_SWAPOFFSET_0               (0x1u<<16)
#define NVM_OBK3NSCR_OBKCMD                     (0x3u<<3)
#define NVM_OBK3NSCR_OBKCMD_0                   (0x1u<<3)
#define NVM_OBK3NSCR_ALTSECT                    (0x1u<<2)
#define NVM_OBK3NSCR_LOCK                       (0x1u<<0)

#define NVM_OBK3NSCR_SWAPOFFSET_B_0X0           (0x0u<<16)
#define NVM_OBK3NSCR_SWAPOFFSET_B_0X1           (0x1u<<16)
#define NVM_OBK3NSCR_SWAPOFFSET_B_0X2           (0x2u<<16)
#define NVM_OBK3NSCR_OBKCMD_B_0X1               (0x1u<<3)
#define NVM_OBK3NSCR_OBKCMD_B_0X2               (0x2u<<3)
#define NVM_OBK3NSCR_ALTSECT_B_0X0              (0x0u<<2)
#define NVM_OBK3NSCR_ALTSECT_B_0X1              (0x1u<<2)

// IASR Configuration

#define NVM_IASR_IAEF                           (0x1u<<1)
#define NVM_IASR_CAEF                           (0x1u<<0)

// IACR Configuration

#define NVM_IACR_IAEF                           (0x1u<<1)
#define NVM_IACR_CAEF                           (0x1u<<0)

// IAESR Configuration

#define NVM_IAESR_IANRW                         (0x1u<<7)
#define NVM_IAESR_IASEC                         (0x1u<<5)
#define NVM_IAESR_IAPRIV                        (0x1u<<4)

#define NVM_IAESR_IANRW_B_0X0                   (0x0u<<7)
#define NVM_IAESR_IANRW_B_0X1                   (0x1u<<7)
#define NVM_IAESR_IASEC_B_0X0                   (0x0u<<5)
#define NVM_IAESR_IASEC_B_0X1                   (0x1u<<5)
#define NVM_IAESR_IAPRIV_B_0X0                  (0x0u<<4)
#define NVM_IAESR_IAPRIV_B_0X1                  (0x1u<<4)

// IADDR Configuration

