Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_nvm.h
// SECBB1R2 Configuration

#define NVM_SECBB1R2_SEC63                      (0x1u<<31)
#define NVM_SECBB1R2_SEC62                      (0x1u<<30)
#define NVM_SECBB1R2_SEC61                      (0x1u<<29)
#define NVM_SECBB1R2_SEC60                      (0x1u<<28)
#define NVM_SECBB1R2_SEC59                      (0x1u<<27)
#define NVM_SECBB1R2_SEC58                      (0x1u<<26)
#define NVM_SECBB1R2_SEC57                      (0x1u<<25)
#define NVM_SECBB1R2_SEC56                      (0x1u<<24)
#define NVM_SECBB1R2_SEC55                      (0x1u<<23)
#define NVM_SECBB1R2_SEC54                      (0x1u<<22)
#define NVM_SECBB1R2_SEC53                      (0x1u<<21)
#define NVM_SECBB1R2_SEC52                      (0x1u<<20)
#define NVM_SECBB1R2_SEC51                      (0x1u<<19)
#define NVM_SECBB1R2_SEC50                      (0x1u<<18)
#define NVM_SECBB1R2_SEC49                      (0x1u<<17)
#define NVM_SECBB1R2_SEC48                      (0x1u<<16)
#define NVM_SECBB1R2_SEC47                      (0x1u<<15)
#define NVM_SECBB1R2_SEC46                      (0x1u<<14)
#define NVM_SECBB1R2_SEC45                      (0x1u<<13)
#define NVM_SECBB1R2_SEC44                      (0x1u<<12)
#define NVM_SECBB1R2_SEC43                      (0x1u<<11)
#define NVM_SECBB1R2_SEC42                      (0x1u<<10)
#define NVM_SECBB1R2_SEC41                      (0x1u<<9)
#define NVM_SECBB1R2_SEC40                      (0x1u<<8)
#define NVM_SECBB1R2_SEC39                      (0x1u<<7)
#define NVM_SECBB1R2_SEC38                      (0x1u<<6)
#define NVM_SECBB1R2_SEC37                      (0x1u<<5)
#define NVM_SECBB1R2_SEC36                      (0x1u<<4)
#define NVM_SECBB1R2_SEC35                      (0x1u<<3)
#define NVM_SECBB1R2_SEC34                      (0x1u<<2)
#define NVM_SECBB1R2_SEC33                      (0x1u<<1)
#define NVM_SECBB1R2_SEC32                      (0x1u<<0)

#define NVM_SECBB1R2_SEC63_B_0X0                (0x0u<<31)
#define NVM_SECBB1R2_SEC63_B_0X1                (0x1u<<31)
#define NVM_SECBB1R2_SEC62_B_0X0                (0x0u<<30)
#define NVM_SECBB1R2_SEC62_B_0X1                (0x1u<<30)
#define NVM_SECBB1R2_SEC61_B_0X0                (0x0u<<29)
#define NVM_SECBB1R2_SEC61_B_0X1                (0x1u<<29)
#define NVM_SECBB1R2_SEC60_B_0X0                (0x0u<<28)
#define NVM_SECBB1R2_SEC60_B_0X1                (0x1u<<28)
#define NVM_SECBB1R2_SEC59_B_0X0                (0x0u<<27)
#define NVM_SECBB1R2_SEC59_B_0X1                (0x1u<<27)
#define NVM_SECBB1R2_SEC58_B_0X0                (0x0u<<26)
#define NVM_SECBB1R2_SEC58_B_0X1                (0x1u<<26)
#define NVM_SECBB1R2_SEC57_B_0X0                (0x0u<<25)
#define NVM_SECBB1R2_SEC57_B_0X1                (0x1u<<25)
#define NVM_SECBB1R2_SEC56_B_0X0                (0x0u<<24)
#define NVM_SECBB1R2_SEC56_B_0X1                (0x1u<<24)
#define NVM_SECBB1R2_SEC55_B_0X0                (0x0u<<23)
#define NVM_SECBB1R2_SEC55_B_0X1                (0x1u<<23)
#define NVM_SECBB1R2_SEC54_B_0X0                (0x0u<<22)
#define NVM_SECBB1R2_SEC54_B_0X1                (0x1u<<22)
#define NVM_SECBB1R2_SEC53_B_0X0                (0x0u<<21)
#define NVM_SECBB1R2_SEC53_B_0X1                (0x1u<<21)
#define NVM_SECBB1R2_SEC52_B_0X0                (0x0u<<20)
#define NVM_SECBB1R2_SEC52_B_0X1                (0x1u<<20)
#define NVM_SECBB1R2_SEC51_B_0X0                (0x0u<<19)
#define NVM_SECBB1R2_SEC51_B_0X1                (0x1u<<19)
#define NVM_SECBB1R2_SEC50_B_0X0                (0x0u<<18)
#define NVM_SECBB1R2_SEC50_B_0X1                (0x1u<<18)
#define NVM_SECBB1R2_SEC49_B_0X0                (0x0u<<17)
#define NVM_SECBB1R2_SEC49_B_0X1                (0x1u<<17)
#define NVM_SECBB1R2_SEC48_B_0X0                (0x0u<<16)
#define NVM_SECBB1R2_SEC48_B_0X1                (0x1u<<16)
#define NVM_SECBB1R2_SEC47_B_0X0                (0x0u<<15)
#define NVM_SECBB1R2_SEC47_B_0X1                (0x1u<<15)
#define NVM_SECBB1R2_SEC46_B_0X0                (0x0u<<14)
#define NVM_SECBB1R2_SEC46_B_0X1                (0x1u<<14)
#define NVM_SECBB1R2_SEC45_B_0X0                (0x0u<<13)
#define NVM_SECBB1R2_SEC45_B_0X1                (0x1u<<13)
#define NVM_SECBB1R2_SEC44_B_0X0                (0x0u<<12)
#define NVM_SECBB1R2_SEC44_B_0X1                (0x1u<<12)
#define NVM_SECBB1R2_SEC43_B_0X0                (0x0u<<11)
#define NVM_SECBB1R2_SEC43_B_0X1                (0x1u<<11)
#define NVM_SECBB1R2_SEC42_B_0X0                (0x0u<<10)
#define NVM_SECBB1R2_SEC42_B_0X1                (0x1u<<10)
#define NVM_SECBB1R2_SEC41_B_0X0                (0x0u<<9)
#define NVM_SECBB1R2_SEC41_B_0X1                (0x1u<<9)
#define NVM_SECBB1R2_SEC40_B_0X0                (0x0u<<8)
#define NVM_SECBB1R2_SEC40_B_0X1                (0x1u<<8)
#define NVM_SECBB1R2_SEC39_B_0X0                (0x0u<<7)
#define NVM_SECBB1R2_SEC39_B_0X1                (0x1u<<7)
#define NVM_SECBB1R2_SEC38_B_0X0                (0x0u<<6)
#define NVM_SECBB1R2_SEC38_B_0X1                (0x1u<<6)
#define NVM_SECBB1R2_SEC37_B_0X0                (0x0u<<5)
#define NVM_SECBB1R2_SEC37_B_0X1                (0x1u<<5)
#define NVM_SECBB1R2_SEC36_B_0X0                (0x0u<<4)
#define NVM_SECBB1R2_SEC36_B_0X1                (0x1u<<4)
#define NVM_SECBB1R2_SEC35_B_0X0                (0x0u<<3)
#define NVM_SECBB1R2_SEC35_B_0X1                (0x1u<<3)
#define NVM_SECBB1R2_SEC34_B_0X0                (0x0u<<2)
#define NVM_SECBB1R2_SEC34_B_0X1                (0x1u<<2)
#define NVM_SECBB1R2_SEC33_B_0X0                (0x0u<<1)
#define NVM_SECBB1R2_SEC33_B_0X1                (0x1u<<1)
#define NVM_SECBB1R2_SEC32_B_0X0                (0x0u<<0)
#define NVM_SECBB1R2_SEC32_B_0X1                (0x1u<<0)

// SECBB1R3 Configuration

#define NVM_SECBB1R3_SEC95                      (0x1u<<31)
#define NVM_SECBB1R3_SEC94                      (0x1u<<30)
#define NVM_SECBB1R3_SEC93                      (0x1u<<29)
#define NVM_SECBB1R3_SEC92                      (0x1u<<28)
#define NVM_SECBB1R3_SEC91                      (0x1u<<27)
#define NVM_SECBB1R3_SEC90                      (0x1u<<26)
#define NVM_SECBB1R3_SEC89                      (0x1u<<25)
#define NVM_SECBB1R3_SEC88                      (0x1u<<24)
#define NVM_SECBB1R3_SEC87                      (0x1u<<23)
#define NVM_SECBB1R3_SEC86                      (0x1u<<22)
#define NVM_SECBB1R3_SEC85                      (0x1u<<21)
#define NVM_SECBB1R3_SEC84                      (0x1u<<20)
#define NVM_SECBB1R3_SEC83                      (0x1u<<19)
#define NVM_SECBB1R3_SEC82                      (0x1u<<18)
#define NVM_SECBB1R3_SEC81                      (0x1u<<17)
#define NVM_SECBB1R3_SEC80                      (0x1u<<16)
#define NVM_SECBB1R3_SEC79                      (0x1u<<15)
#define NVM_SECBB1R3_SEC78                      (0x1u<<14)
#define NVM_SECBB1R3_SEC77                      (0x1u<<13)
#define NVM_SECBB1R3_SEC76                      (0x1u<<12)
#define NVM_SECBB1R3_SEC75                      (0x1u<<11)
#define NVM_SECBB1R3_SEC74                      (0x1u<<10)
#define NVM_SECBB1R3_SEC73                      (0x1u<<9)
#define NVM_SECBB1R3_SEC72                      (0x1u<<8)
#define NVM_SECBB1R3_SEC71                      (0x1u<<7)
#define NVM_SECBB1R3_SEC70                      (0x1u<<6)
#define NVM_SECBB1R3_SEC69                      (0x1u<<5)
#define NVM_SECBB1R3_SEC68                      (0x1u<<4)
#define NVM_SECBB1R3_SEC67                      (0x1u<<3)
#define NVM_SECBB1R3_SEC66                      (0x1u<<2)
#define NVM_SECBB1R3_SEC65                      (0x1u<<1)
#define NVM_SECBB1R3_SEC64                      (0x1u<<0)

#define NVM_SECBB1R3_SEC95_B_0X0                (0x0u<<31)
#define NVM_SECBB1R3_SEC95_B_0X1                (0x1u<<31)
#define NVM_SECBB1R3_SEC94_B_0X0                (0x0u<<30)
#define NVM_SECBB1R3_SEC94_B_0X1                (0x1u<<30)
#define NVM_SECBB1R3_SEC93_B_0X0                (0x0u<<29)
#define NVM_SECBB1R3_SEC93_B_0X1                (0x1u<<29)
#define NVM_SECBB1R3_SEC92_B_0X0                (0x0u<<28)
#define NVM_SECBB1R3_SEC92_B_0X1                (0x1u<<28)
#define NVM_SECBB1R3_SEC91_B_0X0                (0x0u<<27)
#define NVM_SECBB1R3_SEC91_B_0X1                (0x1u<<27)
#define NVM_SECBB1R3_SEC90_B_0X0                (0x0u<<26)
#define NVM_SECBB1R3_SEC90_B_0X1                (0x1u<<26)
#define NVM_SECBB1R3_SEC89_B_0X0                (0x0u<<25)
#define NVM_SECBB1R3_SEC89_B_0X1                (0x1u<<25)
#define NVM_SECBB1R3_SEC88_B_0X0                (0x0u<<24)
#define NVM_SECBB1R3_SEC88_B_0X1                (0x1u<<24)
#define NVM_SECBB1R3_SEC87_B_0X0                (0x0u<<23)
#define NVM_SECBB1R3_SEC87_B_0X1                (0x1u<<23)
#define NVM_SECBB1R3_SEC86_B_0X0                (0x0u<<22)
#define NVM_SECBB1R3_SEC86_B_0X1                (0x1u<<22)
#define NVM_SECBB1R3_SEC85_B_0X0                (0x0u<<21)
#define NVM_SECBB1R3_SEC85_B_0X1                (0x1u<<21)
#define NVM_SECBB1R3_SEC84_B_0X0                (0x0u<<20)
#define NVM_SECBB1R3_SEC84_B_0X1                (0x1u<<20)
#define NVM_SECBB1R3_SEC83_B_0X0                (0x0u<<19)
#define NVM_SECBB1R3_SEC83_B_0X1                (0x1u<<19)
#define NVM_SECBB1R3_SEC82_B_0X0                (0x0u<<18)
#define NVM_SECBB1R3_SEC82_B_0X1                (0x1u<<18)
#define NVM_SECBB1R3_SEC81_B_0X0                (0x0u<<17)
#define NVM_SECBB1R3_SEC81_B_0X1                (0x1u<<17)
#define NVM_SECBB1R3_SEC80_B_0X0                (0x0u<<16)
#define NVM_SECBB1R3_SEC80_B_0X1                (0x1u<<16)
#define NVM_SECBB1R3_SEC79_B_0X0                (0x0u<<15)
#define NVM_SECBB1R3_SEC79_B_0X1                (0x1u<<15)
#define NVM_SECBB1R3_SEC78_B_0X0                (0x0u<<14)
#define NVM_SECBB1R3_SEC78_B_0X1                (0x1u<<14)
#define NVM_SECBB1R3_SEC77_B_0X0                (0x0u<<13)
#define NVM_SECBB1R3_SEC77_B_0X1                (0x1u<<13)
#define NVM_SECBB1R3_SEC76_B_0X0                (0x0u<<12)
#define NVM_SECBB1R3_SEC76_B_0X1                (0x1u<<12)
#define NVM_SECBB1R3_SEC75_B_0X0                (0x0u<<11)
#define NVM_SECBB1R3_SEC75_B_0X1                (0x1u<<11)
#define NVM_SECBB1R3_SEC74_B_0X0                (0x0u<<10)
#define NVM_SECBB1R3_SEC74_B_0X1                (0x1u<<10)
#define NVM_SECBB1R3_SEC73_B_0X0                (0x0u<<9)
#define NVM_SECBB1R3_SEC73_B_0X1                (0x1u<<9)
#define NVM_SECBB1R3_SEC72_B_0X0                (0x0u<<8)
#define NVM_SECBB1R3_SEC72_B_0X1                (0x1u<<8)
#define NVM_SECBB1R3_SEC71_B_0X0                (0x0u<<7)
#define NVM_SECBB1R3_SEC71_B_0X1                (0x1u<<7)
#define NVM_SECBB1R3_SEC70_B_0X0                (0x0u<<6)
#define NVM_SECBB1R3_SEC70_B_0X1                (0x1u<<6)
#define NVM_SECBB1R3_SEC69_B_0X0                (0x0u<<5)
#define NVM_SECBB1R3_SEC69_B_0X1                (0x1u<<5)
#define NVM_SECBB1R3_SEC68_B_0X0                (0x0u<<4)
#define NVM_SECBB1R3_SEC68_B_0X1                (0x1u<<4)
#define NVM_SECBB1R3_SEC67_B_0X0                (0x0u<<3)
#define NVM_SECBB1R3_SEC67_B_0X1                (0x1u<<3)
#define NVM_SECBB1R3_SEC66_B_0X0                (0x0u<<2)
#define NVM_SECBB1R3_SEC66_B_0X1                (0x1u<<2)
#define NVM_SECBB1R3_SEC65_B_0X0                (0x0u<<1)
#define NVM_SECBB1R3_SEC65_B_0X1                (0x1u<<1)
#define NVM_SECBB1R3_SEC64_B_0X0                (0x0u<<0)
#define NVM_SECBB1R3_SEC64_B_0X1                (0x1u<<0)

// SECBB1R4 Configuration

#define NVM_SECBB1R4_SEC127                     (0x1u<<31)
#define NVM_SECBB1R4_SEC126                     (0x1u<<30)
#define NVM_SECBB1R4_SEC125                     (0x1u<<29)
#define NVM_SECBB1R4_SEC124                     (0x1u<<28)
#define NVM_SECBB1R4_SEC123                     (0x1u<<27)
#define NVM_SECBB1R4_SEC122                     (0x1u<<26)
#define NVM_SECBB1R4_SEC121                     (0x1u<<25)
#define NVM_SECBB1R4_SEC120                     (0x1u<<24)
#define NVM_SECBB1R4_SEC119                     (0x1u<<23)
#define NVM_SECBB1R4_SEC118                     (0x1u<<22)
#define NVM_SECBB1R4_SEC117                     (0x1u<<21)
#define NVM_SECBB1R4_SEC116                     (0x1u<<20)
#define NVM_SECBB1R4_SEC115                     (0x1u<<19)
#define NVM_SECBB1R4_SEC114                     (0x1u<<18)
#define NVM_SECBB1R4_SEC113                     (0x1u<<17)
#define NVM_SECBB1R4_SEC112                     (0x1u<<16)
#define NVM_SECBB1R4_SEC111                     (0x1u<<15)
#define NVM_SECBB1R4_SEC110                     (0x1u<<14)
#define NVM_SECBB1R4_SEC109                     (0x1u<<13)
#define NVM_SECBB1R4_SEC108                     (0x1u<<12)
#define NVM_SECBB1R4_SEC107                     (0x1u<<11)
#define NVM_SECBB1R4_SEC106                     (0x1u<<10)
#define NVM_SECBB1R4_SEC105                     (0x1u<<9)
#define NVM_SECBB1R4_SEC104                     (0x1u<<8)
#define NVM_SECBB1R4_SEC103                     (0x1u<<7)
#define NVM_SECBB1R4_SEC102                     (0x1u<<6)
#define NVM_SECBB1R4_SEC101                     (0x1u<<5)
#define NVM_SECBB1R4_SEC100                     (0x1u<<4)
#define NVM_SECBB1R4_SEC99                      (0x1u<<3)
#define NVM_SECBB1R4_SEC98                      (0x1u<<2)
#define NVM_SECBB1R4_SEC97                      (0x1u<<1)
#define NVM_SECBB1R4_SEC96                      (0x1u<<0)

#define NVM_SECBB1R4_SEC127_B_0X0               (0x0u<<31)
#define NVM_SECBB1R4_SEC127_B_0X1               (0x1u<<31)
#define NVM_SECBB1R4_SEC126_B_0X0               (0x0u<<30)
#define NVM_SECBB1R4_SEC126_B_0X1               (0x1u<<30)
#define NVM_SECBB1R4_SEC125_B_0X0               (0x0u<<29)
#define NVM_SECBB1R4_SEC125_B_0X1               (0x1u<<29)
#define NVM_SECBB1R4_SEC124_B_0X0               (0x0u<<28)
#define NVM_SECBB1R4_SEC124_B_0X1               (0x1u<<28)
#define NVM_SECBB1R4_SEC123_B_0X0               (0x0u<<27)
#define NVM_SECBB1R4_SEC123_B_0X1               (0x1u<<27)
#define NVM_SECBB1R4_SEC122_B_0X0               (0x0u<<26)
#define NVM_SECBB1R4_SEC122_B_0X1               (0x1u<<26)
#define NVM_SECBB1R4_SEC121_B_0X0               (0x0u<<25)
#define NVM_SECBB1R4_SEC121_B_0X1               (0x1u<<25)
#define NVM_SECBB1R4_SEC120_B_0X0               (0x0u<<24)
#define NVM_SECBB1R4_SEC120_B_0X1               (0x1u<<24)
#define NVM_SECBB1R4_SEC119_B_0X0               (0x0u<<23)
#define NVM_SECBB1R4_SEC119_B_0X1               (0x1u<<23)
#define NVM_SECBB1R4_SEC118_B_0X0               (0x0u<<22)
#define NVM_SECBB1R4_SEC118_B_0X1               (0x1u<<22)
#define NVM_SECBB1R4_SEC117_B_0X0               (0x0u<<21)
#define NVM_SECBB1R4_SEC117_B_0X1               (0x1u<<21)
#define NVM_SECBB1R4_SEC116_B_0X0               (0x0u<<20)
#define NVM_SECBB1R4_SEC116_B_0X1               (0x1u<<20)
#define NVM_SECBB1R4_SEC115_B_0X0               (0x0u<<19)
#define NVM_SECBB1R4_SEC115_B_0X1               (0x1u<<19)
#define NVM_SECBB1R4_SEC114_B_0X0               (0x0u<<18)
#define NVM_SECBB1R4_SEC114_B_0X1               (0x1u<<18)
#define NVM_SECBB1R4_SEC113_B_0X0               (0x0u<<17)
#define NVM_SECBB1R4_SEC113_B_0X1               (0x1u<<17)
#define NVM_SECBB1R4_SEC112_B_0X0               (0x0u<<16)
#define NVM_SECBB1R4_SEC112_B_0X1               (0x1u<<16)
#define NVM_SECBB1R4_SEC111_B_0X0               (0x0u<<15)
#define NVM_SECBB1R4_SEC111_B_0X1               (0x1u<<15)
#define NVM_SECBB1R4_SEC110_B_0X0               (0x0u<<14)
#define NVM_SECBB1R4_SEC110_B_0X1               (0x1u<<14)
#define NVM_SECBB1R4_SEC109_B_0X0               (0x0u<<13)
#define NVM_SECBB1R4_SEC109_B_0X1               (0x1u<<13)
#define NVM_SECBB1R4_SEC108_B_0X0               (0x0u<<12)
#define NVM_SECBB1R4_SEC108_B_0X1               (0x1u<<12)
#define NVM_SECBB1R4_SEC107_B_0X0               (0x0u<<11)
#define NVM_SECBB1R4_SEC107_B_0X1               (0x1u<<11)
#define NVM_SECBB1R4_SEC106_B_0X0               (0x0u<<10)
#define NVM_SECBB1R4_SEC106_B_0X1               (0x1u<<10)
#define NVM_SECBB1R4_SEC105_B_0X0               (0x0u<<9)
#define NVM_SECBB1R4_SEC105_B_0X1               (0x1u<<9)
#define NVM_SECBB1R4_SEC104_B_0X0               (0x0u<<8)
#define NVM_SECBB1R4_SEC104_B_0X1               (0x1u<<8)
#define NVM_SECBB1R4_SEC103_B_0X0               (0x0u<<7)
#define NVM_SECBB1R4_SEC103_B_0X1               (0x1u<<7)
#define NVM_SECBB1R4_SEC102_B_0X0               (0x0u<<6)
#define NVM_SECBB1R4_SEC102_B_0X1               (0x1u<<6)
#define NVM_SECBB1R4_SEC101_B_0X0               (0x0u<<5)
#define NVM_SECBB1R4_SEC101_B_0X1               (0x1u<<5)
#define NVM_SECBB1R4_SEC100_B_0X0               (0x0u<<4)
#define NVM_SECBB1R4_SEC100_B_0X1               (0x1u<<4)
#define NVM_SECBB1R4_SEC99_B_0X0                (0x0u<<3)
#define NVM_SECBB1R4_SEC99_B_0X1                (0x1u<<3)
#define NVM_SECBB1R4_SEC98_B_0X0                (0x0u<<2)
#define NVM_SECBB1R4_SEC98_B_0X1                (0x1u<<2)
#define NVM_SECBB1R4_SEC97_B_0X0                (0x0u<<1)
#define NVM_SECBB1R4_SEC97_B_0X1                (0x1u<<1)
#define NVM_SECBB1R4_SEC96_B_0X0                (0x0u<<0)
#define NVM_SECBB1R4_SEC96_B_0X1                (0x1u<<0)

// SECBB1R5 Configuration

#define NVM_SECBB1R5_SEC159                     (0x1u<<31)
#define NVM_SECBB1R5_SEC158                     (0x1u<<30)
#define NVM_SECBB1R5_SEC157                     (0x1u<<29)
#define NVM_SECBB1R5_SEC156                     (0x1u<<28)
#define NVM_SECBB1R5_SEC155                     (0x1u<<27)
#define NVM_SECBB1R5_SEC154                     (0x1u<<26)
#define NVM_SECBB1R5_SEC153                     (0x1u<<25)
#define NVM_SECBB1R5_SEC152                     (0x1u<<24)
#define NVM_SECBB1R5_SEC151                     (0x1u<<23)
#define NVM_SECBB1R5_SEC150                     (0x1u<<22)
#define NVM_SECBB1R5_SEC149                     (0x1u<<21)
#define NVM_SECBB1R5_SEC148                     (0x1u<<20)
#define NVM_SECBB1R5_SEC147                     (0x1u<<19)
#define NVM_SECBB1R5_SEC146                     (0x1u<<18)
#define NVM_SECBB1R5_SEC145                     (0x1u<<17)
#define NVM_SECBB1R5_SEC144                     (0x1u<<16)
#define NVM_SECBB1R5_SEC143                     (0x1u<<15)
#define NVM_SECBB1R5_SEC142                     (0x1u<<14)
#define NVM_SECBB1R5_SEC141                     (0x1u<<13)
#define NVM_SECBB1R5_SEC140                     (0x1u<<12)
#define NVM_SECBB1R5_SEC139                     (0x1u<<11)
#define NVM_SECBB1R5_SEC138                     (0x1u<<10)
#define NVM_SECBB1R5_SEC137                     (0x1u<<9)
#define NVM_SECBB1R5_SEC136                     (0x1u<<8)
#define NVM_SECBB1R5_SEC135                     (0x1u<<7)
#define NVM_SECBB1R5_SEC134                     (0x1u<<6)
#define NVM_SECBB1R5_SEC133                     (0x1u<<5)
#define NVM_SECBB1R5_SEC132                     (0x1u<<4)
#define NVM_SECBB1R5_SEC131                     (0x1u<<3)
#define NVM_SECBB1R5_SEC130                     (0x1u<<2)
#define NVM_SECBB1R5_SEC129                     (0x1u<<1)
#define NVM_SECBB1R5_SEC128                     (0x1u<<0)

#define NVM_SECBB1R5_SEC159_B_0X0               (0x0u<<31)
#define NVM_SECBB1R5_SEC159_B_0X1               (0x1u<<31)
#define NVM_SECBB1R5_SEC158_B_0X0               (0x0u<<30)
#define NVM_SECBB1R5_SEC158_B_0X1               (0x1u<<30)
#define NVM_SECBB1R5_SEC157_B_0X0               (0x0u<<29)
#define NVM_SECBB1R5_SEC157_B_0X1               (0x1u<<29)
#define NVM_SECBB1R5_SEC156_B_0X0               (0x0u<<28)
#define NVM_SECBB1R5_SEC156_B_0X1               (0x1u<<28)
#define NVM_SECBB1R5_SEC155_B_0X0               (0x0u<<27)
#define NVM_SECBB1R5_SEC155_B_0X1               (0x1u<<27)
#define NVM_SECBB1R5_SEC154_B_0X0               (0x0u<<26)
#define NVM_SECBB1R5_SEC154_B_0X1               (0x1u<<26)
#define NVM_SECBB1R5_SEC153_B_0X0               (0x0u<<25)
#define NVM_SECBB1R5_SEC153_B_0X1               (0x1u<<25)
#define NVM_SECBB1R5_SEC152_B_0X0               (0x0u<<24)
#define NVM_SECBB1R5_SEC152_B_0X1               (0x1u<<24)
#define NVM_SECBB1R5_SEC151_B_0X0               (0x0u<<23)
#define NVM_SECBB1R5_SEC151_B_0X1               (0x1u<<23)
#define NVM_SECBB1R5_SEC150_B_0X0               (0x0u<<22)
#define NVM_SECBB1R5_SEC150_B_0X1               (0x1u<<22)
#define NVM_SECBB1R5_SEC149_B_0X0               (0x0u<<21)
#define NVM_SECBB1R5_SEC149_B_0X1               (0x1u<<21)
#define NVM_SECBB1R5_SEC148_B_0X0               (0x0u<<20)
#define NVM_SECBB1R5_SEC148_B_0X1               (0x1u<<20)
#define NVM_SECBB1R5_SEC147_B_0X0               (0x0u<<19)
#define NVM_SECBB1R5_SEC147_B_0X1               (0x1u<<19)
#define NVM_SECBB1R5_SEC146_B_0X0               (0x0u<<18)
#define NVM_SECBB1R5_SEC146_B_0X1               (0x1u<<18)
#define NVM_SECBB1R5_SEC145_B_0X0               (0x0u<<17)
#define NVM_SECBB1R5_SEC145_B_0X1               (0x1u<<17)
#define NVM_SECBB1R5_SEC144_B_0X0               (0x0u<<16)
#define NVM_SECBB1R5_SEC144_B_0X1               (0x1u<<16)
#define NVM_SECBB1R5_SEC143_B_0X0               (0x0u<<15)
#define NVM_SECBB1R5_SEC143_B_0X1               (0x1u<<15)
#define NVM_SECBB1R5_SEC142_B_0X0               (0x0u<<14)
#define NVM_SECBB1R5_SEC142_B_0X1               (0x1u<<14)
#define NVM_SECBB1R5_SEC141_B_0X0               (0x0u<<13)
#define NVM_SECBB1R5_SEC141_B_0X1               (0x1u<<13)
#define NVM_SECBB1R5_SEC140_B_0X0               (0x0u<<12)
#define NVM_SECBB1R5_SEC140_B_0X1               (0x1u<<12)
#define NVM_SECBB1R5_SEC139_B_0X0               (0x0u<<11)
#define NVM_SECBB1R5_SEC139_B_0X1               (0x1u<<11)
#define NVM_SECBB1R5_SEC138_B_0X0               (0x0u<<10)
#define NVM_SECBB1R5_SEC138_B_0X1               (0x1u<<10)
#define NVM_SECBB1R5_SEC137_B_0X0               (0x0u<<9)
#define NVM_SECBB1R5_SEC137_B_0X1               (0x1u<<9)
#define NVM_SECBB1R5_SEC136_B_0X0               (0x0u<<8)
#define NVM_SECBB1R5_SEC136_B_0X1               (0x1u<<8)
#define NVM_SECBB1R5_SEC135_B_0X0               (0x0u<<7)
#define NVM_SECBB1R5_SEC135_B_0X1               (0x1u<<7)
#define NVM_SECBB1R5_SEC134_B_0X0               (0x0u<<6)
#define NVM_SECBB1R5_SEC134_B_0X1               (0x1u<<6)
#define NVM_SECBB1R5_SEC133_B_0X0               (0x0u<<5)
#define NVM_SECBB1R5_SEC133_B_0X1               (0x1u<<5)
#define NVM_SECBB1R5_SEC132_B_0X0               (0x0u<<4)
#define NVM_SECBB1R5_SEC132_B_0X1               (0x1u<<4)
#define NVM_SECBB1R5_SEC131_B_0X0               (0x0u<<3)
#define NVM_SECBB1R5_SEC131_B_0X1               (0x1u<<3)
#define NVM_SECBB1R5_SEC130_B_0X0               (0x0u<<2)
#define NVM_SECBB1R5_SEC130_B_0X1               (0x1u<<2)
#define NVM_SECBB1R5_SEC129_B_0X0               (0x0u<<1)
#define NVM_SECBB1R5_SEC129_B_0X1               (0x1u<<1)
#define NVM_SECBB1R5_SEC128_B_0X0               (0x0u<<0)
#define NVM_SECBB1R5_SEC128_B_0X1               (0x1u<<0)

// SECBB1R6 Configuration

