Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_nvm.h
#define NVM_SECBB1R6_SEC191                     (0x1u<<31)
#define NVM_SECBB1R6_SEC190                     (0x1u<<30)
#define NVM_SECBB1R6_SEC189                     (0x1u<<29)
#define NVM_SECBB1R6_SEC188                     (0x1u<<28)
#define NVM_SECBB1R6_SEC187                     (0x1u<<27)
#define NVM_SECBB1R6_SEC186                     (0x1u<<26)
#define NVM_SECBB1R6_SEC185                     (0x1u<<25)
#define NVM_SECBB1R6_SEC184                     (0x1u<<24)
#define NVM_SECBB1R6_SEC183                     (0x1u<<23)
#define NVM_SECBB1R6_SEC182                     (0x1u<<22)
#define NVM_SECBB1R6_SEC181                     (0x1u<<21)
#define NVM_SECBB1R6_SEC180                     (0x1u<<20)
#define NVM_SECBB1R6_SEC179                     (0x1u<<19)
#define NVM_SECBB1R6_SEC178                     (0x1u<<18)
#define NVM_SECBB1R6_SEC177                     (0x1u<<17)
#define NVM_SECBB1R6_SEC176                     (0x1u<<16)
#define NVM_SECBB1R6_SEC175                     (0x1u<<15)
#define NVM_SECBB1R6_SEC174                     (0x1u<<14)
#define NVM_SECBB1R6_SEC173                     (0x1u<<13)
#define NVM_SECBB1R6_SEC172                     (0x1u<<12)
#define NVM_SECBB1R6_SEC171                     (0x1u<<11)
#define NVM_SECBB1R6_SEC170                     (0x1u<<10)
#define NVM_SECBB1R6_SEC169                     (0x1u<<9)
#define NVM_SECBB1R6_SEC168                     (0x1u<<8)
#define NVM_SECBB1R6_SEC167                     (0x1u<<7)
#define NVM_SECBB1R6_SEC166                     (0x1u<<6)
#define NVM_SECBB1R6_SEC165                     (0x1u<<5)
#define NVM_SECBB1R6_SEC164                     (0x1u<<4)
#define NVM_SECBB1R6_SEC163                     (0x1u<<3)
#define NVM_SECBB1R6_SEC162                     (0x1u<<2)
#define NVM_SECBB1R6_SEC161                     (0x1u<<1)
#define NVM_SECBB1R6_SEC160                     (0x1u<<0)

#define NVM_SECBB1R6_SEC191_B_0X0               (0x0u<<31)
#define NVM_SECBB1R6_SEC191_B_0X1               (0x1u<<31)
#define NVM_SECBB1R6_SEC190_B_0X0               (0x0u<<30)
#define NVM_SECBB1R6_SEC190_B_0X1               (0x1u<<30)
#define NVM_SECBB1R6_SEC189_B_0X0               (0x0u<<29)
#define NVM_SECBB1R6_SEC189_B_0X1               (0x1u<<29)
#define NVM_SECBB1R6_SEC188_B_0X0               (0x0u<<28)
#define NVM_SECBB1R6_SEC188_B_0X1               (0x1u<<28)
#define NVM_SECBB1R6_SEC187_B_0X0               (0x0u<<27)
#define NVM_SECBB1R6_SEC187_B_0X1               (0x1u<<27)
#define NVM_SECBB1R6_SEC186_B_0X0               (0x0u<<26)
#define NVM_SECBB1R6_SEC186_B_0X1               (0x1u<<26)
#define NVM_SECBB1R6_SEC185_B_0X0               (0x0u<<25)
#define NVM_SECBB1R6_SEC185_B_0X1               (0x1u<<25)
#define NVM_SECBB1R6_SEC184_B_0X0               (0x0u<<24)
#define NVM_SECBB1R6_SEC184_B_0X1               (0x1u<<24)
#define NVM_SECBB1R6_SEC183_B_0X0               (0x0u<<23)
#define NVM_SECBB1R6_SEC183_B_0X1               (0x1u<<23)
#define NVM_SECBB1R6_SEC182_B_0X0               (0x0u<<22)
#define NVM_SECBB1R6_SEC182_B_0X1               (0x1u<<22)
#define NVM_SECBB1R6_SEC181_B_0X0               (0x0u<<21)
#define NVM_SECBB1R6_SEC181_B_0X1               (0x1u<<21)
#define NVM_SECBB1R6_SEC180_B_0X0               (0x0u<<20)
#define NVM_SECBB1R6_SEC180_B_0X1               (0x1u<<20)
#define NVM_SECBB1R6_SEC179_B_0X0               (0x0u<<19)
#define NVM_SECBB1R6_SEC179_B_0X1               (0x1u<<19)
#define NVM_SECBB1R6_SEC178_B_0X0               (0x0u<<18)
#define NVM_SECBB1R6_SEC178_B_0X1               (0x1u<<18)
#define NVM_SECBB1R6_SEC177_B_0X0               (0x0u<<17)
#define NVM_SECBB1R6_SEC177_B_0X1               (0x1u<<17)
#define NVM_SECBB1R6_SEC176_B_0X0               (0x0u<<16)
#define NVM_SECBB1R6_SEC176_B_0X1               (0x1u<<16)
#define NVM_SECBB1R6_SEC175_B_0X0               (0x0u<<15)
#define NVM_SECBB1R6_SEC175_B_0X1               (0x1u<<15)
#define NVM_SECBB1R6_SEC174_B_0X0               (0x0u<<14)
#define NVM_SECBB1R6_SEC174_B_0X1               (0x1u<<14)
#define NVM_SECBB1R6_SEC173_B_0X0               (0x0u<<13)
#define NVM_SECBB1R6_SEC173_B_0X1               (0x1u<<13)
#define NVM_SECBB1R6_SEC172_B_0X0               (0x0u<<12)
#define NVM_SECBB1R6_SEC172_B_0X1               (0x1u<<12)
#define NVM_SECBB1R6_SEC171_B_0X0               (0x0u<<11)
#define NVM_SECBB1R6_SEC171_B_0X1               (0x1u<<11)
#define NVM_SECBB1R6_SEC170_B_0X0               (0x0u<<10)
#define NVM_SECBB1R6_SEC170_B_0X1               (0x1u<<10)
#define NVM_SECBB1R6_SEC169_B_0X0               (0x0u<<9)
#define NVM_SECBB1R6_SEC169_B_0X1               (0x1u<<9)
#define NVM_SECBB1R6_SEC168_B_0X0               (0x0u<<8)
#define NVM_SECBB1R6_SEC168_B_0X1               (0x1u<<8)
#define NVM_SECBB1R6_SEC167_B_0X0               (0x0u<<7)
#define NVM_SECBB1R6_SEC167_B_0X1               (0x1u<<7)
#define NVM_SECBB1R6_SEC166_B_0X0               (0x0u<<6)
#define NVM_SECBB1R6_SEC166_B_0X1               (0x1u<<6)
#define NVM_SECBB1R6_SEC165_B_0X0               (0x0u<<5)
#define NVM_SECBB1R6_SEC165_B_0X1               (0x1u<<5)
#define NVM_SECBB1R6_SEC164_B_0X0               (0x0u<<4)
#define NVM_SECBB1R6_SEC164_B_0X1               (0x1u<<4)
#define NVM_SECBB1R6_SEC163_B_0X0               (0x0u<<3)
#define NVM_SECBB1R6_SEC163_B_0X1               (0x1u<<3)
#define NVM_SECBB1R6_SEC162_B_0X0               (0x0u<<2)
#define NVM_SECBB1R6_SEC162_B_0X1               (0x1u<<2)
#define NVM_SECBB1R6_SEC161_B_0X0               (0x0u<<1)
#define NVM_SECBB1R6_SEC161_B_0X1               (0x1u<<1)
#define NVM_SECBB1R6_SEC160_B_0X0               (0x0u<<0)
#define NVM_SECBB1R6_SEC160_B_0X1               (0x1u<<0)

// SECBB1R7 Configuration

#define NVM_SECBB1R7_SEC223                     (0x1u<<31)
#define NVM_SECBB1R7_SEC222                     (0x1u<<30)
#define NVM_SECBB1R7_SEC221                     (0x1u<<29)
#define NVM_SECBB1R7_SEC220                     (0x1u<<28)
#define NVM_SECBB1R7_SEC219                     (0x1u<<27)
#define NVM_SECBB1R7_SEC218                     (0x1u<<26)
#define NVM_SECBB1R7_SEC217                     (0x1u<<25)
#define NVM_SECBB1R7_SEC216                     (0x1u<<24)
#define NVM_SECBB1R7_SEC215                     (0x1u<<23)
#define NVM_SECBB1R7_SEC214                     (0x1u<<22)
#define NVM_SECBB1R7_SEC213                     (0x1u<<21)
#define NVM_SECBB1R7_SEC212                     (0x1u<<20)
#define NVM_SECBB1R7_SEC211                     (0x1u<<19)
#define NVM_SECBB1R7_SEC210                     (0x1u<<18)
#define NVM_SECBB1R7_SEC209                     (0x1u<<17)
#define NVM_SECBB1R7_SEC208                     (0x1u<<16)
#define NVM_SECBB1R7_SEC207                     (0x1u<<15)
#define NVM_SECBB1R7_SEC206                     (0x1u<<14)
#define NVM_SECBB1R7_SEC205                     (0x1u<<13)
#define NVM_SECBB1R7_SEC204                     (0x1u<<12)
#define NVM_SECBB1R7_SEC203                     (0x1u<<11)
#define NVM_SECBB1R7_SEC202                     (0x1u<<10)
#define NVM_SECBB1R7_SEC201                     (0x1u<<9)
#define NVM_SECBB1R7_SEC200                     (0x1u<<8)
#define NVM_SECBB1R7_SEC199                     (0x1u<<7)
#define NVM_SECBB1R7_SEC198                     (0x1u<<6)
#define NVM_SECBB1R7_SEC197                     (0x1u<<5)
#define NVM_SECBB1R7_SEC196                     (0x1u<<4)
#define NVM_SECBB1R7_SEC195                     (0x1u<<3)
#define NVM_SECBB1R7_SEC194                     (0x1u<<2)
#define NVM_SECBB1R7_SEC193                     (0x1u<<1)
#define NVM_SECBB1R7_SEC192                     (0x1u<<0)

#define NVM_SECBB1R7_SEC223_B_0X0               (0x0u<<31)
#define NVM_SECBB1R7_SEC223_B_0X1               (0x1u<<31)
#define NVM_SECBB1R7_SEC222_B_0X0               (0x0u<<30)
#define NVM_SECBB1R7_SEC222_B_0X1               (0x1u<<30)
#define NVM_SECBB1R7_SEC221_B_0X0               (0x0u<<29)
#define NVM_SECBB1R7_SEC221_B_0X1               (0x1u<<29)
#define NVM_SECBB1R7_SEC220_B_0X0               (0x0u<<28)
#define NVM_SECBB1R7_SEC220_B_0X1               (0x1u<<28)
#define NVM_SECBB1R7_SEC219_B_0X0               (0x0u<<27)
#define NVM_SECBB1R7_SEC219_B_0X1               (0x1u<<27)
#define NVM_SECBB1R7_SEC218_B_0X0               (0x0u<<26)
#define NVM_SECBB1R7_SEC218_B_0X1               (0x1u<<26)
#define NVM_SECBB1R7_SEC217_B_0X0               (0x0u<<25)
#define NVM_SECBB1R7_SEC217_B_0X1               (0x1u<<25)
#define NVM_SECBB1R7_SEC216_B_0X0               (0x0u<<24)
#define NVM_SECBB1R7_SEC216_B_0X1               (0x1u<<24)
#define NVM_SECBB1R7_SEC215_B_0X0               (0x0u<<23)
#define NVM_SECBB1R7_SEC215_B_0X1               (0x1u<<23)
#define NVM_SECBB1R7_SEC214_B_0X0               (0x0u<<22)
#define NVM_SECBB1R7_SEC214_B_0X1               (0x1u<<22)
#define NVM_SECBB1R7_SEC213_B_0X0               (0x0u<<21)
#define NVM_SECBB1R7_SEC213_B_0X1               (0x1u<<21)
#define NVM_SECBB1R7_SEC212_B_0X0               (0x0u<<20)
#define NVM_SECBB1R7_SEC212_B_0X1               (0x1u<<20)
#define NVM_SECBB1R7_SEC211_B_0X0               (0x0u<<19)
#define NVM_SECBB1R7_SEC211_B_0X1               (0x1u<<19)
#define NVM_SECBB1R7_SEC210_B_0X0               (0x0u<<18)
#define NVM_SECBB1R7_SEC210_B_0X1               (0x1u<<18)
#define NVM_SECBB1R7_SEC209_B_0X0               (0x0u<<17)
#define NVM_SECBB1R7_SEC209_B_0X1               (0x1u<<17)
#define NVM_SECBB1R7_SEC208_B_0X0               (0x0u<<16)
#define NVM_SECBB1R7_SEC208_B_0X1               (0x1u<<16)
#define NVM_SECBB1R7_SEC207_B_0X0               (0x0u<<15)
#define NVM_SECBB1R7_SEC207_B_0X1               (0x1u<<15)
#define NVM_SECBB1R7_SEC206_B_0X0               (0x0u<<14)
#define NVM_SECBB1R7_SEC206_B_0X1               (0x1u<<14)
#define NVM_SECBB1R7_SEC205_B_0X0               (0x0u<<13)
#define NVM_SECBB1R7_SEC205_B_0X1               (0x1u<<13)
#define NVM_SECBB1R7_SEC204_B_0X0               (0x0u<<12)
#define NVM_SECBB1R7_SEC204_B_0X1               (0x1u<<12)
#define NVM_SECBB1R7_SEC203_B_0X0               (0x0u<<11)
#define NVM_SECBB1R7_SEC203_B_0X1               (0x1u<<11)
#define NVM_SECBB1R7_SEC202_B_0X0               (0x0u<<10)
#define NVM_SECBB1R7_SEC202_B_0X1               (0x1u<<10)
#define NVM_SECBB1R7_SEC201_B_0X0               (0x0u<<9)
#define NVM_SECBB1R7_SEC201_B_0X1               (0x1u<<9)
#define NVM_SECBB1R7_SEC200_B_0X0               (0x0u<<8)
#define NVM_SECBB1R7_SEC200_B_0X1               (0x1u<<8)
#define NVM_SECBB1R7_SEC199_B_0X0               (0x0u<<7)
#define NVM_SECBB1R7_SEC199_B_0X1               (0x1u<<7)
#define NVM_SECBB1R7_SEC198_B_0X0               (0x0u<<6)
#define NVM_SECBB1R7_SEC198_B_0X1               (0x1u<<6)
#define NVM_SECBB1R7_SEC197_B_0X0               (0x0u<<5)
#define NVM_SECBB1R7_SEC197_B_0X1               (0x1u<<5)
#define NVM_SECBB1R7_SEC196_B_0X0               (0x0u<<4)
#define NVM_SECBB1R7_SEC196_B_0X1               (0x1u<<4)
#define NVM_SECBB1R7_SEC195_B_0X0               (0x0u<<3)
#define NVM_SECBB1R7_SEC195_B_0X1               (0x1u<<3)
#define NVM_SECBB1R7_SEC194_B_0X0               (0x0u<<2)
#define NVM_SECBB1R7_SEC194_B_0X1               (0x1u<<2)
#define NVM_SECBB1R7_SEC193_B_0X0               (0x0u<<1)
#define NVM_SECBB1R7_SEC193_B_0X1               (0x1u<<1)
#define NVM_SECBB1R7_SEC192_B_0X0               (0x0u<<0)
#define NVM_SECBB1R7_SEC192_B_0X1               (0x1u<<0)

// SECBB1R8 Configuration

#define NVM_SECBB1R8_SEC255                     (0x1u<<31)
#define NVM_SECBB1R8_SEC254                     (0x1u<<30)
#define NVM_SECBB1R8_SEC253                     (0x1u<<29)
#define NVM_SECBB1R8_SEC252                     (0x1u<<28)
#define NVM_SECBB1R8_SEC251                     (0x1u<<27)
#define NVM_SECBB1R8_SEC250                     (0x1u<<26)
#define NVM_SECBB1R8_SEC249                     (0x1u<<25)
#define NVM_SECBB1R8_SEC248                     (0x1u<<24)
#define NVM_SECBB1R8_SEC247                     (0x1u<<23)
#define NVM_SECBB1R8_SEC246                     (0x1u<<22)
#define NVM_SECBB1R8_SEC245                     (0x1u<<21)
#define NVM_SECBB1R8_SEC244                     (0x1u<<20)
#define NVM_SECBB1R8_SEC243                     (0x1u<<19)
#define NVM_SECBB1R8_SEC242                     (0x1u<<18)
#define NVM_SECBB1R8_SEC241                     (0x1u<<17)
#define NVM_SECBB1R8_SEC240                     (0x1u<<16)
#define NVM_SECBB1R8_SEC239                     (0x1u<<15)
#define NVM_SECBB1R8_SEC238                     (0x1u<<14)
#define NVM_SECBB1R8_SEC237                     (0x1u<<13)
#define NVM_SECBB1R8_SEC236                     (0x1u<<12)
#define NVM_SECBB1R8_SEC235                     (0x1u<<11)
#define NVM_SECBB1R8_SEC234                     (0x1u<<10)
#define NVM_SECBB1R8_SEC233                     (0x1u<<9)
#define NVM_SECBB1R8_SEC232                     (0x1u<<8)
#define NVM_SECBB1R8_SEC231                     (0x1u<<7)
#define NVM_SECBB1R8_SEC230                     (0x1u<<6)
#define NVM_SECBB1R8_SEC229                     (0x1u<<5)
#define NVM_SECBB1R8_SEC228                     (0x1u<<4)
#define NVM_SECBB1R8_SEC227                     (0x1u<<3)
#define NVM_SECBB1R8_SEC226                     (0x1u<<2)
#define NVM_SECBB1R8_SEC225                     (0x1u<<1)
#define NVM_SECBB1R8_SEC224                     (0x1u<<0)

#define NVM_SECBB1R8_SEC255_B_0X0               (0x0u<<31)
#define NVM_SECBB1R8_SEC255_B_0X1               (0x1u<<31)
#define NVM_SECBB1R8_SEC254_B_0X0               (0x0u<<30)
#define NVM_SECBB1R8_SEC254_B_0X1               (0x1u<<30)
#define NVM_SECBB1R8_SEC253_B_0X0               (0x0u<<29)
#define NVM_SECBB1R8_SEC253_B_0X1               (0x1u<<29)
#define NVM_SECBB1R8_SEC252_B_0X0               (0x0u<<28)
#define NVM_SECBB1R8_SEC252_B_0X1               (0x1u<<28)
#define NVM_SECBB1R8_SEC251_B_0X0               (0x0u<<27)
#define NVM_SECBB1R8_SEC251_B_0X1               (0x1u<<27)
#define NVM_SECBB1R8_SEC250_B_0X0               (0x0u<<26)
#define NVM_SECBB1R8_SEC250_B_0X1               (0x1u<<26)
#define NVM_SECBB1R8_SEC249_B_0X0               (0x0u<<25)
#define NVM_SECBB1R8_SEC249_B_0X1               (0x1u<<25)
#define NVM_SECBB1R8_SEC248_B_0X0               (0x0u<<24)
#define NVM_SECBB1R8_SEC248_B_0X1               (0x1u<<24)
#define NVM_SECBB1R8_SEC247_B_0X0               (0x0u<<23)
#define NVM_SECBB1R8_SEC247_B_0X1               (0x1u<<23)
#define NVM_SECBB1R8_SEC246_B_0X0               (0x0u<<22)
#define NVM_SECBB1R8_SEC246_B_0X1               (0x1u<<22)
#define NVM_SECBB1R8_SEC245_B_0X0               (0x0u<<21)
#define NVM_SECBB1R8_SEC245_B_0X1               (0x1u<<21)
#define NVM_SECBB1R8_SEC244_B_0X0               (0x0u<<20)
#define NVM_SECBB1R8_SEC244_B_0X1               (0x1u<<20)
#define NVM_SECBB1R8_SEC243_B_0X0               (0x0u<<19)
#define NVM_SECBB1R8_SEC243_B_0X1               (0x1u<<19)
#define NVM_SECBB1R8_SEC242_B_0X0               (0x0u<<18)
#define NVM_SECBB1R8_SEC242_B_0X1               (0x1u<<18)
#define NVM_SECBB1R8_SEC241_B_0X0               (0x0u<<17)
#define NVM_SECBB1R8_SEC241_B_0X1               (0x1u<<17)
#define NVM_SECBB1R8_SEC240_B_0X0               (0x0u<<16)
#define NVM_SECBB1R8_SEC240_B_0X1               (0x1u<<16)
#define NVM_SECBB1R8_SEC239_B_0X0               (0x0u<<15)
#define NVM_SECBB1R8_SEC239_B_0X1               (0x1u<<15)
#define NVM_SECBB1R8_SEC238_B_0X0               (0x0u<<14)
#define NVM_SECBB1R8_SEC238_B_0X1               (0x1u<<14)
#define NVM_SECBB1R8_SEC237_B_0X0               (0x0u<<13)
#define NVM_SECBB1R8_SEC237_B_0X1               (0x1u<<13)
#define NVM_SECBB1R8_SEC236_B_0X0               (0x0u<<12)
#define NVM_SECBB1R8_SEC236_B_0X1               (0x1u<<12)
#define NVM_SECBB1R8_SEC235_B_0X0               (0x0u<<11)
#define NVM_SECBB1R8_SEC235_B_0X1               (0x1u<<11)
#define NVM_SECBB1R8_SEC234_B_0X0               (0x0u<<10)
#define NVM_SECBB1R8_SEC234_B_0X1               (0x1u<<10)
#define NVM_SECBB1R8_SEC233_B_0X0               (0x0u<<9)
#define NVM_SECBB1R8_SEC233_B_0X1               (0x1u<<9)
#define NVM_SECBB1R8_SEC232_B_0X0               (0x0u<<8)
#define NVM_SECBB1R8_SEC232_B_0X1               (0x1u<<8)
#define NVM_SECBB1R8_SEC231_B_0X0               (0x0u<<7)
#define NVM_SECBB1R8_SEC231_B_0X1               (0x1u<<7)
#define NVM_SECBB1R8_SEC230_B_0X0               (0x0u<<6)
#define NVM_SECBB1R8_SEC230_B_0X1               (0x1u<<6)
#define NVM_SECBB1R8_SEC229_B_0X0               (0x0u<<5)
#define NVM_SECBB1R8_SEC229_B_0X1               (0x1u<<5)
#define NVM_SECBB1R8_SEC228_B_0X0               (0x0u<<4)
#define NVM_SECBB1R8_SEC228_B_0X1               (0x1u<<4)
#define NVM_SECBB1R8_SEC227_B_0X0               (0x0u<<3)
#define NVM_SECBB1R8_SEC227_B_0X1               (0x1u<<3)
#define NVM_SECBB1R8_SEC226_B_0X0               (0x0u<<2)
#define NVM_SECBB1R8_SEC226_B_0X1               (0x1u<<2)
#define NVM_SECBB1R8_SEC225_B_0X0               (0x0u<<1)
#define NVM_SECBB1R8_SEC225_B_0X1               (0x1u<<1)
#define NVM_SECBB1R8_SEC224_B_0X0               (0x0u<<0)
#define NVM_SECBB1R8_SEC224_B_0X1               (0x1u<<0)

// PRIVBB1R1 Configuration

#define NVM_PRIVBB1R1_PRIV31                    (0x1u<<31)
#define NVM_PRIVBB1R1_PRIV30                    (0x1u<<30)
#define NVM_PRIVBB1R1_PRIV29                    (0x1u<<29)
#define NVM_PRIVBB1R1_PRIV28                    (0x1u<<28)
#define NVM_PRIVBB1R1_PRIV27                    (0x1u<<27)
#define NVM_PRIVBB1R1_PRIV26                    (0x1u<<26)
#define NVM_PRIVBB1R1_PRIV25                    (0x1u<<25)
#define NVM_PRIVBB1R1_PRIV24                    (0x1u<<24)
#define NVM_PRIVBB1R1_PRIV23                    (0x1u<<23)
#define NVM_PRIVBB1R1_PRIV22                    (0x1u<<22)
#define NVM_PRIVBB1R1_PRIV21                    (0x1u<<21)
#define NVM_PRIVBB1R1_PRIV20                    (0x1u<<20)
#define NVM_PRIVBB1R1_PRIV19                    (0x1u<<19)
#define NVM_PRIVBB1R1_PRIV18                    (0x1u<<18)
#define NVM_PRIVBB1R1_PRIV17                    (0x1u<<17)
#define NVM_PRIVBB1R1_PRIV16                    (0x1u<<16)
#define NVM_PRIVBB1R1_PRIV15                    (0x1u<<15)
#define NVM_PRIVBB1R1_PRIV14                    (0x1u<<14)
#define NVM_PRIVBB1R1_PRIV13                    (0x1u<<13)
#define NVM_PRIVBB1R1_PRIV12                    (0x1u<<12)
#define NVM_PRIVBB1R1_PRIV11                    (0x1u<<11)
#define NVM_PRIVBB1R1_PRIV10                    (0x1u<<10)
#define NVM_PRIVBB1R1_PRIV9                     (0x1u<<9)
#define NVM_PRIVBB1R1_PRIV8                     (0x1u<<8)
#define NVM_PRIVBB1R1_PRIV7                     (0x1u<<7)
#define NVM_PRIVBB1R1_PRIV6                     (0x1u<<6)
#define NVM_PRIVBB1R1_PRIV5                     (0x1u<<5)
#define NVM_PRIVBB1R1_PRIV4                     (0x1u<<4)
#define NVM_PRIVBB1R1_PRIV3                     (0x1u<<3)
#define NVM_PRIVBB1R1_PRIV2                     (0x1u<<2)
#define NVM_PRIVBB1R1_PRIV1                     (0x1u<<1)
#define NVM_PRIVBB1R1_PRIV0                     (0x1u<<0)

#define NVM_PRIVBB1R1_PRIV31_B_0X0              (0x0u<<31)
#define NVM_PRIVBB1R1_PRIV31_B_0X1              (0x1u<<31)
#define NVM_PRIVBB1R1_PRIV30_B_0X0              (0x0u<<30)
#define NVM_PRIVBB1R1_PRIV30_B_0X1              (0x1u<<30)
#define NVM_PRIVBB1R1_PRIV29_B_0X0              (0x0u<<29)
#define NVM_PRIVBB1R1_PRIV29_B_0X1              (0x1u<<29)
#define NVM_PRIVBB1R1_PRIV28_B_0X0              (0x0u<<28)
#define NVM_PRIVBB1R1_PRIV28_B_0X1              (0x1u<<28)
#define NVM_PRIVBB1R1_PRIV27_B_0X0              (0x0u<<27)
#define NVM_PRIVBB1R1_PRIV27_B_0X1              (0x1u<<27)
#define NVM_PRIVBB1R1_PRIV26_B_0X0              (0x0u<<26)
#define NVM_PRIVBB1R1_PRIV26_B_0X1              (0x1u<<26)
#define NVM_PRIVBB1R1_PRIV25_B_0X0              (0x0u<<25)
#define NVM_PRIVBB1R1_PRIV25_B_0X1              (0x1u<<25)
#define NVM_PRIVBB1R1_PRIV24_B_0X0              (0x0u<<24)
#define NVM_PRIVBB1R1_PRIV24_B_0X1              (0x1u<<24)
#define NVM_PRIVBB1R1_PRIV23_B_0X0              (0x0u<<23)
#define NVM_PRIVBB1R1_PRIV23_B_0X1              (0x1u<<23)
#define NVM_PRIVBB1R1_PRIV22_B_0X0              (0x0u<<22)
#define NVM_PRIVBB1R1_PRIV22_B_0X1              (0x1u<<22)
#define NVM_PRIVBB1R1_PRIV21_B_0X0              (0x0u<<21)
#define NVM_PRIVBB1R1_PRIV21_B_0X1              (0x1u<<21)
#define NVM_PRIVBB1R1_PRIV20_B_0X0              (0x0u<<20)
#define NVM_PRIVBB1R1_PRIV20_B_0X1              (0x1u<<20)
#define NVM_PRIVBB1R1_PRIV19_B_0X0              (0x0u<<19)
#define NVM_PRIVBB1R1_PRIV19_B_0X1              (0x1u<<19)
#define NVM_PRIVBB1R1_PRIV18_B_0X0              (0x0u<<18)
#define NVM_PRIVBB1R1_PRIV18_B_0X1              (0x1u<<18)
#define NVM_PRIVBB1R1_PRIV17_B_0X0              (0x0u<<17)
#define NVM_PRIVBB1R1_PRIV17_B_0X1              (0x1u<<17)
#define NVM_PRIVBB1R1_PRIV16_B_0X0              (0x0u<<16)
#define NVM_PRIVBB1R1_PRIV16_B_0X1              (0x1u<<16)
#define NVM_PRIVBB1R1_PRIV15_B_0X0              (0x0u<<15)
#define NVM_PRIVBB1R1_PRIV15_B_0X1              (0x1u<<15)
#define NVM_PRIVBB1R1_PRIV14_B_0X0              (0x0u<<14)
#define NVM_PRIVBB1R1_PRIV14_B_0X1              (0x1u<<14)
#define NVM_PRIVBB1R1_PRIV13_B_0X0              (0x0u<<13)
#define NVM_PRIVBB1R1_PRIV13_B_0X1              (0x1u<<13)
#define NVM_PRIVBB1R1_PRIV12_B_0X0              (0x0u<<12)
#define NVM_PRIVBB1R1_PRIV12_B_0X1              (0x1u<<12)
#define NVM_PRIVBB1R1_PRIV11_B_0X0              (0x0u<<11)
#define NVM_PRIVBB1R1_PRIV11_B_0X1              (0x1u<<11)
#define NVM_PRIVBB1R1_PRIV10_B_0X0              (0x0u<<10)
#define NVM_PRIVBB1R1_PRIV10_B_0X1              (0x1u<<10)
#define NVM_PRIVBB1R1_PRIV9_B_0X0               (0x0u<<9)
#define NVM_PRIVBB1R1_PRIV9_B_0X1               (0x1u<<9)
#define NVM_PRIVBB1R1_PRIV8_B_0X0               (0x0u<<8)
#define NVM_PRIVBB1R1_PRIV8_B_0X1               (0x1u<<8)
#define NVM_PRIVBB1R1_PRIV7_B_0X0               (0x0u<<7)
#define NVM_PRIVBB1R1_PRIV7_B_0X1               (0x1u<<7)
#define NVM_PRIVBB1R1_PRIV6_B_0X0               (0x0u<<6)
#define NVM_PRIVBB1R1_PRIV6_B_0X1               (0x1u<<6)
#define NVM_PRIVBB1R1_PRIV5_B_0X0               (0x0u<<5)
#define NVM_PRIVBB1R1_PRIV5_B_0X1               (0x1u<<5)
#define NVM_PRIVBB1R1_PRIV4_B_0X0               (0x0u<<4)
#define NVM_PRIVBB1R1_PRIV4_B_0X1               (0x1u<<4)
#define NVM_PRIVBB1R1_PRIV3_B_0X0               (0x0u<<3)
#define NVM_PRIVBB1R1_PRIV3_B_0X1               (0x1u<<3)
#define NVM_PRIVBB1R1_PRIV2_B_0X0               (0x0u<<2)
#define NVM_PRIVBB1R1_PRIV2_B_0X1               (0x1u<<2)
#define NVM_PRIVBB1R1_PRIV1_B_0X0               (0x0u<<1)
#define NVM_PRIVBB1R1_PRIV1_B_0X1               (0x1u<<1)
#define NVM_PRIVBB1R1_PRIV0_B_0X0               (0x0u<<0)
#define NVM_PRIVBB1R1_PRIV0_B_0X1               (0x1u<<0)

