Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_nvm.h
#define NVM_PRIVBB1R4_PRIV127_B_0X0             (0x0u<<31)
#define NVM_PRIVBB1R4_PRIV127_B_0X1             (0x1u<<31)
#define NVM_PRIVBB1R4_PRIV126_B_0X0             (0x0u<<30)
#define NVM_PRIVBB1R4_PRIV126_B_0X1             (0x1u<<30)
#define NVM_PRIVBB1R4_PRIV125_B_0X0             (0x0u<<29)
#define NVM_PRIVBB1R4_PRIV125_B_0X1             (0x1u<<29)
#define NVM_PRIVBB1R4_PRIV124_B_0X0             (0x0u<<28)
#define NVM_PRIVBB1R4_PRIV124_B_0X1             (0x1u<<28)
#define NVM_PRIVBB1R4_PRIV123_B_0X0             (0x0u<<27)
#define NVM_PRIVBB1R4_PRIV123_B_0X1             (0x1u<<27)
#define NVM_PRIVBB1R4_PRIV122_B_0X0             (0x0u<<26)
#define NVM_PRIVBB1R4_PRIV122_B_0X1             (0x1u<<26)
#define NVM_PRIVBB1R4_PRIV121_B_0X0             (0x0u<<25)
#define NVM_PRIVBB1R4_PRIV121_B_0X1             (0x1u<<25)
#define NVM_PRIVBB1R4_PRIV120_B_0X0             (0x0u<<24)
#define NVM_PRIVBB1R4_PRIV120_B_0X1             (0x1u<<24)
#define NVM_PRIVBB1R4_PRIV119_B_0X0             (0x0u<<23)
#define NVM_PRIVBB1R4_PRIV119_B_0X1             (0x1u<<23)
#define NVM_PRIVBB1R4_PRIV118_B_0X0             (0x0u<<22)
#define NVM_PRIVBB1R4_PRIV118_B_0X1             (0x1u<<22)
#define NVM_PRIVBB1R4_PRIV117_B_0X0             (0x0u<<21)
#define NVM_PRIVBB1R4_PRIV117_B_0X1             (0x1u<<21)
#define NVM_PRIVBB1R4_PRIV116_B_0X0             (0x0u<<20)
#define NVM_PRIVBB1R4_PRIV116_B_0X1             (0x1u<<20)
#define NVM_PRIVBB1R4_PRIV115_B_0X0             (0x0u<<19)
#define NVM_PRIVBB1R4_PRIV115_B_0X1             (0x1u<<19)
#define NVM_PRIVBB1R4_PRIV114_B_0X0             (0x0u<<18)
#define NVM_PRIVBB1R4_PRIV114_B_0X1             (0x1u<<18)
#define NVM_PRIVBB1R4_PRIV113_B_0X0             (0x0u<<17)
#define NVM_PRIVBB1R4_PRIV113_B_0X1             (0x1u<<17)
#define NVM_PRIVBB1R4_PRIV112_B_0X0             (0x0u<<16)
#define NVM_PRIVBB1R4_PRIV112_B_0X1             (0x1u<<16)
#define NVM_PRIVBB1R4_PRIV111_B_0X0             (0x0u<<15)
#define NVM_PRIVBB1R4_PRIV111_B_0X1             (0x1u<<15)
#define NVM_PRIVBB1R4_PRIV110_B_0X0             (0x0u<<14)
#define NVM_PRIVBB1R4_PRIV110_B_0X1             (0x1u<<14)
#define NVM_PRIVBB1R4_PRIV109_B_0X0             (0x0u<<13)
#define NVM_PRIVBB1R4_PRIV109_B_0X1             (0x1u<<13)
#define NVM_PRIVBB1R4_PRIV108_B_0X0             (0x0u<<12)
#define NVM_PRIVBB1R4_PRIV108_B_0X1             (0x1u<<12)
#define NVM_PRIVBB1R4_PRIV107_B_0X0             (0x0u<<11)
#define NVM_PRIVBB1R4_PRIV107_B_0X1             (0x1u<<11)
#define NVM_PRIVBB1R4_PRIV106_B_0X0             (0x0u<<10)
#define NVM_PRIVBB1R4_PRIV106_B_0X1             (0x1u<<10)
#define NVM_PRIVBB1R4_PRIV105_B_0X0             (0x0u<<9)
#define NVM_PRIVBB1R4_PRIV105_B_0X1             (0x1u<<9)
#define NVM_PRIVBB1R4_PRIV104_B_0X0             (0x0u<<8)
#define NVM_PRIVBB1R4_PRIV104_B_0X1             (0x1u<<8)
#define NVM_PRIVBB1R4_PRIV103_B_0X0             (0x0u<<7)
#define NVM_PRIVBB1R4_PRIV103_B_0X1             (0x1u<<7)
#define NVM_PRIVBB1R4_PRIV102_B_0X0             (0x0u<<6)
#define NVM_PRIVBB1R4_PRIV102_B_0X1             (0x1u<<6)
#define NVM_PRIVBB1R4_PRIV101_B_0X0             (0x0u<<5)
#define NVM_PRIVBB1R4_PRIV101_B_0X1             (0x1u<<5)
#define NVM_PRIVBB1R4_PRIV100_B_0X0             (0x0u<<4)
#define NVM_PRIVBB1R4_PRIV100_B_0X1             (0x1u<<4)
#define NVM_PRIVBB1R4_PRIV99_B_0X0              (0x0u<<3)
#define NVM_PRIVBB1R4_PRIV99_B_0X1              (0x1u<<3)
#define NVM_PRIVBB1R4_PRIV98_B_0X0              (0x0u<<2)
#define NVM_PRIVBB1R4_PRIV98_B_0X1              (0x1u<<2)
#define NVM_PRIVBB1R4_PRIV97_B_0X0              (0x0u<<1)
#define NVM_PRIVBB1R4_PRIV97_B_0X1              (0x1u<<1)
#define NVM_PRIVBB1R4_PRIV96_B_0X0              (0x0u<<0)
#define NVM_PRIVBB1R4_PRIV96_B_0X1              (0x1u<<0)

// PRIVBB1R5 Configuration

#define NVM_PRIVBB1R5_PRIV159                   (0x1u<<31)
#define NVM_PRIVBB1R5_PRIV158                   (0x1u<<30)
#define NVM_PRIVBB1R5_PRIV157                   (0x1u<<29)
#define NVM_PRIVBB1R5_PRIV156                   (0x1u<<28)
#define NVM_PRIVBB1R5_PRIV155                   (0x1u<<27)
#define NVM_PRIVBB1R5_PRIV154                   (0x1u<<26)
#define NVM_PRIVBB1R5_PRIV153                   (0x1u<<25)
#define NVM_PRIVBB1R5_PRIV152                   (0x1u<<24)
#define NVM_PRIVBB1R5_PRIV151                   (0x1u<<23)
#define NVM_PRIVBB1R5_PRIV150                   (0x1u<<22)
#define NVM_PRIVBB1R5_PRIV149                   (0x1u<<21)
#define NVM_PRIVBB1R5_PRIV148                   (0x1u<<20)
#define NVM_PRIVBB1R5_PRIV147                   (0x1u<<19)
#define NVM_PRIVBB1R5_PRIV146                   (0x1u<<18)
#define NVM_PRIVBB1R5_PRIV145                   (0x1u<<17)
#define NVM_PRIVBB1R5_PRIV144                   (0x1u<<16)
#define NVM_PRIVBB1R5_PRIV143                   (0x1u<<15)
#define NVM_PRIVBB1R5_PRIV142                   (0x1u<<14)
#define NVM_PRIVBB1R5_PRIV141                   (0x1u<<13)
#define NVM_PRIVBB1R5_PRIV140                   (0x1u<<12)
#define NVM_PRIVBB1R5_PRIV139                   (0x1u<<11)
#define NVM_PRIVBB1R5_PRIV138                   (0x1u<<10)
#define NVM_PRIVBB1R5_PRIV137                   (0x1u<<9)
#define NVM_PRIVBB1R5_PRIV136                   (0x1u<<8)
#define NVM_PRIVBB1R5_PRIV135                   (0x1u<<7)
#define NVM_PRIVBB1R5_PRIV134                   (0x1u<<6)
#define NVM_PRIVBB1R5_PRIV133                   (0x1u<<5)
#define NVM_PRIVBB1R5_PRIV132                   (0x1u<<4)
#define NVM_PRIVBB1R5_PRIV131                   (0x1u<<3)
#define NVM_PRIVBB1R5_PRIV130                   (0x1u<<2)
#define NVM_PRIVBB1R5_PRIV129                   (0x1u<<1)
#define NVM_PRIVBB1R5_PRIV128                   (0x1u<<0)

#define NVM_PRIVBB1R5_PRIV159_B_0X0             (0x0u<<31)
#define NVM_PRIVBB1R5_PRIV159_B_0X1             (0x1u<<31)
#define NVM_PRIVBB1R5_PRIV158_B_0X0             (0x0u<<30)
#define NVM_PRIVBB1R5_PRIV158_B_0X1             (0x1u<<30)
#define NVM_PRIVBB1R5_PRIV157_B_0X0             (0x0u<<29)
#define NVM_PRIVBB1R5_PRIV157_B_0X1             (0x1u<<29)
#define NVM_PRIVBB1R5_PRIV156_B_0X0             (0x0u<<28)
#define NVM_PRIVBB1R5_PRIV156_B_0X1             (0x1u<<28)
#define NVM_PRIVBB1R5_PRIV155_B_0X0             (0x0u<<27)
#define NVM_PRIVBB1R5_PRIV155_B_0X1             (0x1u<<27)
#define NVM_PRIVBB1R5_PRIV154_B_0X0             (0x0u<<26)
#define NVM_PRIVBB1R5_PRIV154_B_0X1             (0x1u<<26)
#define NVM_PRIVBB1R5_PRIV153_B_0X0             (0x0u<<25)
#define NVM_PRIVBB1R5_PRIV153_B_0X1             (0x1u<<25)
#define NVM_PRIVBB1R5_PRIV152_B_0X0             (0x0u<<24)
#define NVM_PRIVBB1R5_PRIV152_B_0X1             (0x1u<<24)
#define NVM_PRIVBB1R5_PRIV151_B_0X0             (0x0u<<23)
#define NVM_PRIVBB1R5_PRIV151_B_0X1             (0x1u<<23)
#define NVM_PRIVBB1R5_PRIV150_B_0X0             (0x0u<<22)
#define NVM_PRIVBB1R5_PRIV150_B_0X1             (0x1u<<22)
#define NVM_PRIVBB1R5_PRIV149_B_0X0             (0x0u<<21)
#define NVM_PRIVBB1R5_PRIV149_B_0X1             (0x1u<<21)
#define NVM_PRIVBB1R5_PRIV148_B_0X0             (0x0u<<20)
#define NVM_PRIVBB1R5_PRIV148_B_0X1             (0x1u<<20)
#define NVM_PRIVBB1R5_PRIV147_B_0X0             (0x0u<<19)
#define NVM_PRIVBB1R5_PRIV147_B_0X1             (0x1u<<19)
#define NVM_PRIVBB1R5_PRIV146_B_0X0             (0x0u<<18)
#define NVM_PRIVBB1R5_PRIV146_B_0X1             (0x1u<<18)
#define NVM_PRIVBB1R5_PRIV145_B_0X0             (0x0u<<17)
#define NVM_PRIVBB1R5_PRIV145_B_0X1             (0x1u<<17)
#define NVM_PRIVBB1R5_PRIV144_B_0X0             (0x0u<<16)
#define NVM_PRIVBB1R5_PRIV144_B_0X1             (0x1u<<16)
#define NVM_PRIVBB1R5_PRIV143_B_0X0             (0x0u<<15)
#define NVM_PRIVBB1R5_PRIV143_B_0X1             (0x1u<<15)
#define NVM_PRIVBB1R5_PRIV142_B_0X0             (0x0u<<14)
#define NVM_PRIVBB1R5_PRIV142_B_0X1             (0x1u<<14)
#define NVM_PRIVBB1R5_PRIV141_B_0X0             (0x0u<<13)
#define NVM_PRIVBB1R5_PRIV141_B_0X1             (0x1u<<13)
#define NVM_PRIVBB1R5_PRIV140_B_0X0             (0x0u<<12)
#define NVM_PRIVBB1R5_PRIV140_B_0X1             (0x1u<<12)
#define NVM_PRIVBB1R5_PRIV139_B_0X0             (0x0u<<11)
#define NVM_PRIVBB1R5_PRIV139_B_0X1             (0x1u<<11)
#define NVM_PRIVBB1R5_PRIV138_B_0X0             (0x0u<<10)
#define NVM_PRIVBB1R5_PRIV138_B_0X1             (0x1u<<10)
#define NVM_PRIVBB1R5_PRIV137_B_0X0             (0x0u<<9)
#define NVM_PRIVBB1R5_PRIV137_B_0X1             (0x1u<<9)
#define NVM_PRIVBB1R5_PRIV136_B_0X0             (0x0u<<8)
#define NVM_PRIVBB1R5_PRIV136_B_0X1             (0x1u<<8)
#define NVM_PRIVBB1R5_PRIV135_B_0X0             (0x0u<<7)
#define NVM_PRIVBB1R5_PRIV135_B_0X1             (0x1u<<7)
#define NVM_PRIVBB1R5_PRIV134_B_0X0             (0x0u<<6)
#define NVM_PRIVBB1R5_PRIV134_B_0X1             (0x1u<<6)
#define NVM_PRIVBB1R5_PRIV133_B_0X0             (0x0u<<5)
#define NVM_PRIVBB1R5_PRIV133_B_0X1             (0x1u<<5)
#define NVM_PRIVBB1R5_PRIV132_B_0X0             (0x0u<<4)
#define NVM_PRIVBB1R5_PRIV132_B_0X1             (0x1u<<4)
#define NVM_PRIVBB1R5_PRIV131_B_0X0             (0x0u<<3)
#define NVM_PRIVBB1R5_PRIV131_B_0X1             (0x1u<<3)
#define NVM_PRIVBB1R5_PRIV130_B_0X0             (0x0u<<2)
#define NVM_PRIVBB1R5_PRIV130_B_0X1             (0x1u<<2)
#define NVM_PRIVBB1R5_PRIV129_B_0X0             (0x0u<<1)
#define NVM_PRIVBB1R5_PRIV129_B_0X1             (0x1u<<1)
#define NVM_PRIVBB1R5_PRIV128_B_0X0             (0x0u<<0)
#define NVM_PRIVBB1R5_PRIV128_B_0X1             (0x1u<<0)

// PRIVBB1R6 Configuration

#define NVM_PRIVBB1R6_PRIV191                   (0x1u<<31)
#define NVM_PRIVBB1R6_PRIV190                   (0x1u<<30)
#define NVM_PRIVBB1R6_PRIV189                   (0x1u<<29)
#define NVM_PRIVBB1R6_PRIV188                   (0x1u<<28)
#define NVM_PRIVBB1R6_PRIV187                   (0x1u<<27)
#define NVM_PRIVBB1R6_PRIV186                   (0x1u<<26)
#define NVM_PRIVBB1R6_PRIV185                   (0x1u<<25)
#define NVM_PRIVBB1R6_PRIV184                   (0x1u<<24)
#define NVM_PRIVBB1R6_PRIV183                   (0x1u<<23)
#define NVM_PRIVBB1R6_PRIV182                   (0x1u<<22)
#define NVM_PRIVBB1R6_PRIV181                   (0x1u<<21)
#define NVM_PRIVBB1R6_PRIV180                   (0x1u<<20)
#define NVM_PRIVBB1R6_PRIV179                   (0x1u<<19)
#define NVM_PRIVBB1R6_PRIV178                   (0x1u<<18)
#define NVM_PRIVBB1R6_PRIV177                   (0x1u<<17)
#define NVM_PRIVBB1R6_PRIV176                   (0x1u<<16)
#define NVM_PRIVBB1R6_PRIV175                   (0x1u<<15)
#define NVM_PRIVBB1R6_PRIV174                   (0x1u<<14)
#define NVM_PRIVBB1R6_PRIV173                   (0x1u<<13)
#define NVM_PRIVBB1R6_PRIV172                   (0x1u<<12)
#define NVM_PRIVBB1R6_PRIV171                   (0x1u<<11)
#define NVM_PRIVBB1R6_PRIV170                   (0x1u<<10)
#define NVM_PRIVBB1R6_PRIV169                   (0x1u<<9)
#define NVM_PRIVBB1R6_PRIV168                   (0x1u<<8)
#define NVM_PRIVBB1R6_PRIV167                   (0x1u<<7)
#define NVM_PRIVBB1R6_PRIV166                   (0x1u<<6)
#define NVM_PRIVBB1R6_PRIV165                   (0x1u<<5)
#define NVM_PRIVBB1R6_PRIV164                   (0x1u<<4)
#define NVM_PRIVBB1R6_PRIV163                   (0x1u<<3)
#define NVM_PRIVBB1R6_PRIV162                   (0x1u<<2)
#define NVM_PRIVBB1R6_PRIV161                   (0x1u<<1)
#define NVM_PRIVBB1R6_PRIV160                   (0x1u<<0)

#define NVM_PRIVBB1R6_PRIV191_B_0X0             (0x0u<<31)
#define NVM_PRIVBB1R6_PRIV191_B_0X1             (0x1u<<31)
#define NVM_PRIVBB1R6_PRIV190_B_0X0             (0x0u<<30)
#define NVM_PRIVBB1R6_PRIV190_B_0X1             (0x1u<<30)
#define NVM_PRIVBB1R6_PRIV189_B_0X0             (0x0u<<29)
#define NVM_PRIVBB1R6_PRIV189_B_0X1             (0x1u<<29)
#define NVM_PRIVBB1R6_PRIV188_B_0X0             (0x0u<<28)
#define NVM_PRIVBB1R6_PRIV188_B_0X1             (0x1u<<28)
#define NVM_PRIVBB1R6_PRIV187_B_0X0             (0x0u<<27)
#define NVM_PRIVBB1R6_PRIV187_B_0X1             (0x1u<<27)
#define NVM_PRIVBB1R6_PRIV186_B_0X0             (0x0u<<26)
#define NVM_PRIVBB1R6_PRIV186_B_0X1             (0x1u<<26)
#define NVM_PRIVBB1R6_PRIV185_B_0X0             (0x0u<<25)
#define NVM_PRIVBB1R6_PRIV185_B_0X1             (0x1u<<25)
#define NVM_PRIVBB1R6_PRIV184_B_0X0             (0x0u<<24)
#define NVM_PRIVBB1R6_PRIV184_B_0X1             (0x1u<<24)
#define NVM_PRIVBB1R6_PRIV183_B_0X0             (0x0u<<23)
#define NVM_PRIVBB1R6_PRIV183_B_0X1             (0x1u<<23)
#define NVM_PRIVBB1R6_PRIV182_B_0X0             (0x0u<<22)
#define NVM_PRIVBB1R6_PRIV182_B_0X1             (0x1u<<22)
#define NVM_PRIVBB1R6_PRIV181_B_0X0             (0x0u<<21)
#define NVM_PRIVBB1R6_PRIV181_B_0X1             (0x1u<<21)
#define NVM_PRIVBB1R6_PRIV180_B_0X0             (0x0u<<20)
#define NVM_PRIVBB1R6_PRIV180_B_0X1             (0x1u<<20)
#define NVM_PRIVBB1R6_PRIV179_B_0X0             (0x0u<<19)
#define NVM_PRIVBB1R6_PRIV179_B_0X1             (0x1u<<19)
#define NVM_PRIVBB1R6_PRIV178_B_0X0             (0x0u<<18)
#define NVM_PRIVBB1R6_PRIV178_B_0X1             (0x1u<<18)
#define NVM_PRIVBB1R6_PRIV177_B_0X0             (0x0u<<17)
#define NVM_PRIVBB1R6_PRIV177_B_0X1             (0x1u<<17)
#define NVM_PRIVBB1R6_PRIV176_B_0X0             (0x0u<<16)
#define NVM_PRIVBB1R6_PRIV176_B_0X1             (0x1u<<16)
#define NVM_PRIVBB1R6_PRIV175_B_0X0             (0x0u<<15)
#define NVM_PRIVBB1R6_PRIV175_B_0X1             (0x1u<<15)
#define NVM_PRIVBB1R6_PRIV174_B_0X0             (0x0u<<14)
#define NVM_PRIVBB1R6_PRIV174_B_0X1             (0x1u<<14)
#define NVM_PRIVBB1R6_PRIV173_B_0X0             (0x0u<<13)
#define NVM_PRIVBB1R6_PRIV173_B_0X1             (0x1u<<13)
#define NVM_PRIVBB1R6_PRIV172_B_0X0             (0x0u<<12)
#define NVM_PRIVBB1R6_PRIV172_B_0X1             (0x1u<<12)
#define NVM_PRIVBB1R6_PRIV171_B_0X0             (0x0u<<11)
#define NVM_PRIVBB1R6_PRIV171_B_0X1             (0x1u<<11)
#define NVM_PRIVBB1R6_PRIV170_B_0X0             (0x0u<<10)
#define NVM_PRIVBB1R6_PRIV170_B_0X1             (0x1u<<10)
#define NVM_PRIVBB1R6_PRIV169_B_0X0             (0x0u<<9)
#define NVM_PRIVBB1R6_PRIV169_B_0X1             (0x1u<<9)
#define NVM_PRIVBB1R6_PRIV168_B_0X0             (0x0u<<8)
#define NVM_PRIVBB1R6_PRIV168_B_0X1             (0x1u<<8)
#define NVM_PRIVBB1R6_PRIV167_B_0X0             (0x0u<<7)
#define NVM_PRIVBB1R6_PRIV167_B_0X1             (0x1u<<7)
#define NVM_PRIVBB1R6_PRIV166_B_0X0             (0x0u<<6)
#define NVM_PRIVBB1R6_PRIV166_B_0X1             (0x1u<<6)
#define NVM_PRIVBB1R6_PRIV165_B_0X0             (0x0u<<5)
#define NVM_PRIVBB1R6_PRIV165_B_0X1             (0x1u<<5)
#define NVM_PRIVBB1R6_PRIV164_B_0X0             (0x0u<<4)
#define NVM_PRIVBB1R6_PRIV164_B_0X1             (0x1u<<4)
#define NVM_PRIVBB1R6_PRIV163_B_0X0             (0x0u<<3)
#define NVM_PRIVBB1R6_PRIV163_B_0X1             (0x1u<<3)
#define NVM_PRIVBB1R6_PRIV162_B_0X0             (0x0u<<2)
#define NVM_PRIVBB1R6_PRIV162_B_0X1             (0x1u<<2)
#define NVM_PRIVBB1R6_PRIV161_B_0X0             (0x0u<<1)
#define NVM_PRIVBB1R6_PRIV161_B_0X1             (0x1u<<1)
#define NVM_PRIVBB1R6_PRIV160_B_0X0             (0x0u<<0)
#define NVM_PRIVBB1R6_PRIV160_B_0X1             (0x1u<<0)

// PRIVBB1R7 Configuration

#define NVM_PRIVBB1R7_PRIV223                   (0x1u<<31)
#define NVM_PRIVBB1R7_PRIV222                   (0x1u<<30)
#define NVM_PRIVBB1R7_PRIV221                   (0x1u<<29)
#define NVM_PRIVBB1R7_PRIV220                   (0x1u<<28)
#define NVM_PRIVBB1R7_PRIV219                   (0x1u<<27)
#define NVM_PRIVBB1R7_PRIV218                   (0x1u<<26)
#define NVM_PRIVBB1R7_PRIV217                   (0x1u<<25)
#define NVM_PRIVBB1R7_PRIV216                   (0x1u<<24)
#define NVM_PRIVBB1R7_PRIV215                   (0x1u<<23)
#define NVM_PRIVBB1R7_PRIV214                   (0x1u<<22)
#define NVM_PRIVBB1R7_PRIV213                   (0x1u<<21)
#define NVM_PRIVBB1R7_PRIV212                   (0x1u<<20)
#define NVM_PRIVBB1R7_PRIV211                   (0x1u<<19)
#define NVM_PRIVBB1R7_PRIV210                   (0x1u<<18)
#define NVM_PRIVBB1R7_PRIV209                   (0x1u<<17)
#define NVM_PRIVBB1R7_PRIV208                   (0x1u<<16)
#define NVM_PRIVBB1R7_PRIV207                   (0x1u<<15)
#define NVM_PRIVBB1R7_PRIV206                   (0x1u<<14)
#define NVM_PRIVBB1R7_PRIV205                   (0x1u<<13)
#define NVM_PRIVBB1R7_PRIV204                   (0x1u<<12)
#define NVM_PRIVBB1R7_PRIV203                   (0x1u<<11)
#define NVM_PRIVBB1R7_PRIV202                   (0x1u<<10)
#define NVM_PRIVBB1R7_PRIV201                   (0x1u<<9)
#define NVM_PRIVBB1R7_PRIV200                   (0x1u<<8)
#define NVM_PRIVBB1R7_PRIV199                   (0x1u<<7)
#define NVM_PRIVBB1R7_PRIV198                   (0x1u<<6)
#define NVM_PRIVBB1R7_PRIV197                   (0x1u<<5)
#define NVM_PRIVBB1R7_PRIV196                   (0x1u<<4)
#define NVM_PRIVBB1R7_PRIV195                   (0x1u<<3)
#define NVM_PRIVBB1R7_PRIV194                   (0x1u<<2)
#define NVM_PRIVBB1R7_PRIV193                   (0x1u<<1)
#define NVM_PRIVBB1R7_PRIV192                   (0x1u<<0)

