Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_nvm.h
#define NVM_PRIVBB1R7_PRIV223_B_0X0             (0x0u<<31)
#define NVM_PRIVBB1R7_PRIV223_B_0X1             (0x1u<<31)
#define NVM_PRIVBB1R7_PRIV222_B_0X0             (0x0u<<30)
#define NVM_PRIVBB1R7_PRIV222_B_0X1             (0x1u<<30)
#define NVM_PRIVBB1R7_PRIV221_B_0X0             (0x0u<<29)
#define NVM_PRIVBB1R7_PRIV221_B_0X1             (0x1u<<29)
#define NVM_PRIVBB1R7_PRIV220_B_0X0             (0x0u<<28)
#define NVM_PRIVBB1R7_PRIV220_B_0X1             (0x1u<<28)
#define NVM_PRIVBB1R7_PRIV219_B_0X0             (0x0u<<27)
#define NVM_PRIVBB1R7_PRIV219_B_0X1             (0x1u<<27)
#define NVM_PRIVBB1R7_PRIV218_B_0X0             (0x0u<<26)
#define NVM_PRIVBB1R7_PRIV218_B_0X1             (0x1u<<26)
#define NVM_PRIVBB1R7_PRIV217_B_0X0             (0x0u<<25)
#define NVM_PRIVBB1R7_PRIV217_B_0X1             (0x1u<<25)
#define NVM_PRIVBB1R7_PRIV216_B_0X0             (0x0u<<24)
#define NVM_PRIVBB1R7_PRIV216_B_0X1             (0x1u<<24)
#define NVM_PRIVBB1R7_PRIV215_B_0X0             (0x0u<<23)
#define NVM_PRIVBB1R7_PRIV215_B_0X1             (0x1u<<23)
#define NVM_PRIVBB1R7_PRIV214_B_0X0             (0x0u<<22)
#define NVM_PRIVBB1R7_PRIV214_B_0X1             (0x1u<<22)
#define NVM_PRIVBB1R7_PRIV213_B_0X0             (0x0u<<21)
#define NVM_PRIVBB1R7_PRIV213_B_0X1             (0x1u<<21)
#define NVM_PRIVBB1R7_PRIV212_B_0X0             (0x0u<<20)
#define NVM_PRIVBB1R7_PRIV212_B_0X1             (0x1u<<20)
#define NVM_PRIVBB1R7_PRIV211_B_0X0             (0x0u<<19)
#define NVM_PRIVBB1R7_PRIV211_B_0X1             (0x1u<<19)
#define NVM_PRIVBB1R7_PRIV210_B_0X0             (0x0u<<18)
#define NVM_PRIVBB1R7_PRIV210_B_0X1             (0x1u<<18)
#define NVM_PRIVBB1R7_PRIV209_B_0X0             (0x0u<<17)
#define NVM_PRIVBB1R7_PRIV209_B_0X1             (0x1u<<17)
#define NVM_PRIVBB1R7_PRIV208_B_0X0             (0x0u<<16)
#define NVM_PRIVBB1R7_PRIV208_B_0X1             (0x1u<<16)
#define NVM_PRIVBB1R7_PRIV207_B_0X0             (0x0u<<15)
#define NVM_PRIVBB1R7_PRIV207_B_0X1             (0x1u<<15)
#define NVM_PRIVBB1R7_PRIV206_B_0X0             (0x0u<<14)
#define NVM_PRIVBB1R7_PRIV206_B_0X1             (0x1u<<14)
#define NVM_PRIVBB1R7_PRIV205_B_0X0             (0x0u<<13)
#define NVM_PRIVBB1R7_PRIV205_B_0X1             (0x1u<<13)
#define NVM_PRIVBB1R7_PRIV204_B_0X0             (0x0u<<12)
#define NVM_PRIVBB1R7_PRIV204_B_0X1             (0x1u<<12)
#define NVM_PRIVBB1R7_PRIV203_B_0X0             (0x0u<<11)
#define NVM_PRIVBB1R7_PRIV203_B_0X1             (0x1u<<11)
#define NVM_PRIVBB1R7_PRIV202_B_0X0             (0x0u<<10)
#define NVM_PRIVBB1R7_PRIV202_B_0X1             (0x1u<<10)
#define NVM_PRIVBB1R7_PRIV201_B_0X0             (0x0u<<9)
#define NVM_PRIVBB1R7_PRIV201_B_0X1             (0x1u<<9)
#define NVM_PRIVBB1R7_PRIV200_B_0X0             (0x0u<<8)
#define NVM_PRIVBB1R7_PRIV200_B_0X1             (0x1u<<8)
#define NVM_PRIVBB1R7_PRIV199_B_0X0             (0x0u<<7)
#define NVM_PRIVBB1R7_PRIV199_B_0X1             (0x1u<<7)
#define NVM_PRIVBB1R7_PRIV198_B_0X0             (0x0u<<6)
#define NVM_PRIVBB1R7_PRIV198_B_0X1             (0x1u<<6)
#define NVM_PRIVBB1R7_PRIV197_B_0X0             (0x0u<<5)
#define NVM_PRIVBB1R7_PRIV197_B_0X1             (0x1u<<5)
#define NVM_PRIVBB1R7_PRIV196_B_0X0             (0x0u<<4)
#define NVM_PRIVBB1R7_PRIV196_B_0X1             (0x1u<<4)
#define NVM_PRIVBB1R7_PRIV195_B_0X0             (0x0u<<3)
#define NVM_PRIVBB1R7_PRIV195_B_0X1             (0x1u<<3)
#define NVM_PRIVBB1R7_PRIV194_B_0X0             (0x0u<<2)
#define NVM_PRIVBB1R7_PRIV194_B_0X1             (0x1u<<2)
#define NVM_PRIVBB1R7_PRIV193_B_0X0             (0x0u<<1)
#define NVM_PRIVBB1R7_PRIV193_B_0X1             (0x1u<<1)
#define NVM_PRIVBB1R7_PRIV192_B_0X0             (0x0u<<0)
#define NVM_PRIVBB1R7_PRIV192_B_0X1             (0x1u<<0)

// PRIVBB1R8 Configuration

#define NVM_PRIVBB1R8_PRIV255                   (0x1u<<31)
#define NVM_PRIVBB1R8_PRIV254                   (0x1u<<30)
#define NVM_PRIVBB1R8_PRIV253                   (0x1u<<29)
#define NVM_PRIVBB1R8_PRIV252                   (0x1u<<28)
#define NVM_PRIVBB1R8_PRIV251                   (0x1u<<27)
#define NVM_PRIVBB1R8_PRIV250                   (0x1u<<26)
#define NVM_PRIVBB1R8_PRIV249                   (0x1u<<25)
#define NVM_PRIVBB1R8_PRIV248                   (0x1u<<24)
#define NVM_PRIVBB1R8_PRIV247                   (0x1u<<23)
#define NVM_PRIVBB1R8_PRIV246                   (0x1u<<22)
#define NVM_PRIVBB1R8_PRIV245                   (0x1u<<21)
#define NVM_PRIVBB1R8_PRIV244                   (0x1u<<20)
#define NVM_PRIVBB1R8_PRIV243                   (0x1u<<19)
#define NVM_PRIVBB1R8_PRIV242                   (0x1u<<18)
#define NVM_PRIVBB1R8_PRIV241                   (0x1u<<17)
#define NVM_PRIVBB1R8_PRIV240                   (0x1u<<16)
#define NVM_PRIVBB1R8_PRIV239                   (0x1u<<15)
#define NVM_PRIVBB1R8_PRIV238                   (0x1u<<14)
#define NVM_PRIVBB1R8_PRIV237                   (0x1u<<13)
#define NVM_PRIVBB1R8_PRIV236                   (0x1u<<12)
#define NVM_PRIVBB1R8_PRIV235                   (0x1u<<11)
#define NVM_PRIVBB1R8_PRIV234                   (0x1u<<10)
#define NVM_PRIVBB1R8_PRIV233                   (0x1u<<9)
#define NVM_PRIVBB1R8_PRIV232                   (0x1u<<8)
#define NVM_PRIVBB1R8_PRIV231                   (0x1u<<7)
#define NVM_PRIVBB1R8_PRIV230                   (0x1u<<6)
#define NVM_PRIVBB1R8_PRIV229                   (0x1u<<5)
#define NVM_PRIVBB1R8_PRIV228                   (0x1u<<4)
#define NVM_PRIVBB1R8_PRIV227                   (0x1u<<3)
#define NVM_PRIVBB1R8_PRIV226                   (0x1u<<2)
#define NVM_PRIVBB1R8_PRIV225                   (0x1u<<1)
#define NVM_PRIVBB1R8_PRIV224                   (0x1u<<0)

#define NVM_PRIVBB1R8_PRIV255_B_0X0             (0x0u<<31)
#define NVM_PRIVBB1R8_PRIV255_B_0X1             (0x1u<<31)
#define NVM_PRIVBB1R8_PRIV254_B_0X0             (0x0u<<30)
#define NVM_PRIVBB1R8_PRIV254_B_0X1             (0x1u<<30)
#define NVM_PRIVBB1R8_PRIV253_B_0X0             (0x0u<<29)
#define NVM_PRIVBB1R8_PRIV253_B_0X1             (0x1u<<29)
#define NVM_PRIVBB1R8_PRIV252_B_0X0             (0x0u<<28)
#define NVM_PRIVBB1R8_PRIV252_B_0X1             (0x1u<<28)
#define NVM_PRIVBB1R8_PRIV251_B_0X0             (0x0u<<27)
#define NVM_PRIVBB1R8_PRIV251_B_0X1             (0x1u<<27)
#define NVM_PRIVBB1R8_PRIV250_B_0X0             (0x0u<<26)
#define NVM_PRIVBB1R8_PRIV250_B_0X1             (0x1u<<26)
#define NVM_PRIVBB1R8_PRIV249_B_0X0             (0x0u<<25)
#define NVM_PRIVBB1R8_PRIV249_B_0X1             (0x1u<<25)
#define NVM_PRIVBB1R8_PRIV248_B_0X0             (0x0u<<24)
#define NVM_PRIVBB1R8_PRIV248_B_0X1             (0x1u<<24)
#define NVM_PRIVBB1R8_PRIV247_B_0X0             (0x0u<<23)
#define NVM_PRIVBB1R8_PRIV247_B_0X1             (0x1u<<23)
#define NVM_PRIVBB1R8_PRIV246_B_0X0             (0x0u<<22)
#define NVM_PRIVBB1R8_PRIV246_B_0X1             (0x1u<<22)
#define NVM_PRIVBB1R8_PRIV245_B_0X0             (0x0u<<21)
#define NVM_PRIVBB1R8_PRIV245_B_0X1             (0x1u<<21)
#define NVM_PRIVBB1R8_PRIV244_B_0X0             (0x0u<<20)
#define NVM_PRIVBB1R8_PRIV244_B_0X1             (0x1u<<20)
#define NVM_PRIVBB1R8_PRIV243_B_0X0             (0x0u<<19)
#define NVM_PRIVBB1R8_PRIV243_B_0X1             (0x1u<<19)
#define NVM_PRIVBB1R8_PRIV242_B_0X0             (0x0u<<18)
#define NVM_PRIVBB1R8_PRIV242_B_0X1             (0x1u<<18)
#define NVM_PRIVBB1R8_PRIV241_B_0X0             (0x0u<<17)
#define NVM_PRIVBB1R8_PRIV241_B_0X1             (0x1u<<17)
#define NVM_PRIVBB1R8_PRIV240_B_0X0             (0x0u<<16)
#define NVM_PRIVBB1R8_PRIV240_B_0X1             (0x1u<<16)
#define NVM_PRIVBB1R8_PRIV239_B_0X0             (0x0u<<15)
#define NVM_PRIVBB1R8_PRIV239_B_0X1             (0x1u<<15)
#define NVM_PRIVBB1R8_PRIV238_B_0X0             (0x0u<<14)
#define NVM_PRIVBB1R8_PRIV238_B_0X1             (0x1u<<14)
#define NVM_PRIVBB1R8_PRIV237_B_0X0             (0x0u<<13)
#define NVM_PRIVBB1R8_PRIV237_B_0X1             (0x1u<<13)
#define NVM_PRIVBB1R8_PRIV236_B_0X0             (0x0u<<12)
#define NVM_PRIVBB1R8_PRIV236_B_0X1             (0x1u<<12)
#define NVM_PRIVBB1R8_PRIV235_B_0X0             (0x0u<<11)
#define NVM_PRIVBB1R8_PRIV235_B_0X1             (0x1u<<11)
#define NVM_PRIVBB1R8_PRIV234_B_0X0             (0x0u<<10)
#define NVM_PRIVBB1R8_PRIV234_B_0X1             (0x1u<<10)
#define NVM_PRIVBB1R8_PRIV233_B_0X0             (0x0u<<9)
#define NVM_PRIVBB1R8_PRIV233_B_0X1             (0x1u<<9)
#define NVM_PRIVBB1R8_PRIV232_B_0X0             (0x0u<<8)
#define NVM_PRIVBB1R8_PRIV232_B_0X1             (0x1u<<8)
#define NVM_PRIVBB1R8_PRIV231_B_0X0             (0x0u<<7)
#define NVM_PRIVBB1R8_PRIV231_B_0X1             (0x1u<<7)
#define NVM_PRIVBB1R8_PRIV230_B_0X0             (0x0u<<6)
#define NVM_PRIVBB1R8_PRIV230_B_0X1             (0x1u<<6)
#define NVM_PRIVBB1R8_PRIV229_B_0X0             (0x0u<<5)
#define NVM_PRIVBB1R8_PRIV229_B_0X1             (0x1u<<5)
#define NVM_PRIVBB1R8_PRIV228_B_0X0             (0x0u<<4)
#define NVM_PRIVBB1R8_PRIV228_B_0X1             (0x1u<<4)
#define NVM_PRIVBB1R8_PRIV227_B_0X0             (0x0u<<3)
#define NVM_PRIVBB1R8_PRIV227_B_0X1             (0x1u<<3)
#define NVM_PRIVBB1R8_PRIV226_B_0X0             (0x0u<<2)
#define NVM_PRIVBB1R8_PRIV226_B_0X1             (0x1u<<2)
#define NVM_PRIVBB1R8_PRIV225_B_0X0             (0x0u<<1)
#define NVM_PRIVBB1R8_PRIV225_B_0X1             (0x1u<<1)
#define NVM_PRIVBB1R8_PRIV224_B_0X0             (0x0u<<0)
#define NVM_PRIVBB1R8_PRIV224_B_0X1             (0x1u<<0)

// SECWM1R_CUR Configuration

