Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_nvm.h
#define NVM_SECWM1R_CUR_END                     (0xFFu<<16)
#define NVM_SECWM1R_CUR_END_0                   (0x1u<<16)
#define NVM_SECWM1R_CUR_STRT                    (0xFFu<<0)
#define NVM_SECWM1R_CUR_STRT_0                  (0x1u<<0)

// SECWM1R_PRG Configuration

#define NVM_SECWM1R_PRG_END                     (0xFFu<<16)
#define NVM_SECWM1R_PRG_END_0                   (0x1u<<16)
#define NVM_SECWM1R_PRG_STRT                    (0xFFu<<0)
#define NVM_SECWM1R_PRG_STRT_0                  (0x1u<<0)

// HDP1R_CUR Configuration

#define NVM_HDP1R_CUR_END                       (0xFFu<<16)
#define NVM_HDP1R_CUR_END_0                     (0x1u<<16)
#define NVM_HDP1R_CUR_STRT                      (0xFFu<<0)
#define NVM_HDP1R_CUR_STRT_0                    (0x1u<<0)

// HDP1R_PRG Configuration

#define NVM_HDP1R_PRG_END                       (0xFFu<<16)
#define NVM_HDP1R_PRG_END_0                     (0x1u<<16)
#define NVM_HDP1R_PRG_STRT                      (0xFFu<<0)
#define NVM_HDP1R_PRG_STRT_0                    (0x1u<<0)

// WRP1R1_CUR Configuration

#define NVM_WRP1R1_CUR_SGN31                    (0x1u<<31)
#define NVM_WRP1R1_CUR_SGN30                    (0x1u<<30)
#define NVM_WRP1R1_CUR_SGN29                    (0x1u<<29)
#define NVM_WRP1R1_CUR_SGN28                    (0x1u<<28)
#define NVM_WRP1R1_CUR_SGN27                    (0x1u<<27)
#define NVM_WRP1R1_CUR_SGN26                    (0x1u<<26)
#define NVM_WRP1R1_CUR_SGN25                    (0x1u<<25)
#define NVM_WRP1R1_CUR_SGN24                    (0x1u<<24)
#define NVM_WRP1R1_CUR_SGN23                    (0x1u<<23)
#define NVM_WRP1R1_CUR_SGN22                    (0x1u<<22)
#define NVM_WRP1R1_CUR_SGN21                    (0x1u<<21)
#define NVM_WRP1R1_CUR_SGN20                    (0x1u<<20)
#define NVM_WRP1R1_CUR_SGN19                    (0x1u<<19)
#define NVM_WRP1R1_CUR_SGN18                    (0x1u<<18)
#define NVM_WRP1R1_CUR_SGN17                    (0x1u<<17)
#define NVM_WRP1R1_CUR_SGN16                    (0x1u<<16)
#define NVM_WRP1R1_CUR_SGN15                    (0x1u<<15)
#define NVM_WRP1R1_CUR_SGN14                    (0x1u<<14)
#define NVM_WRP1R1_CUR_SGN13                    (0x1u<<13)
#define NVM_WRP1R1_CUR_SGN12                    (0x1u<<12)
#define NVM_WRP1R1_CUR_SGN11                    (0x1u<<11)
#define NVM_WRP1R1_CUR_SGN10                    (0x1u<<10)
#define NVM_WRP1R1_CUR_SGN9                     (0x1u<<9)
#define NVM_WRP1R1_CUR_SGN8                     (0x1u<<8)
#define NVM_WRP1R1_CUR_SGN7                     (0x1u<<7)
#define NVM_WRP1R1_CUR_SGN6                     (0x1u<<6)
#define NVM_WRP1R1_CUR_SGN5                     (0x1u<<5)
#define NVM_WRP1R1_CUR_SGN4                     (0x1u<<4)
#define NVM_WRP1R1_CUR_SGN3                     (0x1u<<3)
#define NVM_WRP1R1_CUR_SGN2                     (0x1u<<2)
#define NVM_WRP1R1_CUR_SGN1                     (0x1u<<1)
#define NVM_WRP1R1_CUR_SGN0                     (0x1u<<0)

#define NVM_WRP1R1_CUR_SGN31_B_0X0              (0x0u<<31)
#define NVM_WRP1R1_CUR_SGN31_B_0X1              (0x1u<<31)
#define NVM_WRP1R1_CUR_SGN30_B_0X0              (0x0u<<30)
#define NVM_WRP1R1_CUR_SGN30_B_0X1              (0x1u<<30)
#define NVM_WRP1R1_CUR_SGN29_B_0X0              (0x0u<<29)
#define NVM_WRP1R1_CUR_SGN29_B_0X1              (0x1u<<29)
#define NVM_WRP1R1_CUR_SGN28_B_0X0              (0x0u<<28)
#define NVM_WRP1R1_CUR_SGN28_B_0X1              (0x1u<<28)
#define NVM_WRP1R1_CUR_SGN27_B_0X0              (0x0u<<27)
#define NVM_WRP1R1_CUR_SGN27_B_0X1              (0x1u<<27)
#define NVM_WRP1R1_CUR_SGN26_B_0X0              (0x0u<<26)
#define NVM_WRP1R1_CUR_SGN26_B_0X1              (0x1u<<26)
#define NVM_WRP1R1_CUR_SGN25_B_0X0              (0x0u<<25)
#define NVM_WRP1R1_CUR_SGN25_B_0X1              (0x1u<<25)
#define NVM_WRP1R1_CUR_SGN24_B_0X0              (0x0u<<24)
#define NVM_WRP1R1_CUR_SGN24_B_0X1              (0x1u<<24)
#define NVM_WRP1R1_CUR_SGN23_B_0X0              (0x0u<<23)
#define NVM_WRP1R1_CUR_SGN23_B_0X1              (0x1u<<23)
#define NVM_WRP1R1_CUR_SGN22_B_0X0              (0x0u<<22)
#define NVM_WRP1R1_CUR_SGN22_B_0X1              (0x1u<<22)
#define NVM_WRP1R1_CUR_SGN21_B_0X0              (0x0u<<21)
#define NVM_WRP1R1_CUR_SGN21_B_0X1              (0x1u<<21)
#define NVM_WRP1R1_CUR_SGN20_B_0X0              (0x0u<<20)
#define NVM_WRP1R1_CUR_SGN20_B_0X1              (0x1u<<20)
#define NVM_WRP1R1_CUR_SGN19_B_0X0              (0x0u<<19)
#define NVM_WRP1R1_CUR_SGN19_B_0X1              (0x1u<<19)
#define NVM_WRP1R1_CUR_SGN18_B_0X0              (0x0u<<18)
#define NVM_WRP1R1_CUR_SGN18_B_0X1              (0x1u<<18)
#define NVM_WRP1R1_CUR_SGN17_B_0X0              (0x0u<<17)
#define NVM_WRP1R1_CUR_SGN17_B_0X1              (0x1u<<17)
#define NVM_WRP1R1_CUR_SGN16_B_0X0              (0x0u<<16)
#define NVM_WRP1R1_CUR_SGN16_B_0X1              (0x1u<<16)
#define NVM_WRP1R1_CUR_SGN15_B_0X0              (0x0u<<15)
#define NVM_WRP1R1_CUR_SGN15_B_0X1              (0x1u<<15)
#define NVM_WRP1R1_CUR_SGN14_B_0X0              (0x0u<<14)
#define NVM_WRP1R1_CUR_SGN14_B_0X1              (0x1u<<14)
#define NVM_WRP1R1_CUR_SGN13_B_0X0              (0x0u<<13)
#define NVM_WRP1R1_CUR_SGN13_B_0X1              (0x1u<<13)
#define NVM_WRP1R1_CUR_SGN12_B_0X0              (0x0u<<12)
#define NVM_WRP1R1_CUR_SGN12_B_0X1              (0x1u<<12)
#define NVM_WRP1R1_CUR_SGN11_B_0X0              (0x0u<<11)
#define NVM_WRP1R1_CUR_SGN11_B_0X1              (0x1u<<11)
#define NVM_WRP1R1_CUR_SGN10_B_0X0              (0x0u<<10)
#define NVM_WRP1R1_CUR_SGN10_B_0X1              (0x1u<<10)
#define NVM_WRP1R1_CUR_SGN9_B_0X0               (0x0u<<9)
#define NVM_WRP1R1_CUR_SGN9_B_0X1               (0x1u<<9)
#define NVM_WRP1R1_CUR_SGN8_B_0X0               (0x0u<<8)
#define NVM_WRP1R1_CUR_SGN8_B_0X1               (0x1u<<8)
#define NVM_WRP1R1_CUR_SGN7_B_0X0               (0x0u<<7)
#define NVM_WRP1R1_CUR_SGN7_B_0X1               (0x1u<<7)
#define NVM_WRP1R1_CUR_SGN6_B_0X0               (0x0u<<6)
#define NVM_WRP1R1_CUR_SGN6_B_0X1               (0x1u<<6)
#define NVM_WRP1R1_CUR_SGN5_B_0X0               (0x0u<<5)
#define NVM_WRP1R1_CUR_SGN5_B_0X1               (0x1u<<5)
#define NVM_WRP1R1_CUR_SGN4_B_0X0               (0x0u<<4)
#define NVM_WRP1R1_CUR_SGN4_B_0X1               (0x1u<<4)
#define NVM_WRP1R1_CUR_SGN3_B_0X0               (0x0u<<3)
#define NVM_WRP1R1_CUR_SGN3_B_0X1               (0x1u<<3)
#define NVM_WRP1R1_CUR_SGN2_B_0X0               (0x0u<<2)
#define NVM_WRP1R1_CUR_SGN2_B_0X1               (0x1u<<2)
#define NVM_WRP1R1_CUR_SGN1_B_0X0               (0x0u<<1)
#define NVM_WRP1R1_CUR_SGN1_B_0X1               (0x1u<<1)
#define NVM_WRP1R1_CUR_SGN0_B_0X0               (0x0u<<0)
#define NVM_WRP1R1_CUR_SGN0_B_0X1               (0x1u<<0)

