Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_nvm.h
// EDATA1R_PRG Configuration

#define NVM_EDATA1R_PRG_EN                      (0x1u<<15)
#define NVM_EDATA1R_PRG_STRT                    (0xFu<<0)
#define NVM_EDATA1R_PRG_STRT_0                  (0x1u<<0)

#define NVM_EDATA1R_PRG_EN_B_0X0                (0x0u<<15)
#define NVM_EDATA1R_PRG_EN_B_0X1                (0x1u<<15)
#define NVM_EDATA1R_PRG_STRT_B_0X0              (0x0u<<0)
#define NVM_EDATA1R_PRG_STRT_B_0X1              (0x1u<<0)
#define NVM_EDATA1R_PRG_STRT_B_0X2              (0x2u<<0)
#define NVM_EDATA1R_PRG_STRT_B_0XF              (0xFu<<0)

// HDPEXT1R Configuration

#define NVM_HDPEXT1R_EXT                        (0x1FFu<<0)
#define NVM_HDPEXT1R_EXT_0                      (0x1u<<0)

#define NVM_HDPEXT1R_EXT_B_0X0                  (0x0u<<0)
#define NVM_HDPEXT1R_EXT_B_0X1                  (0x1u<<0)
#define NVM_HDPEXT1R_EXT_B_0X2                  (0x2u<<0)
#define NVM_HDPEXT1R_EXT_B_0XFF                 (0xFFu<<0)

// LPC1R Configuration

#define NVM_LPC1R_PDREQ                         (0x1u<<0)

#define NVM_LPC1R_PDREQ_B_0X0                   (0x0u<<0)
#define NVM_LPC1R_PDREQ_B_0X1                   (0x1u<<0)

// LPS1R Configuration

#define NVM_LPS1R_PD                            (0x1u<<0)

#define NVM_LPS1R_PD_B_0X0                      (0x0u<<0)
#define NVM_LPS1R_PD_B_0X1                      (0x1u<<0)

// WRPLOCK1R_CUR Configuration

#define NVM_WRPLOCK1R_CUR_LOCK                  (0xFFu<<0)
#define NVM_WRPLOCK1R_CUR_LOCK_0                (0x1u<<0)

#define NVM_WRPLOCK1R_CUR_LOCK_B_0XB6           (0xB6u<<0)
#define NVM_WRPLOCK1R_CUR_LOCK_B_0X49           (0x49u<<0)

// WRPLOCK1R_PRG Configuration

#define NVM_WRPLOCK1R_PRG_LOCK                  (0xFFu<<0)
#define NVM_WRPLOCK1R_PRG_LOCK_0                (0x1u<<0)

#define NVM_WRPLOCK1R_PRG_LOCK_B_0XB6           (0xB6u<<0)
#define NVM_WRPLOCK1R_PRG_LOCK_B_0X49           (0x49u<<0)

// LOCKBB1R Configuration

#define NVM_LOCKBB1R_LOCKBB                     (0x1u<<0)

#define NVM_LOCKBB1R_LOCKBB_B_0X0               (0x0u<<0)
#define NVM_LOCKBB1R_LOCKBB_B_0X1               (0x1u<<0)

// SECBB2R1 Configuration

#define NVM_SECBB2R1_SEC31                      (0x1u<<31)
#define NVM_SECBB2R1_SEC30                      (0x1u<<30)
#define NVM_SECBB2R1_SEC29                      (0x1u<<29)
#define NVM_SECBB2R1_SEC28                      (0x1u<<28)
#define NVM_SECBB2R1_SEC27                      (0x1u<<27)
#define NVM_SECBB2R1_SEC26                      (0x1u<<26)
#define NVM_SECBB2R1_SEC25                      (0x1u<<25)
#define NVM_SECBB2R1_SEC24                      (0x1u<<24)
#define NVM_SECBB2R1_SEC23                      (0x1u<<23)
#define NVM_SECBB2R1_SEC22                      (0x1u<<22)
#define NVM_SECBB2R1_SEC21                      (0x1u<<21)
#define NVM_SECBB2R1_SEC20                      (0x1u<<20)
#define NVM_SECBB2R1_SEC19                      (0x1u<<19)
#define NVM_SECBB2R1_SEC18                      (0x1u<<18)
#define NVM_SECBB2R1_SEC17                      (0x1u<<17)
#define NVM_SECBB2R1_SEC16                      (0x1u<<16)
#define NVM_SECBB2R1_SEC15                      (0x1u<<15)
#define NVM_SECBB2R1_SEC14                      (0x1u<<14)
#define NVM_SECBB2R1_SEC13                      (0x1u<<13)
#define NVM_SECBB2R1_SEC12                      (0x1u<<12)
#define NVM_SECBB2R1_SEC11                      (0x1u<<11)
#define NVM_SECBB2R1_SEC10                      (0x1u<<10)
#define NVM_SECBB2R1_SEC9                       (0x1u<<9)
#define NVM_SECBB2R1_SEC8                       (0x1u<<8)
#define NVM_SECBB2R1_SEC7                       (0x1u<<7)
#define NVM_SECBB2R1_SEC6                       (0x1u<<6)
#define NVM_SECBB2R1_SEC5                       (0x1u<<5)
#define NVM_SECBB2R1_SEC4                       (0x1u<<4)
#define NVM_SECBB2R1_SEC3                       (0x1u<<3)
#define NVM_SECBB2R1_SEC2                       (0x1u<<2)
#define NVM_SECBB2R1_SEC1                       (0x1u<<1)
#define NVM_SECBB2R1_SEC0                       (0x1u<<0)

#define NVM_SECBB2R1_SEC31_B_0X0                (0x0u<<31)
#define NVM_SECBB2R1_SEC31_B_0X1                (0x1u<<31)
#define NVM_SECBB2R1_SEC30_B_0X0                (0x0u<<30)
#define NVM_SECBB2R1_SEC30_B_0X1                (0x1u<<30)
#define NVM_SECBB2R1_SEC29_B_0X0                (0x0u<<29)
#define NVM_SECBB2R1_SEC29_B_0X1                (0x1u<<29)
#define NVM_SECBB2R1_SEC28_B_0X0                (0x0u<<28)
#define NVM_SECBB2R1_SEC28_B_0X1                (0x1u<<28)
#define NVM_SECBB2R1_SEC27_B_0X0                (0x0u<<27)
#define NVM_SECBB2R1_SEC27_B_0X1                (0x1u<<27)
#define NVM_SECBB2R1_SEC26_B_0X0                (0x0u<<26)
#define NVM_SECBB2R1_SEC26_B_0X1                (0x1u<<26)
#define NVM_SECBB2R1_SEC25_B_0X0                (0x0u<<25)
#define NVM_SECBB2R1_SEC25_B_0X1                (0x1u<<25)
#define NVM_SECBB2R1_SEC24_B_0X0                (0x0u<<24)
#define NVM_SECBB2R1_SEC24_B_0X1                (0x1u<<24)
#define NVM_SECBB2R1_SEC23_B_0X0                (0x0u<<23)
#define NVM_SECBB2R1_SEC23_B_0X1                (0x1u<<23)
#define NVM_SECBB2R1_SEC22_B_0X0                (0x0u<<22)
#define NVM_SECBB2R1_SEC22_B_0X1                (0x1u<<22)
#define NVM_SECBB2R1_SEC21_B_0X0                (0x0u<<21)
#define NVM_SECBB2R1_SEC21_B_0X1                (0x1u<<21)
#define NVM_SECBB2R1_SEC20_B_0X0                (0x0u<<20)
#define NVM_SECBB2R1_SEC20_B_0X1                (0x1u<<20)
#define NVM_SECBB2R1_SEC19_B_0X0                (0x0u<<19)
#define NVM_SECBB2R1_SEC19_B_0X1                (0x1u<<19)
#define NVM_SECBB2R1_SEC18_B_0X0                (0x0u<<18)
#define NVM_SECBB2R1_SEC18_B_0X1                (0x1u<<18)
#define NVM_SECBB2R1_SEC17_B_0X0                (0x0u<<17)
#define NVM_SECBB2R1_SEC17_B_0X1                (0x1u<<17)
#define NVM_SECBB2R1_SEC16_B_0X0                (0x0u<<16)
#define NVM_SECBB2R1_SEC16_B_0X1                (0x1u<<16)
#define NVM_SECBB2R1_SEC15_B_0X0                (0x0u<<15)
#define NVM_SECBB2R1_SEC15_B_0X1                (0x1u<<15)
#define NVM_SECBB2R1_SEC14_B_0X0                (0x0u<<14)
#define NVM_SECBB2R1_SEC14_B_0X1                (0x1u<<14)
#define NVM_SECBB2R1_SEC13_B_0X0                (0x0u<<13)
#define NVM_SECBB2R1_SEC13_B_0X1                (0x1u<<13)
#define NVM_SECBB2R1_SEC12_B_0X0                (0x0u<<12)
#define NVM_SECBB2R1_SEC12_B_0X1                (0x1u<<12)
#define NVM_SECBB2R1_SEC11_B_0X0                (0x0u<<11)
#define NVM_SECBB2R1_SEC11_B_0X1                (0x1u<<11)
#define NVM_SECBB2R1_SEC10_B_0X0                (0x0u<<10)
#define NVM_SECBB2R1_SEC10_B_0X1                (0x1u<<10)
#define NVM_SECBB2R1_SEC9_B_0X0                 (0x0u<<9)
#define NVM_SECBB2R1_SEC9_B_0X1                 (0x1u<<9)
#define NVM_SECBB2R1_SEC8_B_0X0                 (0x0u<<8)
#define NVM_SECBB2R1_SEC8_B_0X1                 (0x1u<<8)
#define NVM_SECBB2R1_SEC7_B_0X0                 (0x0u<<7)
#define NVM_SECBB2R1_SEC7_B_0X1                 (0x1u<<7)
#define NVM_SECBB2R1_SEC6_B_0X0                 (0x0u<<6)
#define NVM_SECBB2R1_SEC6_B_0X1                 (0x1u<<6)
#define NVM_SECBB2R1_SEC5_B_0X0                 (0x0u<<5)
#define NVM_SECBB2R1_SEC5_B_0X1                 (0x1u<<5)
#define NVM_SECBB2R1_SEC4_B_0X0                 (0x0u<<4)
#define NVM_SECBB2R1_SEC4_B_0X1                 (0x1u<<4)
#define NVM_SECBB2R1_SEC3_B_0X0                 (0x0u<<3)
#define NVM_SECBB2R1_SEC3_B_0X1                 (0x1u<<3)
#define NVM_SECBB2R1_SEC2_B_0X0                 (0x0u<<2)
#define NVM_SECBB2R1_SEC2_B_0X1                 (0x1u<<2)
#define NVM_SECBB2R1_SEC1_B_0X0                 (0x0u<<1)
#define NVM_SECBB2R1_SEC1_B_0X1                 (0x1u<<1)
#define NVM_SECBB2R1_SEC0_B_0X0                 (0x0u<<0)
#define NVM_SECBB2R1_SEC0_B_0X1                 (0x1u<<0)

