Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_nvm.h
#define NVM_SECBB2R4_SEC127                     (0x1u<<31)
#define NVM_SECBB2R4_SEC126                     (0x1u<<30)
#define NVM_SECBB2R4_SEC125                     (0x1u<<29)
#define NVM_SECBB2R4_SEC124                     (0x1u<<28)
#define NVM_SECBB2R4_SEC123                     (0x1u<<27)
#define NVM_SECBB2R4_SEC122                     (0x1u<<26)
#define NVM_SECBB2R4_SEC121                     (0x1u<<25)
#define NVM_SECBB2R4_SEC120                     (0x1u<<24)
#define NVM_SECBB2R4_SEC119                     (0x1u<<23)
#define NVM_SECBB2R4_SEC118                     (0x1u<<22)
#define NVM_SECBB2R4_SEC117                     (0x1u<<21)
#define NVM_SECBB2R4_SEC116                     (0x1u<<20)
#define NVM_SECBB2R4_SEC115                     (0x1u<<19)
#define NVM_SECBB2R4_SEC114                     (0x1u<<18)
#define NVM_SECBB2R4_SEC113                     (0x1u<<17)
#define NVM_SECBB2R4_SEC112                     (0x1u<<16)
#define NVM_SECBB2R4_SEC111                     (0x1u<<15)
#define NVM_SECBB2R4_SEC110                     (0x1u<<14)
#define NVM_SECBB2R4_SEC109                     (0x1u<<13)
#define NVM_SECBB2R4_SEC108                     (0x1u<<12)
#define NVM_SECBB2R4_SEC107                     (0x1u<<11)
#define NVM_SECBB2R4_SEC106                     (0x1u<<10)
#define NVM_SECBB2R4_SEC105                     (0x1u<<9)
#define NVM_SECBB2R4_SEC104                     (0x1u<<8)
#define NVM_SECBB2R4_SEC103                     (0x1u<<7)
#define NVM_SECBB2R4_SEC102                     (0x1u<<6)
#define NVM_SECBB2R4_SEC101                     (0x1u<<5)
#define NVM_SECBB2R4_SEC100                     (0x1u<<4)
#define NVM_SECBB2R4_SEC99                      (0x1u<<3)
#define NVM_SECBB2R4_SEC98                      (0x1u<<2)
#define NVM_SECBB2R4_SEC97                      (0x1u<<1)
#define NVM_SECBB2R4_SEC96                      (0x1u<<0)

#define NVM_SECBB2R4_SEC127_B_0X0               (0x0u<<31)
#define NVM_SECBB2R4_SEC127_B_0X1               (0x1u<<31)
#define NVM_SECBB2R4_SEC126_B_0X0               (0x0u<<30)
#define NVM_SECBB2R4_SEC126_B_0X1               (0x1u<<30)
#define NVM_SECBB2R4_SEC125_B_0X0               (0x0u<<29)
#define NVM_SECBB2R4_SEC125_B_0X1               (0x1u<<29)
#define NVM_SECBB2R4_SEC124_B_0X0               (0x0u<<28)
#define NVM_SECBB2R4_SEC124_B_0X1               (0x1u<<28)
#define NVM_SECBB2R4_SEC123_B_0X0               (0x0u<<27)
#define NVM_SECBB2R4_SEC123_B_0X1               (0x1u<<27)
#define NVM_SECBB2R4_SEC122_B_0X0               (0x0u<<26)
#define NVM_SECBB2R4_SEC122_B_0X1               (0x1u<<26)
#define NVM_SECBB2R4_SEC121_B_0X0               (0x0u<<25)
#define NVM_SECBB2R4_SEC121_B_0X1               (0x1u<<25)
#define NVM_SECBB2R4_SEC120_B_0X0               (0x0u<<24)
#define NVM_SECBB2R4_SEC120_B_0X1               (0x1u<<24)
#define NVM_SECBB2R4_SEC119_B_0X0               (0x0u<<23)
#define NVM_SECBB2R4_SEC119_B_0X1               (0x1u<<23)
#define NVM_SECBB2R4_SEC118_B_0X0               (0x0u<<22)
#define NVM_SECBB2R4_SEC118_B_0X1               (0x1u<<22)
#define NVM_SECBB2R4_SEC117_B_0X0               (0x0u<<21)
#define NVM_SECBB2R4_SEC117_B_0X1               (0x1u<<21)
#define NVM_SECBB2R4_SEC116_B_0X0               (0x0u<<20)
#define NVM_SECBB2R4_SEC116_B_0X1               (0x1u<<20)
#define NVM_SECBB2R4_SEC115_B_0X0               (0x0u<<19)
#define NVM_SECBB2R4_SEC115_B_0X1               (0x1u<<19)
#define NVM_SECBB2R4_SEC114_B_0X0               (0x0u<<18)
#define NVM_SECBB2R4_SEC114_B_0X1               (0x1u<<18)
#define NVM_SECBB2R4_SEC113_B_0X0               (0x0u<<17)
#define NVM_SECBB2R4_SEC113_B_0X1               (0x1u<<17)
#define NVM_SECBB2R4_SEC112_B_0X0               (0x0u<<16)
#define NVM_SECBB2R4_SEC112_B_0X1               (0x1u<<16)
#define NVM_SECBB2R4_SEC111_B_0X0               (0x0u<<15)
#define NVM_SECBB2R4_SEC111_B_0X1               (0x1u<<15)
#define NVM_SECBB2R4_SEC110_B_0X0               (0x0u<<14)
#define NVM_SECBB2R4_SEC110_B_0X1               (0x1u<<14)
#define NVM_SECBB2R4_SEC109_B_0X0               (0x0u<<13)
#define NVM_SECBB2R4_SEC109_B_0X1               (0x1u<<13)
#define NVM_SECBB2R4_SEC108_B_0X0               (0x0u<<12)
#define NVM_SECBB2R4_SEC108_B_0X1               (0x1u<<12)
#define NVM_SECBB2R4_SEC107_B_0X0               (0x0u<<11)
#define NVM_SECBB2R4_SEC107_B_0X1               (0x1u<<11)
#define NVM_SECBB2R4_SEC106_B_0X0               (0x0u<<10)
#define NVM_SECBB2R4_SEC106_B_0X1               (0x1u<<10)
#define NVM_SECBB2R4_SEC105_B_0X0               (0x0u<<9)
#define NVM_SECBB2R4_SEC105_B_0X1               (0x1u<<9)
#define NVM_SECBB2R4_SEC104_B_0X0               (0x0u<<8)
#define NVM_SECBB2R4_SEC104_B_0X1               (0x1u<<8)
#define NVM_SECBB2R4_SEC103_B_0X0               (0x0u<<7)
#define NVM_SECBB2R4_SEC103_B_0X1               (0x1u<<7)
#define NVM_SECBB2R4_SEC102_B_0X0               (0x0u<<6)
#define NVM_SECBB2R4_SEC102_B_0X1               (0x1u<<6)
#define NVM_SECBB2R4_SEC101_B_0X0               (0x0u<<5)
#define NVM_SECBB2R4_SEC101_B_0X1               (0x1u<<5)
#define NVM_SECBB2R4_SEC100_B_0X0               (0x0u<<4)
#define NVM_SECBB2R4_SEC100_B_0X1               (0x1u<<4)
#define NVM_SECBB2R4_SEC99_B_0X0                (0x0u<<3)
#define NVM_SECBB2R4_SEC99_B_0X1                (0x1u<<3)
#define NVM_SECBB2R4_SEC98_B_0X0                (0x0u<<2)
#define NVM_SECBB2R4_SEC98_B_0X1                (0x1u<<2)
#define NVM_SECBB2R4_SEC97_B_0X0                (0x0u<<1)
#define NVM_SECBB2R4_SEC97_B_0X1                (0x1u<<1)
#define NVM_SECBB2R4_SEC96_B_0X0                (0x0u<<0)
#define NVM_SECBB2R4_SEC96_B_0X1                (0x1u<<0)

// SECBB2R5 Configuration

#define NVM_SECBB2R5_SEC159                     (0x1u<<31)
#define NVM_SECBB2R5_SEC158                     (0x1u<<30)
#define NVM_SECBB2R5_SEC157                     (0x1u<<29)
#define NVM_SECBB2R5_SEC156                     (0x1u<<28)
#define NVM_SECBB2R5_SEC155                     (0x1u<<27)
#define NVM_SECBB2R5_SEC154                     (0x1u<<26)
#define NVM_SECBB2R5_SEC153                     (0x1u<<25)
#define NVM_SECBB2R5_SEC152                     (0x1u<<24)
#define NVM_SECBB2R5_SEC151                     (0x1u<<23)
#define NVM_SECBB2R5_SEC150                     (0x1u<<22)
#define NVM_SECBB2R5_SEC149                     (0x1u<<21)
#define NVM_SECBB2R5_SEC148                     (0x1u<<20)
#define NVM_SECBB2R5_SEC147                     (0x1u<<19)
#define NVM_SECBB2R5_SEC146                     (0x1u<<18)
#define NVM_SECBB2R5_SEC145                     (0x1u<<17)
#define NVM_SECBB2R5_SEC144                     (0x1u<<16)
#define NVM_SECBB2R5_SEC143                     (0x1u<<15)
#define NVM_SECBB2R5_SEC142                     (0x1u<<14)
#define NVM_SECBB2R5_SEC141                     (0x1u<<13)
#define NVM_SECBB2R5_SEC140                     (0x1u<<12)
#define NVM_SECBB2R5_SEC139                     (0x1u<<11)
#define NVM_SECBB2R5_SEC138                     (0x1u<<10)
#define NVM_SECBB2R5_SEC137                     (0x1u<<9)
#define NVM_SECBB2R5_SEC136                     (0x1u<<8)
#define NVM_SECBB2R5_SEC135                     (0x1u<<7)
#define NVM_SECBB2R5_SEC134                     (0x1u<<6)
#define NVM_SECBB2R5_SEC133                     (0x1u<<5)
#define NVM_SECBB2R5_SEC132                     (0x1u<<4)
#define NVM_SECBB2R5_SEC131                     (0x1u<<3)
#define NVM_SECBB2R5_SEC130                     (0x1u<<2)
#define NVM_SECBB2R5_SEC129                     (0x1u<<1)
#define NVM_SECBB2R5_SEC128                     (0x1u<<0)

