Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_nvm.h
#define NVM_SECBB2R5_SEC159_B_0X0               (0x0u<<31)
#define NVM_SECBB2R5_SEC159_B_0X1               (0x1u<<31)
#define NVM_SECBB2R5_SEC158_B_0X0               (0x0u<<30)
#define NVM_SECBB2R5_SEC158_B_0X1               (0x1u<<30)
#define NVM_SECBB2R5_SEC157_B_0X0               (0x0u<<29)
#define NVM_SECBB2R5_SEC157_B_0X1               (0x1u<<29)
#define NVM_SECBB2R5_SEC156_B_0X0               (0x0u<<28)
#define NVM_SECBB2R5_SEC156_B_0X1               (0x1u<<28)
#define NVM_SECBB2R5_SEC155_B_0X0               (0x0u<<27)
#define NVM_SECBB2R5_SEC155_B_0X1               (0x1u<<27)
#define NVM_SECBB2R5_SEC154_B_0X0               (0x0u<<26)
#define NVM_SECBB2R5_SEC154_B_0X1               (0x1u<<26)
#define NVM_SECBB2R5_SEC153_B_0X0               (0x0u<<25)
#define NVM_SECBB2R5_SEC153_B_0X1               (0x1u<<25)
#define NVM_SECBB2R5_SEC152_B_0X0               (0x0u<<24)
#define NVM_SECBB2R5_SEC152_B_0X1               (0x1u<<24)
#define NVM_SECBB2R5_SEC151_B_0X0               (0x0u<<23)
#define NVM_SECBB2R5_SEC151_B_0X1               (0x1u<<23)
#define NVM_SECBB2R5_SEC150_B_0X0               (0x0u<<22)
#define NVM_SECBB2R5_SEC150_B_0X1               (0x1u<<22)
#define NVM_SECBB2R5_SEC149_B_0X0               (0x0u<<21)
#define NVM_SECBB2R5_SEC149_B_0X1               (0x1u<<21)
#define NVM_SECBB2R5_SEC148_B_0X0               (0x0u<<20)
#define NVM_SECBB2R5_SEC148_B_0X1               (0x1u<<20)
#define NVM_SECBB2R5_SEC147_B_0X0               (0x0u<<19)
#define NVM_SECBB2R5_SEC147_B_0X1               (0x1u<<19)
#define NVM_SECBB2R5_SEC146_B_0X0               (0x0u<<18)
#define NVM_SECBB2R5_SEC146_B_0X1               (0x1u<<18)
#define NVM_SECBB2R5_SEC145_B_0X0               (0x0u<<17)
#define NVM_SECBB2R5_SEC145_B_0X1               (0x1u<<17)
#define NVM_SECBB2R5_SEC144_B_0X0               (0x0u<<16)
#define NVM_SECBB2R5_SEC144_B_0X1               (0x1u<<16)
#define NVM_SECBB2R5_SEC143_B_0X0               (0x0u<<15)
#define NVM_SECBB2R5_SEC143_B_0X1               (0x1u<<15)
#define NVM_SECBB2R5_SEC142_B_0X0               (0x0u<<14)
#define NVM_SECBB2R5_SEC142_B_0X1               (0x1u<<14)
#define NVM_SECBB2R5_SEC141_B_0X0               (0x0u<<13)
#define NVM_SECBB2R5_SEC141_B_0X1               (0x1u<<13)
#define NVM_SECBB2R5_SEC140_B_0X0               (0x0u<<12)
#define NVM_SECBB2R5_SEC140_B_0X1               (0x1u<<12)
#define NVM_SECBB2R5_SEC139_B_0X0               (0x0u<<11)
#define NVM_SECBB2R5_SEC139_B_0X1               (0x1u<<11)
#define NVM_SECBB2R5_SEC138_B_0X0               (0x0u<<10)
#define NVM_SECBB2R5_SEC138_B_0X1               (0x1u<<10)
#define NVM_SECBB2R5_SEC137_B_0X0               (0x0u<<9)
#define NVM_SECBB2R5_SEC137_B_0X1               (0x1u<<9)
#define NVM_SECBB2R5_SEC136_B_0X0               (0x0u<<8)
#define NVM_SECBB2R5_SEC136_B_0X1               (0x1u<<8)
#define NVM_SECBB2R5_SEC135_B_0X0               (0x0u<<7)
#define NVM_SECBB2R5_SEC135_B_0X1               (0x1u<<7)
#define NVM_SECBB2R5_SEC134_B_0X0               (0x0u<<6)
#define NVM_SECBB2R5_SEC134_B_0X1               (0x1u<<6)
#define NVM_SECBB2R5_SEC133_B_0X0               (0x0u<<5)
#define NVM_SECBB2R5_SEC133_B_0X1               (0x1u<<5)
#define NVM_SECBB2R5_SEC132_B_0X0               (0x0u<<4)
#define NVM_SECBB2R5_SEC132_B_0X1               (0x1u<<4)
#define NVM_SECBB2R5_SEC131_B_0X0               (0x0u<<3)
#define NVM_SECBB2R5_SEC131_B_0X1               (0x1u<<3)
#define NVM_SECBB2R5_SEC130_B_0X0               (0x0u<<2)
#define NVM_SECBB2R5_SEC130_B_0X1               (0x1u<<2)
#define NVM_SECBB2R5_SEC129_B_0X0               (0x0u<<1)
#define NVM_SECBB2R5_SEC129_B_0X1               (0x1u<<1)
#define NVM_SECBB2R5_SEC128_B_0X0               (0x0u<<0)
#define NVM_SECBB2R5_SEC128_B_0X1               (0x1u<<0)

// SECBB2R6 Configuration

#define NVM_SECBB2R6_SEC191                     (0x1u<<31)
#define NVM_SECBB2R6_SEC190                     (0x1u<<30)
#define NVM_SECBB2R6_SEC189                     (0x1u<<29)
#define NVM_SECBB2R6_SEC188                     (0x1u<<28)
#define NVM_SECBB2R6_SEC187                     (0x1u<<27)
#define NVM_SECBB2R6_SEC186                     (0x1u<<26)
#define NVM_SECBB2R6_SEC185                     (0x1u<<25)
#define NVM_SECBB2R6_SEC184                     (0x1u<<24)
#define NVM_SECBB2R6_SEC183                     (0x1u<<23)
#define NVM_SECBB2R6_SEC182                     (0x1u<<22)
#define NVM_SECBB2R6_SEC181                     (0x1u<<21)
#define NVM_SECBB2R6_SEC180                     (0x1u<<20)
#define NVM_SECBB2R6_SEC179                     (0x1u<<19)
#define NVM_SECBB2R6_SEC178                     (0x1u<<18)
#define NVM_SECBB2R6_SEC177                     (0x1u<<17)
#define NVM_SECBB2R6_SEC176                     (0x1u<<16)
#define NVM_SECBB2R6_SEC175                     (0x1u<<15)
#define NVM_SECBB2R6_SEC174                     (0x1u<<14)
#define NVM_SECBB2R6_SEC173                     (0x1u<<13)
#define NVM_SECBB2R6_SEC172                     (0x1u<<12)
#define NVM_SECBB2R6_SEC171                     (0x1u<<11)
#define NVM_SECBB2R6_SEC170                     (0x1u<<10)
#define NVM_SECBB2R6_SEC169                     (0x1u<<9)
#define NVM_SECBB2R6_SEC168                     (0x1u<<8)
#define NVM_SECBB2R6_SEC167                     (0x1u<<7)
#define NVM_SECBB2R6_SEC166                     (0x1u<<6)
#define NVM_SECBB2R6_SEC165                     (0x1u<<5)
#define NVM_SECBB2R6_SEC164                     (0x1u<<4)
#define NVM_SECBB2R6_SEC163                     (0x1u<<3)
#define NVM_SECBB2R6_SEC162                     (0x1u<<2)
#define NVM_SECBB2R6_SEC161                     (0x1u<<1)
#define NVM_SECBB2R6_SEC160                     (0x1u<<0)

#define NVM_SECBB2R6_SEC191_B_0X0               (0x0u<<31)
#define NVM_SECBB2R6_SEC191_B_0X1               (0x1u<<31)
#define NVM_SECBB2R6_SEC190_B_0X0               (0x0u<<30)
#define NVM_SECBB2R6_SEC190_B_0X1               (0x1u<<30)
#define NVM_SECBB2R6_SEC189_B_0X0               (0x0u<<29)
#define NVM_SECBB2R6_SEC189_B_0X1               (0x1u<<29)
#define NVM_SECBB2R6_SEC188_B_0X0               (0x0u<<28)
#define NVM_SECBB2R6_SEC188_B_0X1               (0x1u<<28)
#define NVM_SECBB2R6_SEC187_B_0X0               (0x0u<<27)
#define NVM_SECBB2R6_SEC187_B_0X1               (0x1u<<27)
#define NVM_SECBB2R6_SEC186_B_0X0               (0x0u<<26)
#define NVM_SECBB2R6_SEC186_B_0X1               (0x1u<<26)
#define NVM_SECBB2R6_SEC185_B_0X0               (0x0u<<25)
#define NVM_SECBB2R6_SEC185_B_0X1               (0x1u<<25)
#define NVM_SECBB2R6_SEC184_B_0X0               (0x0u<<24)
#define NVM_SECBB2R6_SEC184_B_0X1               (0x1u<<24)
#define NVM_SECBB2R6_SEC183_B_0X0               (0x0u<<23)
#define NVM_SECBB2R6_SEC183_B_0X1               (0x1u<<23)
#define NVM_SECBB2R6_SEC182_B_0X0               (0x0u<<22)
#define NVM_SECBB2R6_SEC182_B_0X1               (0x1u<<22)
#define NVM_SECBB2R6_SEC181_B_0X0               (0x0u<<21)
#define NVM_SECBB2R6_SEC181_B_0X1               (0x1u<<21)
#define NVM_SECBB2R6_SEC180_B_0X0               (0x0u<<20)
#define NVM_SECBB2R6_SEC180_B_0X1               (0x1u<<20)
#define NVM_SECBB2R6_SEC179_B_0X0               (0x0u<<19)
#define NVM_SECBB2R6_SEC179_B_0X1               (0x1u<<19)
#define NVM_SECBB2R6_SEC178_B_0X0               (0x0u<<18)
#define NVM_SECBB2R6_SEC178_B_0X1               (0x1u<<18)
#define NVM_SECBB2R6_SEC177_B_0X0               (0x0u<<17)
#define NVM_SECBB2R6_SEC177_B_0X1               (0x1u<<17)
#define NVM_SECBB2R6_SEC176_B_0X0               (0x0u<<16)
#define NVM_SECBB2R6_SEC176_B_0X1               (0x1u<<16)
#define NVM_SECBB2R6_SEC175_B_0X0               (0x0u<<15)
#define NVM_SECBB2R6_SEC175_B_0X1               (0x1u<<15)
#define NVM_SECBB2R6_SEC174_B_0X0               (0x0u<<14)
#define NVM_SECBB2R6_SEC174_B_0X1               (0x1u<<14)
#define NVM_SECBB2R6_SEC173_B_0X0               (0x0u<<13)
#define NVM_SECBB2R6_SEC173_B_0X1               (0x1u<<13)
#define NVM_SECBB2R6_SEC172_B_0X0               (0x0u<<12)
#define NVM_SECBB2R6_SEC172_B_0X1               (0x1u<<12)
#define NVM_SECBB2R6_SEC171_B_0X0               (0x0u<<11)
#define NVM_SECBB2R6_SEC171_B_0X1               (0x1u<<11)
#define NVM_SECBB2R6_SEC170_B_0X0               (0x0u<<10)
#define NVM_SECBB2R6_SEC170_B_0X1               (0x1u<<10)
#define NVM_SECBB2R6_SEC169_B_0X0               (0x0u<<9)
#define NVM_SECBB2R6_SEC169_B_0X1               (0x1u<<9)
#define NVM_SECBB2R6_SEC168_B_0X0               (0x0u<<8)
#define NVM_SECBB2R6_SEC168_B_0X1               (0x1u<<8)
#define NVM_SECBB2R6_SEC167_B_0X0               (0x0u<<7)
#define NVM_SECBB2R6_SEC167_B_0X1               (0x1u<<7)
#define NVM_SECBB2R6_SEC166_B_0X0               (0x0u<<6)
#define NVM_SECBB2R6_SEC166_B_0X1               (0x1u<<6)
#define NVM_SECBB2R6_SEC165_B_0X0               (0x0u<<5)
#define NVM_SECBB2R6_SEC165_B_0X1               (0x1u<<5)
#define NVM_SECBB2R6_SEC164_B_0X0               (0x0u<<4)
#define NVM_SECBB2R6_SEC164_B_0X1               (0x1u<<4)
#define NVM_SECBB2R6_SEC163_B_0X0               (0x0u<<3)
#define NVM_SECBB2R6_SEC163_B_0X1               (0x1u<<3)
#define NVM_SECBB2R6_SEC162_B_0X0               (0x0u<<2)
#define NVM_SECBB2R6_SEC162_B_0X1               (0x1u<<2)
#define NVM_SECBB2R6_SEC161_B_0X0               (0x0u<<1)
#define NVM_SECBB2R6_SEC161_B_0X1               (0x1u<<1)
#define NVM_SECBB2R6_SEC160_B_0X0               (0x0u<<0)
#define NVM_SECBB2R6_SEC160_B_0X1               (0x1u<<0)

// SECBB2R7 Configuration

#define NVM_SECBB2R7_SEC223                     (0x1u<<31)
#define NVM_SECBB2R7_SEC222                     (0x1u<<30)
#define NVM_SECBB2R7_SEC221                     (0x1u<<29)
#define NVM_SECBB2R7_SEC220                     (0x1u<<28)
#define NVM_SECBB2R7_SEC219                     (0x1u<<27)
#define NVM_SECBB2R7_SEC218                     (0x1u<<26)
#define NVM_SECBB2R7_SEC217                     (0x1u<<25)
#define NVM_SECBB2R7_SEC216                     (0x1u<<24)
#define NVM_SECBB2R7_SEC215                     (0x1u<<23)
#define NVM_SECBB2R7_SEC214                     (0x1u<<22)
#define NVM_SECBB2R7_SEC213                     (0x1u<<21)
#define NVM_SECBB2R7_SEC212                     (0x1u<<20)
#define NVM_SECBB2R7_SEC211                     (0x1u<<19)
#define NVM_SECBB2R7_SEC210                     (0x1u<<18)
#define NVM_SECBB2R7_SEC209                     (0x1u<<17)
#define NVM_SECBB2R7_SEC208                     (0x1u<<16)
#define NVM_SECBB2R7_SEC207                     (0x1u<<15)
#define NVM_SECBB2R7_SEC206                     (0x1u<<14)
#define NVM_SECBB2R7_SEC205                     (0x1u<<13)
#define NVM_SECBB2R7_SEC204                     (0x1u<<12)
#define NVM_SECBB2R7_SEC203                     (0x1u<<11)
#define NVM_SECBB2R7_SEC202                     (0x1u<<10)
#define NVM_SECBB2R7_SEC201                     (0x1u<<9)
#define NVM_SECBB2R7_SEC200                     (0x1u<<8)
#define NVM_SECBB2R7_SEC199                     (0x1u<<7)
#define NVM_SECBB2R7_SEC198                     (0x1u<<6)
#define NVM_SECBB2R7_SEC197                     (0x1u<<5)
#define NVM_SECBB2R7_SEC196                     (0x1u<<4)
#define NVM_SECBB2R7_SEC195                     (0x1u<<3)
#define NVM_SECBB2R7_SEC194                     (0x1u<<2)
#define NVM_SECBB2R7_SEC193                     (0x1u<<1)
#define NVM_SECBB2R7_SEC192                     (0x1u<<0)

