Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_nvm.h
// PRIVBB2R2 Configuration

#define NVM_PRIVBB2R2_PRIV63                    (0x1u<<31)
#define NVM_PRIVBB2R2_PRIV62                    (0x1u<<30)
#define NVM_PRIVBB2R2_PRIV61                    (0x1u<<29)
#define NVM_PRIVBB2R2_PRIV60                    (0x1u<<28)
#define NVM_PRIVBB2R2_PRIV59                    (0x1u<<27)
#define NVM_PRIVBB2R2_PRIV58                    (0x1u<<26)
#define NVM_PRIVBB2R2_PRIV57                    (0x1u<<25)
#define NVM_PRIVBB2R2_PRIV56                    (0x1u<<24)
#define NVM_PRIVBB2R2_PRIV55                    (0x1u<<23)
#define NVM_PRIVBB2R2_PRIV54                    (0x1u<<22)
#define NVM_PRIVBB2R2_PRIV53                    (0x1u<<21)
#define NVM_PRIVBB2R2_PRIV52                    (0x1u<<20)
#define NVM_PRIVBB2R2_PRIV51                    (0x1u<<19)
#define NVM_PRIVBB2R2_PRIV50                    (0x1u<<18)
#define NVM_PRIVBB2R2_PRIV49                    (0x1u<<17)
#define NVM_PRIVBB2R2_PRIV48                    (0x1u<<16)
#define NVM_PRIVBB2R2_PRIV47                    (0x1u<<15)
#define NVM_PRIVBB2R2_PRIV46                    (0x1u<<14)
#define NVM_PRIVBB2R2_PRIV45                    (0x1u<<13)
#define NVM_PRIVBB2R2_PRIV44                    (0x1u<<12)
#define NVM_PRIVBB2R2_PRIV43                    (0x1u<<11)
#define NVM_PRIVBB2R2_PRIV42                    (0x1u<<10)
#define NVM_PRIVBB2R2_PRIV41                    (0x1u<<9)
#define NVM_PRIVBB2R2_PRIV40                    (0x1u<<8)
#define NVM_PRIVBB2R2_PRIV39                    (0x1u<<7)
#define NVM_PRIVBB2R2_PRIV38                    (0x1u<<6)
#define NVM_PRIVBB2R2_PRIV37                    (0x1u<<5)
#define NVM_PRIVBB2R2_PRIV36                    (0x1u<<4)
#define NVM_PRIVBB2R2_PRIV35                    (0x1u<<3)
#define NVM_PRIVBB2R2_PRIV34                    (0x1u<<2)
#define NVM_PRIVBB2R2_PRIV33                    (0x1u<<1)
#define NVM_PRIVBB2R2_PRIV32                    (0x1u<<0)

#define NVM_PRIVBB2R2_PRIV63_B_0X0              (0x0u<<31)
#define NVM_PRIVBB2R2_PRIV63_B_0X1              (0x1u<<31)
#define NVM_PRIVBB2R2_PRIV62_B_0X0              (0x0u<<30)
#define NVM_PRIVBB2R2_PRIV62_B_0X1              (0x1u<<30)
#define NVM_PRIVBB2R2_PRIV61_B_0X0              (0x0u<<29)
#define NVM_PRIVBB2R2_PRIV61_B_0X1              (0x1u<<29)
#define NVM_PRIVBB2R2_PRIV60_B_0X0              (0x0u<<28)
#define NVM_PRIVBB2R2_PRIV60_B_0X1              (0x1u<<28)
#define NVM_PRIVBB2R2_PRIV59_B_0X0              (0x0u<<27)
#define NVM_PRIVBB2R2_PRIV59_B_0X1              (0x1u<<27)
#define NVM_PRIVBB2R2_PRIV58_B_0X0              (0x0u<<26)
#define NVM_PRIVBB2R2_PRIV58_B_0X1              (0x1u<<26)
#define NVM_PRIVBB2R2_PRIV57_B_0X0              (0x0u<<25)
#define NVM_PRIVBB2R2_PRIV57_B_0X1              (0x1u<<25)
#define NVM_PRIVBB2R2_PRIV56_B_0X0              (0x0u<<24)
#define NVM_PRIVBB2R2_PRIV56_B_0X1              (0x1u<<24)
#define NVM_PRIVBB2R2_PRIV55_B_0X0              (0x0u<<23)
#define NVM_PRIVBB2R2_PRIV55_B_0X1              (0x1u<<23)
#define NVM_PRIVBB2R2_PRIV54_B_0X0              (0x0u<<22)
#define NVM_PRIVBB2R2_PRIV54_B_0X1              (0x1u<<22)
#define NVM_PRIVBB2R2_PRIV53_B_0X0              (0x0u<<21)
#define NVM_PRIVBB2R2_PRIV53_B_0X1              (0x1u<<21)
#define NVM_PRIVBB2R2_PRIV52_B_0X0              (0x0u<<20)
#define NVM_PRIVBB2R2_PRIV52_B_0X1              (0x1u<<20)
#define NVM_PRIVBB2R2_PRIV51_B_0X0              (0x0u<<19)
#define NVM_PRIVBB2R2_PRIV51_B_0X1              (0x1u<<19)
#define NVM_PRIVBB2R2_PRIV50_B_0X0              (0x0u<<18)
#define NVM_PRIVBB2R2_PRIV50_B_0X1              (0x1u<<18)
#define NVM_PRIVBB2R2_PRIV49_B_0X0              (0x0u<<17)
#define NVM_PRIVBB2R2_PRIV49_B_0X1              (0x1u<<17)
#define NVM_PRIVBB2R2_PRIV48_B_0X0              (0x0u<<16)
#define NVM_PRIVBB2R2_PRIV48_B_0X1              (0x1u<<16)
#define NVM_PRIVBB2R2_PRIV47_B_0X0              (0x0u<<15)
#define NVM_PRIVBB2R2_PRIV47_B_0X1              (0x1u<<15)
#define NVM_PRIVBB2R2_PRIV46_B_0X0              (0x0u<<14)
#define NVM_PRIVBB2R2_PRIV46_B_0X1              (0x1u<<14)
#define NVM_PRIVBB2R2_PRIV45_B_0X0              (0x0u<<13)
#define NVM_PRIVBB2R2_PRIV45_B_0X1              (0x1u<<13)
#define NVM_PRIVBB2R2_PRIV44_B_0X0              (0x0u<<12)
#define NVM_PRIVBB2R2_PRIV44_B_0X1              (0x1u<<12)
#define NVM_PRIVBB2R2_PRIV43_B_0X0              (0x0u<<11)
#define NVM_PRIVBB2R2_PRIV43_B_0X1              (0x1u<<11)
#define NVM_PRIVBB2R2_PRIV42_B_0X0              (0x0u<<10)
#define NVM_PRIVBB2R2_PRIV42_B_0X1              (0x1u<<10)
#define NVM_PRIVBB2R2_PRIV41_B_0X0              (0x0u<<9)
#define NVM_PRIVBB2R2_PRIV41_B_0X1              (0x1u<<9)
#define NVM_PRIVBB2R2_PRIV40_B_0X0              (0x0u<<8)
#define NVM_PRIVBB2R2_PRIV40_B_0X1              (0x1u<<8)
#define NVM_PRIVBB2R2_PRIV39_B_0X0              (0x0u<<7)
#define NVM_PRIVBB2R2_PRIV39_B_0X1              (0x1u<<7)
#define NVM_PRIVBB2R2_PRIV38_B_0X0              (0x0u<<6)
#define NVM_PRIVBB2R2_PRIV38_B_0X1              (0x1u<<6)
#define NVM_PRIVBB2R2_PRIV37_B_0X0              (0x0u<<5)
#define NVM_PRIVBB2R2_PRIV37_B_0X1              (0x1u<<5)
#define NVM_PRIVBB2R2_PRIV36_B_0X0              (0x0u<<4)
#define NVM_PRIVBB2R2_PRIV36_B_0X1              (0x1u<<4)
#define NVM_PRIVBB2R2_PRIV35_B_0X0              (0x0u<<3)
#define NVM_PRIVBB2R2_PRIV35_B_0X1              (0x1u<<3)
#define NVM_PRIVBB2R2_PRIV34_B_0X0              (0x0u<<2)
#define NVM_PRIVBB2R2_PRIV34_B_0X1              (0x1u<<2)
#define NVM_PRIVBB2R2_PRIV33_B_0X0              (0x0u<<1)
#define NVM_PRIVBB2R2_PRIV33_B_0X1              (0x1u<<1)
#define NVM_PRIVBB2R2_PRIV32_B_0X0              (0x0u<<0)
#define NVM_PRIVBB2R2_PRIV32_B_0X1              (0x1u<<0)

// PRIVBB2R3 Configuration

#define NVM_PRIVBB2R3_PRIV95                    (0x1u<<31)
#define NVM_PRIVBB2R3_PRIV94                    (0x1u<<30)
#define NVM_PRIVBB2R3_PRIV93                    (0x1u<<29)
#define NVM_PRIVBB2R3_PRIV92                    (0x1u<<28)
#define NVM_PRIVBB2R3_PRIV91                    (0x1u<<27)
#define NVM_PRIVBB2R3_PRIV90                    (0x1u<<26)
#define NVM_PRIVBB2R3_PRIV89                    (0x1u<<25)
#define NVM_PRIVBB2R3_PRIV88                    (0x1u<<24)
#define NVM_PRIVBB2R3_PRIV87                    (0x1u<<23)
#define NVM_PRIVBB2R3_PRIV86                    (0x1u<<22)
#define NVM_PRIVBB2R3_PRIV85                    (0x1u<<21)
#define NVM_PRIVBB2R3_PRIV84                    (0x1u<<20)
#define NVM_PRIVBB2R3_PRIV83                    (0x1u<<19)
#define NVM_PRIVBB2R3_PRIV82                    (0x1u<<18)
#define NVM_PRIVBB2R3_PRIV81                    (0x1u<<17)
#define NVM_PRIVBB2R3_PRIV80                    (0x1u<<16)
#define NVM_PRIVBB2R3_PRIV79                    (0x1u<<15)
#define NVM_PRIVBB2R3_PRIV78                    (0x1u<<14)
#define NVM_PRIVBB2R3_PRIV77                    (0x1u<<13)
#define NVM_PRIVBB2R3_PRIV76                    (0x1u<<12)
#define NVM_PRIVBB2R3_PRIV75                    (0x1u<<11)
#define NVM_PRIVBB2R3_PRIV74                    (0x1u<<10)
#define NVM_PRIVBB2R3_PRIV73                    (0x1u<<9)
#define NVM_PRIVBB2R3_PRIV72                    (0x1u<<8)
#define NVM_PRIVBB2R3_PRIV71                    (0x1u<<7)
#define NVM_PRIVBB2R3_PRIV70                    (0x1u<<6)
#define NVM_PRIVBB2R3_PRIV69                    (0x1u<<5)
#define NVM_PRIVBB2R3_PRIV68                    (0x1u<<4)
#define NVM_PRIVBB2R3_PRIV67                    (0x1u<<3)
#define NVM_PRIVBB2R3_PRIV66                    (0x1u<<2)
#define NVM_PRIVBB2R3_PRIV65                    (0x1u<<1)
#define NVM_PRIVBB2R3_PRIV64                    (0x1u<<0)

#define NVM_PRIVBB2R3_PRIV95_B_0X0              (0x0u<<31)
#define NVM_PRIVBB2R3_PRIV95_B_0X1              (0x1u<<31)
#define NVM_PRIVBB2R3_PRIV94_B_0X0              (0x0u<<30)
#define NVM_PRIVBB2R3_PRIV94_B_0X1              (0x1u<<30)
#define NVM_PRIVBB2R3_PRIV93_B_0X0              (0x0u<<29)
#define NVM_PRIVBB2R3_PRIV93_B_0X1              (0x1u<<29)
#define NVM_PRIVBB2R3_PRIV92_B_0X0              (0x0u<<28)
#define NVM_PRIVBB2R3_PRIV92_B_0X1              (0x1u<<28)
#define NVM_PRIVBB2R3_PRIV91_B_0X0              (0x0u<<27)
#define NVM_PRIVBB2R3_PRIV91_B_0X1              (0x1u<<27)
#define NVM_PRIVBB2R3_PRIV90_B_0X0              (0x0u<<26)
#define NVM_PRIVBB2R3_PRIV90_B_0X1              (0x1u<<26)
#define NVM_PRIVBB2R3_PRIV89_B_0X0              (0x0u<<25)
#define NVM_PRIVBB2R3_PRIV89_B_0X1              (0x1u<<25)
#define NVM_PRIVBB2R3_PRIV88_B_0X0              (0x0u<<24)
#define NVM_PRIVBB2R3_PRIV88_B_0X1              (0x1u<<24)
#define NVM_PRIVBB2R3_PRIV87_B_0X0              (0x0u<<23)
#define NVM_PRIVBB2R3_PRIV87_B_0X1              (0x1u<<23)
#define NVM_PRIVBB2R3_PRIV86_B_0X0              (0x0u<<22)
#define NVM_PRIVBB2R3_PRIV86_B_0X1              (0x1u<<22)
#define NVM_PRIVBB2R3_PRIV85_B_0X0              (0x0u<<21)
#define NVM_PRIVBB2R3_PRIV85_B_0X1              (0x1u<<21)
#define NVM_PRIVBB2R3_PRIV84_B_0X0              (0x0u<<20)
#define NVM_PRIVBB2R3_PRIV84_B_0X1              (0x1u<<20)
#define NVM_PRIVBB2R3_PRIV83_B_0X0              (0x0u<<19)
#define NVM_PRIVBB2R3_PRIV83_B_0X1              (0x1u<<19)
#define NVM_PRIVBB2R3_PRIV82_B_0X0              (0x0u<<18)
#define NVM_PRIVBB2R3_PRIV82_B_0X1              (0x1u<<18)
#define NVM_PRIVBB2R3_PRIV81_B_0X0              (0x0u<<17)
#define NVM_PRIVBB2R3_PRIV81_B_0X1              (0x1u<<17)
#define NVM_PRIVBB2R3_PRIV80_B_0X0              (0x0u<<16)
#define NVM_PRIVBB2R3_PRIV80_B_0X1              (0x1u<<16)
#define NVM_PRIVBB2R3_PRIV79_B_0X0              (0x0u<<15)
#define NVM_PRIVBB2R3_PRIV79_B_0X1              (0x1u<<15)
#define NVM_PRIVBB2R3_PRIV78_B_0X0              (0x0u<<14)
#define NVM_PRIVBB2R3_PRIV78_B_0X1              (0x1u<<14)
#define NVM_PRIVBB2R3_PRIV77_B_0X0              (0x0u<<13)
#define NVM_PRIVBB2R3_PRIV77_B_0X1              (0x1u<<13)
#define NVM_PRIVBB2R3_PRIV76_B_0X0              (0x0u<<12)
#define NVM_PRIVBB2R3_PRIV76_B_0X1              (0x1u<<12)
#define NVM_PRIVBB2R3_PRIV75_B_0X0              (0x0u<<11)
#define NVM_PRIVBB2R3_PRIV75_B_0X1              (0x1u<<11)
#define NVM_PRIVBB2R3_PRIV74_B_0X0              (0x0u<<10)
#define NVM_PRIVBB2R3_PRIV74_B_0X1              (0x1u<<10)
#define NVM_PRIVBB2R3_PRIV73_B_0X0              (0x0u<<9)
#define NVM_PRIVBB2R3_PRIV73_B_0X1              (0x1u<<9)
#define NVM_PRIVBB2R3_PRIV72_B_0X0              (0x0u<<8)
#define NVM_PRIVBB2R3_PRIV72_B_0X1              (0x1u<<8)
#define NVM_PRIVBB2R3_PRIV71_B_0X0              (0x0u<<7)
#define NVM_PRIVBB2R3_PRIV71_B_0X1              (0x1u<<7)
#define NVM_PRIVBB2R3_PRIV70_B_0X0              (0x0u<<6)
#define NVM_PRIVBB2R3_PRIV70_B_0X1              (0x1u<<6)
#define NVM_PRIVBB2R3_PRIV69_B_0X0              (0x0u<<5)
#define NVM_PRIVBB2R3_PRIV69_B_0X1              (0x1u<<5)
#define NVM_PRIVBB2R3_PRIV68_B_0X0              (0x0u<<4)
#define NVM_PRIVBB2R3_PRIV68_B_0X1              (0x1u<<4)
#define NVM_PRIVBB2R3_PRIV67_B_0X0              (0x0u<<3)
#define NVM_PRIVBB2R3_PRIV67_B_0X1              (0x1u<<3)
#define NVM_PRIVBB2R3_PRIV66_B_0X0              (0x0u<<2)
#define NVM_PRIVBB2R3_PRIV66_B_0X1              (0x1u<<2)
#define NVM_PRIVBB2R3_PRIV65_B_0X0              (0x0u<<1)
#define NVM_PRIVBB2R3_PRIV65_B_0X1              (0x1u<<1)
#define NVM_PRIVBB2R3_PRIV64_B_0X0              (0x0u<<0)
#define NVM_PRIVBB2R3_PRIV64_B_0X1              (0x1u<<0)

// PRIVBB2R4 Configuration

#define NVM_PRIVBB2R4_PRIV127                   (0x1u<<31)
#define NVM_PRIVBB2R4_PRIV126                   (0x1u<<30)
#define NVM_PRIVBB2R4_PRIV125                   (0x1u<<29)
#define NVM_PRIVBB2R4_PRIV124                   (0x1u<<28)
#define NVM_PRIVBB2R4_PRIV123                   (0x1u<<27)
#define NVM_PRIVBB2R4_PRIV122                   (0x1u<<26)
#define NVM_PRIVBB2R4_PRIV121                   (0x1u<<25)
#define NVM_PRIVBB2R4_PRIV120                   (0x1u<<24)
#define NVM_PRIVBB2R4_PRIV119                   (0x1u<<23)
#define NVM_PRIVBB2R4_PRIV118                   (0x1u<<22)
#define NVM_PRIVBB2R4_PRIV117                   (0x1u<<21)
#define NVM_PRIVBB2R4_PRIV116                   (0x1u<<20)
#define NVM_PRIVBB2R4_PRIV115                   (0x1u<<19)
#define NVM_PRIVBB2R4_PRIV114                   (0x1u<<18)
#define NVM_PRIVBB2R4_PRIV113                   (0x1u<<17)
#define NVM_PRIVBB2R4_PRIV112                   (0x1u<<16)
#define NVM_PRIVBB2R4_PRIV111                   (0x1u<<15)
#define NVM_PRIVBB2R4_PRIV110                   (0x1u<<14)
#define NVM_PRIVBB2R4_PRIV109                   (0x1u<<13)
#define NVM_PRIVBB2R4_PRIV108                   (0x1u<<12)
#define NVM_PRIVBB2R4_PRIV107                   (0x1u<<11)
#define NVM_PRIVBB2R4_PRIV106                   (0x1u<<10)
#define NVM_PRIVBB2R4_PRIV105                   (0x1u<<9)
#define NVM_PRIVBB2R4_PRIV104                   (0x1u<<8)
#define NVM_PRIVBB2R4_PRIV103                   (0x1u<<7)
#define NVM_PRIVBB2R4_PRIV102                   (0x1u<<6)
#define NVM_PRIVBB2R4_PRIV101                   (0x1u<<5)
#define NVM_PRIVBB2R4_PRIV100                   (0x1u<<4)
#define NVM_PRIVBB2R4_PRIV99                    (0x1u<<3)
#define NVM_PRIVBB2R4_PRIV98                    (0x1u<<2)
#define NVM_PRIVBB2R4_PRIV97                    (0x1u<<1)
#define NVM_PRIVBB2R4_PRIV96                    (0x1u<<0)

