Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_nvm.h
// HDP2R_CUR Configuration

#define NVM_HDP2R_CUR_END                       (0xFFu<<16)
#define NVM_HDP2R_CUR_END_0                     (0x1u<<16)
#define NVM_HDP2R_CUR_STRT                      (0xFFu<<0)
#define NVM_HDP2R_CUR_STRT_0                    (0x1u<<0)

// HDP2R_PRG Configuration

#define NVM_HDP2R_PRG_END                       (0xFFu<<16)
#define NVM_HDP2R_PRG_END_0                     (0x1u<<16)
#define NVM_HDP2R_PRG_STRT                      (0xFFu<<0)
#define NVM_HDP2R_PRG_STRT_0                    (0x1u<<0)

// WRP2R1_CUR Configuration

#define NVM_WRP2R1_CUR_SGN31                    (0x1u<<31)
#define NVM_WRP2R1_CUR_SGN30                    (0x1u<<30)
#define NVM_WRP2R1_CUR_SGN29                    (0x1u<<29)
#define NVM_WRP2R1_CUR_SGN28                    (0x1u<<28)
#define NVM_WRP2R1_CUR_SGN27                    (0x1u<<27)
#define NVM_WRP2R1_CUR_SGN26                    (0x1u<<26)
#define NVM_WRP2R1_CUR_SGN25                    (0x1u<<25)
#define NVM_WRP2R1_CUR_SGN24                    (0x1u<<24)
#define NVM_WRP2R1_CUR_SGN23                    (0x1u<<23)
#define NVM_WRP2R1_CUR_SGN22                    (0x1u<<22)
#define NVM_WRP2R1_CUR_SGN21                    (0x1u<<21)
#define NVM_WRP2R1_CUR_SGN20                    (0x1u<<20)
#define NVM_WRP2R1_CUR_SGN19                    (0x1u<<19)
#define NVM_WRP2R1_CUR_SGN18                    (0x1u<<18)
#define NVM_WRP2R1_CUR_SGN17                    (0x1u<<17)
#define NVM_WRP2R1_CUR_SGN16                    (0x1u<<16)
#define NVM_WRP2R1_CUR_SGN15                    (0x1u<<15)
#define NVM_WRP2R1_CUR_SGN14                    (0x1u<<14)
#define NVM_WRP2R1_CUR_SGN13                    (0x1u<<13)
#define NVM_WRP2R1_CUR_SGN12                    (0x1u<<12)
#define NVM_WRP2R1_CUR_SGN11                    (0x1u<<11)
#define NVM_WRP2R1_CUR_SGN10                    (0x1u<<10)
#define NVM_WRP2R1_CUR_SGN9                     (0x1u<<9)
#define NVM_WRP2R1_CUR_SGN8                     (0x1u<<8)
#define NVM_WRP2R1_CUR_SGN7                     (0x1u<<7)
#define NVM_WRP2R1_CUR_SGN6                     (0x1u<<6)
#define NVM_WRP2R1_CUR_SGN5                     (0x1u<<5)
#define NVM_WRP2R1_CUR_SGN4                     (0x1u<<4)
#define NVM_WRP2R1_CUR_SGN3                     (0x1u<<3)
#define NVM_WRP2R1_CUR_SGN2                     (0x1u<<2)
#define NVM_WRP2R1_CUR_SGN1                     (0x1u<<1)
#define NVM_WRP2R1_CUR_SGN0                     (0x1u<<0)

#define NVM_WRP2R1_CUR_SGN31_B_0X0              (0x0u<<31)
#define NVM_WRP2R1_CUR_SGN31_B_0X1              (0x1u<<31)
#define NVM_WRP2R1_CUR_SGN30_B_0X0              (0x0u<<30)
#define NVM_WRP2R1_CUR_SGN30_B_0X1              (0x1u<<30)
#define NVM_WRP2R1_CUR_SGN29_B_0X0              (0x0u<<29)
#define NVM_WRP2R1_CUR_SGN29_B_0X1              (0x1u<<29)
#define NVM_WRP2R1_CUR_SGN28_B_0X0              (0x0u<<28)
#define NVM_WRP2R1_CUR_SGN28_B_0X1              (0x1u<<28)
#define NVM_WRP2R1_CUR_SGN27_B_0X0              (0x0u<<27)
#define NVM_WRP2R1_CUR_SGN27_B_0X1              (0x1u<<27)
#define NVM_WRP2R1_CUR_SGN26_B_0X0              (0x0u<<26)
#define NVM_WRP2R1_CUR_SGN26_B_0X1              (0x1u<<26)
#define NVM_WRP2R1_CUR_SGN25_B_0X0              (0x0u<<25)
#define NVM_WRP2R1_CUR_SGN25_B_0X1              (0x1u<<25)
#define NVM_WRP2R1_CUR_SGN24_B_0X0              (0x0u<<24)
#define NVM_WRP2R1_CUR_SGN24_B_0X1              (0x1u<<24)
#define NVM_WRP2R1_CUR_SGN23_B_0X0              (0x0u<<23)
#define NVM_WRP2R1_CUR_SGN23_B_0X1              (0x1u<<23)
#define NVM_WRP2R1_CUR_SGN22_B_0X0              (0x0u<<22)
#define NVM_WRP2R1_CUR_SGN22_B_0X1              (0x1u<<22)
#define NVM_WRP2R1_CUR_SGN21_B_0X0              (0x0u<<21)
#define NVM_WRP2R1_CUR_SGN21_B_0X1              (0x1u<<21)
#define NVM_WRP2R1_CUR_SGN20_B_0X0              (0x0u<<20)
#define NVM_WRP2R1_CUR_SGN20_B_0X1              (0x1u<<20)
#define NVM_WRP2R1_CUR_SGN19_B_0X0              (0x0u<<19)
#define NVM_WRP2R1_CUR_SGN19_B_0X1              (0x1u<<19)
#define NVM_WRP2R1_CUR_SGN18_B_0X0              (0x0u<<18)
#define NVM_WRP2R1_CUR_SGN18_B_0X1              (0x1u<<18)
#define NVM_WRP2R1_CUR_SGN17_B_0X0              (0x0u<<17)
#define NVM_WRP2R1_CUR_SGN17_B_0X1              (0x1u<<17)
#define NVM_WRP2R1_CUR_SGN16_B_0X0              (0x0u<<16)
#define NVM_WRP2R1_CUR_SGN16_B_0X1              (0x1u<<16)
#define NVM_WRP2R1_CUR_SGN15_B_0X0              (0x0u<<15)
#define NVM_WRP2R1_CUR_SGN15_B_0X1              (0x1u<<15)
#define NVM_WRP2R1_CUR_SGN14_B_0X0              (0x0u<<14)
#define NVM_WRP2R1_CUR_SGN14_B_0X1              (0x1u<<14)
#define NVM_WRP2R1_CUR_SGN13_B_0X0              (0x0u<<13)
#define NVM_WRP2R1_CUR_SGN13_B_0X1              (0x1u<<13)
#define NVM_WRP2R1_CUR_SGN12_B_0X0              (0x0u<<12)
#define NVM_WRP2R1_CUR_SGN12_B_0X1              (0x1u<<12)
#define NVM_WRP2R1_CUR_SGN11_B_0X0              (0x0u<<11)
#define NVM_WRP2R1_CUR_SGN11_B_0X1              (0x1u<<11)
#define NVM_WRP2R1_CUR_SGN10_B_0X0              (0x0u<<10)
#define NVM_WRP2R1_CUR_SGN10_B_0X1              (0x1u<<10)
#define NVM_WRP2R1_CUR_SGN9_B_0X0               (0x0u<<9)
#define NVM_WRP2R1_CUR_SGN9_B_0X1               (0x1u<<9)
#define NVM_WRP2R1_CUR_SGN8_B_0X0               (0x0u<<8)
#define NVM_WRP2R1_CUR_SGN8_B_0X1               (0x1u<<8)
#define NVM_WRP2R1_CUR_SGN7_B_0X0               (0x0u<<7)
#define NVM_WRP2R1_CUR_SGN7_B_0X1               (0x1u<<7)
#define NVM_WRP2R1_CUR_SGN6_B_0X0               (0x0u<<6)
#define NVM_WRP2R1_CUR_SGN6_B_0X1               (0x1u<<6)
#define NVM_WRP2R1_CUR_SGN5_B_0X0               (0x0u<<5)
#define NVM_WRP2R1_CUR_SGN5_B_0X1               (0x1u<<5)
#define NVM_WRP2R1_CUR_SGN4_B_0X0               (0x0u<<4)
#define NVM_WRP2R1_CUR_SGN4_B_0X1               (0x1u<<4)
#define NVM_WRP2R1_CUR_SGN3_B_0X0               (0x0u<<3)
#define NVM_WRP2R1_CUR_SGN3_B_0X1               (0x1u<<3)
#define NVM_WRP2R1_CUR_SGN2_B_0X0               (0x0u<<2)
#define NVM_WRP2R1_CUR_SGN2_B_0X1               (0x1u<<2)
#define NVM_WRP2R1_CUR_SGN1_B_0X0               (0x0u<<1)
#define NVM_WRP2R1_CUR_SGN1_B_0X1               (0x1u<<1)
#define NVM_WRP2R1_CUR_SGN0_B_0X0               (0x0u<<0)
#define NVM_WRP2R1_CUR_SGN0_B_0X1               (0x1u<<0)

// WRP2R1_PRG Configuration

#define NVM_WRP2R1_PRG_SGN31                    (0x1u<<31)
#define NVM_WRP2R1_PRG_SGN30                    (0x1u<<30)
#define NVM_WRP2R1_PRG_SGN29                    (0x1u<<29)
#define NVM_WRP2R1_PRG_SGN28                    (0x1u<<28)
#define NVM_WRP2R1_PRG_SGN27                    (0x1u<<27)
#define NVM_WRP2R1_PRG_SGN26                    (0x1u<<26)
#define NVM_WRP2R1_PRG_SGN25                    (0x1u<<25)
#define NVM_WRP2R1_PRG_SGN24                    (0x1u<<24)
#define NVM_WRP2R1_PRG_SGN23                    (0x1u<<23)
#define NVM_WRP2R1_PRG_SGN22                    (0x1u<<22)
#define NVM_WRP2R1_PRG_SGN21                    (0x1u<<21)
#define NVM_WRP2R1_PRG_SGN20                    (0x1u<<20)
#define NVM_WRP2R1_PRG_SGN19                    (0x1u<<19)
#define NVM_WRP2R1_PRG_SGN18                    (0x1u<<18)
#define NVM_WRP2R1_PRG_SGN17                    (0x1u<<17)
#define NVM_WRP2R1_PRG_SGN16                    (0x1u<<16)
#define NVM_WRP2R1_PRG_SGN15                    (0x1u<<15)
#define NVM_WRP2R1_PRG_SGN14                    (0x1u<<14)
#define NVM_WRP2R1_PRG_SGN13                    (0x1u<<13)
#define NVM_WRP2R1_PRG_SGN12                    (0x1u<<12)
#define NVM_WRP2R1_PRG_SGN11                    (0x1u<<11)
#define NVM_WRP2R1_PRG_SGN10                    (0x1u<<10)
#define NVM_WRP2R1_PRG_SGN9                     (0x1u<<9)
#define NVM_WRP2R1_PRG_SGN8                     (0x1u<<8)
#define NVM_WRP2R1_PRG_SGN7                     (0x1u<<7)
#define NVM_WRP2R1_PRG_SGN6                     (0x1u<<6)
#define NVM_WRP2R1_PRG_SGN5                     (0x1u<<5)
#define NVM_WRP2R1_PRG_SGN4                     (0x1u<<4)
#define NVM_WRP2R1_PRG_SGN3                     (0x1u<<3)
#define NVM_WRP2R1_PRG_SGN2                     (0x1u<<2)
#define NVM_WRP2R1_PRG_SGN1                     (0x1u<<1)
#define NVM_WRP2R1_PRG_SGN0                     (0x1u<<0)

#define NVM_WRP2R1_PRG_SGN31_B_0X0              (0x0u<<31)
#define NVM_WRP2R1_PRG_SGN31_B_0X1              (0x1u<<31)
#define NVM_WRP2R1_PRG_SGN30_B_0X0              (0x0u<<30)
#define NVM_WRP2R1_PRG_SGN30_B_0X1              (0x1u<<30)
#define NVM_WRP2R1_PRG_SGN29_B_0X0              (0x0u<<29)
#define NVM_WRP2R1_PRG_SGN29_B_0X1              (0x1u<<29)
#define NVM_WRP2R1_PRG_SGN28_B_0X0              (0x0u<<28)
#define NVM_WRP2R1_PRG_SGN28_B_0X1              (0x1u<<28)
#define NVM_WRP2R1_PRG_SGN27_B_0X0              (0x0u<<27)
#define NVM_WRP2R1_PRG_SGN27_B_0X1              (0x1u<<27)
#define NVM_WRP2R1_PRG_SGN26_B_0X0              (0x0u<<26)
#define NVM_WRP2R1_PRG_SGN26_B_0X1              (0x1u<<26)
#define NVM_WRP2R1_PRG_SGN25_B_0X0              (0x0u<<25)
#define NVM_WRP2R1_PRG_SGN25_B_0X1              (0x1u<<25)
#define NVM_WRP2R1_PRG_SGN24_B_0X0              (0x0u<<24)
#define NVM_WRP2R1_PRG_SGN24_B_0X1              (0x1u<<24)
#define NVM_WRP2R1_PRG_SGN23_B_0X0              (0x0u<<23)
#define NVM_WRP2R1_PRG_SGN23_B_0X1              (0x1u<<23)
#define NVM_WRP2R1_PRG_SGN22_B_0X0              (0x0u<<22)
#define NVM_WRP2R1_PRG_SGN22_B_0X1              (0x1u<<22)
#define NVM_WRP2R1_PRG_SGN21_B_0X0              (0x0u<<21)
#define NVM_WRP2R1_PRG_SGN21_B_0X1              (0x1u<<21)
#define NVM_WRP2R1_PRG_SGN20_B_0X0              (0x0u<<20)
#define NVM_WRP2R1_PRG_SGN20_B_0X1              (0x1u<<20)
#define NVM_WRP2R1_PRG_SGN19_B_0X0              (0x0u<<19)
#define NVM_WRP2R1_PRG_SGN19_B_0X1              (0x1u<<19)
#define NVM_WRP2R1_PRG_SGN18_B_0X0              (0x0u<<18)
#define NVM_WRP2R1_PRG_SGN18_B_0X1              (0x1u<<18)
#define NVM_WRP2R1_PRG_SGN17_B_0X0              (0x0u<<17)
#define NVM_WRP2R1_PRG_SGN17_B_0X1              (0x1u<<17)
#define NVM_WRP2R1_PRG_SGN16_B_0X0              (0x0u<<16)
#define NVM_WRP2R1_PRG_SGN16_B_0X1              (0x1u<<16)
#define NVM_WRP2R1_PRG_SGN15_B_0X0              (0x0u<<15)
#define NVM_WRP2R1_PRG_SGN15_B_0X1              (0x1u<<15)
#define NVM_WRP2R1_PRG_SGN14_B_0X0              (0x0u<<14)
#define NVM_WRP2R1_PRG_SGN14_B_0X1              (0x1u<<14)
#define NVM_WRP2R1_PRG_SGN13_B_0X0              (0x0u<<13)
#define NVM_WRP2R1_PRG_SGN13_B_0X1              (0x1u<<13)
#define NVM_WRP2R1_PRG_SGN12_B_0X0              (0x0u<<12)
#define NVM_WRP2R1_PRG_SGN12_B_0X1              (0x1u<<12)
#define NVM_WRP2R1_PRG_SGN11_B_0X0              (0x0u<<11)
#define NVM_WRP2R1_PRG_SGN11_B_0X1              (0x1u<<11)
#define NVM_WRP2R1_PRG_SGN10_B_0X0              (0x0u<<10)
#define NVM_WRP2R1_PRG_SGN10_B_0X1              (0x1u<<10)
#define NVM_WRP2R1_PRG_SGN9_B_0X0               (0x0u<<9)
#define NVM_WRP2R1_PRG_SGN9_B_0X1               (0x1u<<9)
#define NVM_WRP2R1_PRG_SGN8_B_0X0               (0x0u<<8)
#define NVM_WRP2R1_PRG_SGN8_B_0X1               (0x1u<<8)
#define NVM_WRP2R1_PRG_SGN7_B_0X0               (0x0u<<7)
#define NVM_WRP2R1_PRG_SGN7_B_0X1               (0x1u<<7)
#define NVM_WRP2R1_PRG_SGN6_B_0X0               (0x0u<<6)
#define NVM_WRP2R1_PRG_SGN6_B_0X1               (0x1u<<6)
#define NVM_WRP2R1_PRG_SGN5_B_0X0               (0x0u<<5)
#define NVM_WRP2R1_PRG_SGN5_B_0X1               (0x1u<<5)
#define NVM_WRP2R1_PRG_SGN4_B_0X0               (0x0u<<4)
#define NVM_WRP2R1_PRG_SGN4_B_0X1               (0x1u<<4)
#define NVM_WRP2R1_PRG_SGN3_B_0X0               (0x0u<<3)
#define NVM_WRP2R1_PRG_SGN3_B_0X1               (0x1u<<3)
#define NVM_WRP2R1_PRG_SGN2_B_0X0               (0x0u<<2)
#define NVM_WRP2R1_PRG_SGN2_B_0X1               (0x1u<<2)
#define NVM_WRP2R1_PRG_SGN1_B_0X0               (0x0u<<1)
#define NVM_WRP2R1_PRG_SGN1_B_0X1               (0x1u<<1)
#define NVM_WRP2R1_PRG_SGN0_B_0X0               (0x0u<<0)
#define NVM_WRP2R1_PRG_SGN0_B_0X1               (0x1u<<0)

// WRP2R2_CUR Configuration

#define NVM_WRP2R2_CUR_SGN63                    (0x1u<<31)
#define NVM_WRP2R2_CUR_SGN62                    (0x1u<<30)
#define NVM_WRP2R2_CUR_SGN61                    (0x1u<<29)
#define NVM_WRP2R2_CUR_SGN60                    (0x1u<<28)
#define NVM_WRP2R2_CUR_SGN59                    (0x1u<<27)
#define NVM_WRP2R2_CUR_SGN58                    (0x1u<<26)
#define NVM_WRP2R2_CUR_SGN57                    (0x1u<<25)
#define NVM_WRP2R2_CUR_SGN56                    (0x1u<<24)
#define NVM_WRP2R2_CUR_SGN55                    (0x1u<<23)
#define NVM_WRP2R2_CUR_SGN54                    (0x1u<<22)
#define NVM_WRP2R2_CUR_SGN53                    (0x1u<<21)
#define NVM_WRP2R2_CUR_SGN52                    (0x1u<<20)
#define NVM_WRP2R2_CUR_SGN51                    (0x1u<<19)
#define NVM_WRP2R2_CUR_SGN50                    (0x1u<<18)
#define NVM_WRP2R2_CUR_SGN49                    (0x1u<<17)
#define NVM_WRP2R2_CUR_SGN48                    (0x1u<<16)
#define NVM_WRP2R2_CUR_SGN47                    (0x1u<<15)
#define NVM_WRP2R2_CUR_SGN46                    (0x1u<<14)
#define NVM_WRP2R2_CUR_SGN45                    (0x1u<<13)
#define NVM_WRP2R2_CUR_SGN44                    (0x1u<<12)
#define NVM_WRP2R2_CUR_SGN43                    (0x1u<<11)
#define NVM_WRP2R2_CUR_SGN42                    (0x1u<<10)
#define NVM_WRP2R2_CUR_SGN41                    (0x1u<<9)
#define NVM_WRP2R2_CUR_SGN40                    (0x1u<<8)
#define NVM_WRP2R2_CUR_SGN39                    (0x1u<<7)
#define NVM_WRP2R2_CUR_SGN38                    (0x1u<<6)
#define NVM_WRP2R2_CUR_SGN37                    (0x1u<<5)
#define NVM_WRP2R2_CUR_SGN36                    (0x1u<<4)
#define NVM_WRP2R2_CUR_SGN35                    (0x1u<<3)
#define NVM_WRP2R2_CUR_SGN34                    (0x1u<<2)
#define NVM_WRP2R2_CUR_SGN33                    (0x1u<<1)
#define NVM_WRP2R2_CUR_SGN32                    (0x1u<<0)

#define NVM_WRP2R2_CUR_SGN63_B_0X0              (0x0u<<31)
#define NVM_WRP2R2_CUR_SGN63_B_0X1              (0x1u<<31)
#define NVM_WRP2R2_CUR_SGN62_B_0X0              (0x0u<<30)
#define NVM_WRP2R2_CUR_SGN62_B_0X1              (0x1u<<30)
#define NVM_WRP2R2_CUR_SGN61_B_0X0              (0x0u<<29)
#define NVM_WRP2R2_CUR_SGN61_B_0X1              (0x1u<<29)
#define NVM_WRP2R2_CUR_SGN60_B_0X0              (0x0u<<28)
#define NVM_WRP2R2_CUR_SGN60_B_0X1              (0x1u<<28)
#define NVM_WRP2R2_CUR_SGN59_B_0X0              (0x0u<<27)
#define NVM_WRP2R2_CUR_SGN59_B_0X1              (0x1u<<27)
#define NVM_WRP2R2_CUR_SGN58_B_0X0              (0x0u<<26)
#define NVM_WRP2R2_CUR_SGN58_B_0X1              (0x1u<<26)
#define NVM_WRP2R2_CUR_SGN57_B_0X0              (0x0u<<25)
#define NVM_WRP2R2_CUR_SGN57_B_0X1              (0x1u<<25)
#define NVM_WRP2R2_CUR_SGN56_B_0X0              (0x0u<<24)
#define NVM_WRP2R2_CUR_SGN56_B_0X1              (0x1u<<24)
#define NVM_WRP2R2_CUR_SGN55_B_0X0              (0x0u<<23)
#define NVM_WRP2R2_CUR_SGN55_B_0X1              (0x1u<<23)
#define NVM_WRP2R2_CUR_SGN54_B_0X0              (0x0u<<22)
#define NVM_WRP2R2_CUR_SGN54_B_0X1              (0x1u<<22)
#define NVM_WRP2R2_CUR_SGN53_B_0X0              (0x0u<<21)
#define NVM_WRP2R2_CUR_SGN53_B_0X1              (0x1u<<21)
#define NVM_WRP2R2_CUR_SGN52_B_0X0              (0x0u<<20)
#define NVM_WRP2R2_CUR_SGN52_B_0X1              (0x1u<<20)
#define NVM_WRP2R2_CUR_SGN51_B_0X0              (0x0u<<19)
#define NVM_WRP2R2_CUR_SGN51_B_0X1              (0x1u<<19)
#define NVM_WRP2R2_CUR_SGN50_B_0X0              (0x0u<<18)
#define NVM_WRP2R2_CUR_SGN50_B_0X1              (0x1u<<18)
#define NVM_WRP2R2_CUR_SGN49_B_0X0              (0x0u<<17)
#define NVM_WRP2R2_CUR_SGN49_B_0X1              (0x1u<<17)
#define NVM_WRP2R2_CUR_SGN48_B_0X0              (0x0u<<16)
#define NVM_WRP2R2_CUR_SGN48_B_0X1              (0x1u<<16)
#define NVM_WRP2R2_CUR_SGN47_B_0X0              (0x0u<<15)
#define NVM_WRP2R2_CUR_SGN47_B_0X1              (0x1u<<15)
#define NVM_WRP2R2_CUR_SGN46_B_0X0              (0x0u<<14)
#define NVM_WRP2R2_CUR_SGN46_B_0X1              (0x1u<<14)
#define NVM_WRP2R2_CUR_SGN45_B_0X0              (0x0u<<13)
#define NVM_WRP2R2_CUR_SGN45_B_0X1              (0x1u<<13)
#define NVM_WRP2R2_CUR_SGN44_B_0X0              (0x0u<<12)
#define NVM_WRP2R2_CUR_SGN44_B_0X1              (0x1u<<12)
#define NVM_WRP2R2_CUR_SGN43_B_0X0              (0x0u<<11)
#define NVM_WRP2R2_CUR_SGN43_B_0X1              (0x1u<<11)
#define NVM_WRP2R2_CUR_SGN42_B_0X0              (0x0u<<10)
#define NVM_WRP2R2_CUR_SGN42_B_0X1              (0x1u<<10)
#define NVM_WRP2R2_CUR_SGN41_B_0X0              (0x0u<<9)
#define NVM_WRP2R2_CUR_SGN41_B_0X1              (0x1u<<9)
#define NVM_WRP2R2_CUR_SGN40_B_0X0              (0x0u<<8)
#define NVM_WRP2R2_CUR_SGN40_B_0X1              (0x1u<<8)
#define NVM_WRP2R2_CUR_SGN39_B_0X0              (0x0u<<7)
#define NVM_WRP2R2_CUR_SGN39_B_0X1              (0x1u<<7)
#define NVM_WRP2R2_CUR_SGN38_B_0X0              (0x0u<<6)
#define NVM_WRP2R2_CUR_SGN38_B_0X1              (0x1u<<6)
#define NVM_WRP2R2_CUR_SGN37_B_0X0              (0x0u<<5)
#define NVM_WRP2R2_CUR_SGN37_B_0X1              (0x1u<<5)
#define NVM_WRP2R2_CUR_SGN36_B_0X0              (0x0u<<4)
#define NVM_WRP2R2_CUR_SGN36_B_0X1              (0x1u<<4)
#define NVM_WRP2R2_CUR_SGN35_B_0X0              (0x0u<<3)
#define NVM_WRP2R2_CUR_SGN35_B_0X1              (0x1u<<3)
#define NVM_WRP2R2_CUR_SGN34_B_0X0              (0x0u<<2)
#define NVM_WRP2R2_CUR_SGN34_B_0X1              (0x1u<<2)
#define NVM_WRP2R2_CUR_SGN33_B_0X0              (0x0u<<1)
#define NVM_WRP2R2_CUR_SGN33_B_0X1              (0x1u<<1)
#define NVM_WRP2R2_CUR_SGN32_B_0X0              (0x0u<<0)
#define NVM_WRP2R2_CUR_SGN32_B_0X1              (0x1u<<0)

// WRP2R2_PRG Configuration

#define NVM_WRP2R2_PRG_SGN63                    (0x1u<<31)
#define NVM_WRP2R2_PRG_SGN62                    (0x1u<<30)
#define NVM_WRP2R2_PRG_SGN61                    (0x1u<<29)
#define NVM_WRP2R2_PRG_SGN60                    (0x1u<<28)
#define NVM_WRP2R2_PRG_SGN59                    (0x1u<<27)
#define NVM_WRP2R2_PRG_SGN58                    (0x1u<<26)
#define NVM_WRP2R2_PRG_SGN57                    (0x1u<<25)
#define NVM_WRP2R2_PRG_SGN56                    (0x1u<<24)
#define NVM_WRP2R2_PRG_SGN55                    (0x1u<<23)
#define NVM_WRP2R2_PRG_SGN54                    (0x1u<<22)
#define NVM_WRP2R2_PRG_SGN53                    (0x1u<<21)
#define NVM_WRP2R2_PRG_SGN52                    (0x1u<<20)
#define NVM_WRP2R2_PRG_SGN51                    (0x1u<<19)
#define NVM_WRP2R2_PRG_SGN50                    (0x1u<<18)
#define NVM_WRP2R2_PRG_SGN49                    (0x1u<<17)
#define NVM_WRP2R2_PRG_SGN48                    (0x1u<<16)
#define NVM_WRP2R2_PRG_SGN47                    (0x1u<<15)
#define NVM_WRP2R2_PRG_SGN46                    (0x1u<<14)
#define NVM_WRP2R2_PRG_SGN45                    (0x1u<<13)
#define NVM_WRP2R2_PRG_SGN44                    (0x1u<<12)
#define NVM_WRP2R2_PRG_SGN43                    (0x1u<<11)
#define NVM_WRP2R2_PRG_SGN42                    (0x1u<<10)
#define NVM_WRP2R2_PRG_SGN41                    (0x1u<<9)
#define NVM_WRP2R2_PRG_SGN40                    (0x1u<<8)
#define NVM_WRP2R2_PRG_SGN39                    (0x1u<<7)
#define NVM_WRP2R2_PRG_SGN38                    (0x1u<<6)
#define NVM_WRP2R2_PRG_SGN37                    (0x1u<<5)
#define NVM_WRP2R2_PRG_SGN36                    (0x1u<<4)
#define NVM_WRP2R2_PRG_SGN35                    (0x1u<<3)
#define NVM_WRP2R2_PRG_SGN34                    (0x1u<<2)
#define NVM_WRP2R2_PRG_SGN33                    (0x1u<<1)
#define NVM_WRP2R2_PRG_SGN32                    (0x1u<<0)

#define NVM_WRP2R2_PRG_SGN63_B_0X0              (0x0u<<31)
#define NVM_WRP2R2_PRG_SGN63_B_0X1              (0x1u<<31)
#define NVM_WRP2R2_PRG_SGN62_B_0X0              (0x0u<<30)
#define NVM_WRP2R2_PRG_SGN62_B_0X1              (0x1u<<30)
#define NVM_WRP2R2_PRG_SGN61_B_0X0              (0x0u<<29)
#define NVM_WRP2R2_PRG_SGN61_B_0X1              (0x1u<<29)
#define NVM_WRP2R2_PRG_SGN60_B_0X0              (0x0u<<28)
#define NVM_WRP2R2_PRG_SGN60_B_0X1              (0x1u<<28)
#define NVM_WRP2R2_PRG_SGN59_B_0X0              (0x0u<<27)
#define NVM_WRP2R2_PRG_SGN59_B_0X1              (0x1u<<27)
#define NVM_WRP2R2_PRG_SGN58_B_0X0              (0x0u<<26)
#define NVM_WRP2R2_PRG_SGN58_B_0X1              (0x1u<<26)
#define NVM_WRP2R2_PRG_SGN57_B_0X0              (0x0u<<25)
#define NVM_WRP2R2_PRG_SGN57_B_0X1              (0x1u<<25)
#define NVM_WRP2R2_PRG_SGN56_B_0X0              (0x0u<<24)
#define NVM_WRP2R2_PRG_SGN56_B_0X1              (0x1u<<24)
#define NVM_WRP2R2_PRG_SGN55_B_0X0              (0x0u<<23)
#define NVM_WRP2R2_PRG_SGN55_B_0X1              (0x1u<<23)
#define NVM_WRP2R2_PRG_SGN54_B_0X0              (0x0u<<22)
#define NVM_WRP2R2_PRG_SGN54_B_0X1              (0x1u<<22)
#define NVM_WRP2R2_PRG_SGN53_B_0X0              (0x0u<<21)
#define NVM_WRP2R2_PRG_SGN53_B_0X1              (0x1u<<21)
#define NVM_WRP2R2_PRG_SGN52_B_0X0              (0x0u<<20)
#define NVM_WRP2R2_PRG_SGN52_B_0X1              (0x1u<<20)
#define NVM_WRP2R2_PRG_SGN51_B_0X0              (0x0u<<19)
#define NVM_WRP2R2_PRG_SGN51_B_0X1              (0x1u<<19)
#define NVM_WRP2R2_PRG_SGN50_B_0X0              (0x0u<<18)
#define NVM_WRP2R2_PRG_SGN50_B_0X1              (0x1u<<18)
#define NVM_WRP2R2_PRG_SGN49_B_0X0              (0x0u<<17)
#define NVM_WRP2R2_PRG_SGN49_B_0X1              (0x1u<<17)
#define NVM_WRP2R2_PRG_SGN48_B_0X0              (0x0u<<16)
#define NVM_WRP2R2_PRG_SGN48_B_0X1              (0x1u<<16)
#define NVM_WRP2R2_PRG_SGN47_B_0X0              (0x0u<<15)
#define NVM_WRP2R2_PRG_SGN47_B_0X1              (0x1u<<15)
#define NVM_WRP2R2_PRG_SGN46_B_0X0              (0x0u<<14)
#define NVM_WRP2R2_PRG_SGN46_B_0X1              (0x1u<<14)
#define NVM_WRP2R2_PRG_SGN45_B_0X0              (0x0u<<13)
#define NVM_WRP2R2_PRG_SGN45_B_0X1              (0x1u<<13)
#define NVM_WRP2R2_PRG_SGN44_B_0X0              (0x0u<<12)
#define NVM_WRP2R2_PRG_SGN44_B_0X1              (0x1u<<12)
#define NVM_WRP2R2_PRG_SGN43_B_0X0              (0x0u<<11)
#define NVM_WRP2R2_PRG_SGN43_B_0X1              (0x1u<<11)
#define NVM_WRP2R2_PRG_SGN42_B_0X0              (0x0u<<10)
#define NVM_WRP2R2_PRG_SGN42_B_0X1              (0x1u<<10)
#define NVM_WRP2R2_PRG_SGN41_B_0X0              (0x0u<<9)
#define NVM_WRP2R2_PRG_SGN41_B_0X1              (0x1u<<9)
#define NVM_WRP2R2_PRG_SGN40_B_0X0              (0x0u<<8)
#define NVM_WRP2R2_PRG_SGN40_B_0X1              (0x1u<<8)
#define NVM_WRP2R2_PRG_SGN39_B_0X0              (0x0u<<7)
#define NVM_WRP2R2_PRG_SGN39_B_0X1              (0x1u<<7)
#define NVM_WRP2R2_PRG_SGN38_B_0X0              (0x0u<<6)
#define NVM_WRP2R2_PRG_SGN38_B_0X1              (0x1u<<6)
#define NVM_WRP2R2_PRG_SGN37_B_0X0              (0x0u<<5)
#define NVM_WRP2R2_PRG_SGN37_B_0X1              (0x1u<<5)
#define NVM_WRP2R2_PRG_SGN36_B_0X0              (0x0u<<4)
#define NVM_WRP2R2_PRG_SGN36_B_0X1              (0x1u<<4)
#define NVM_WRP2R2_PRG_SGN35_B_0X0              (0x0u<<3)
#define NVM_WRP2R2_PRG_SGN35_B_0X1              (0x1u<<3)
#define NVM_WRP2R2_PRG_SGN34_B_0X0              (0x0u<<2)
#define NVM_WRP2R2_PRG_SGN34_B_0X1              (0x1u<<2)
#define NVM_WRP2R2_PRG_SGN33_B_0X0              (0x0u<<1)
#define NVM_WRP2R2_PRG_SGN33_B_0X1              (0x1u<<1)
#define NVM_WRP2R2_PRG_SGN32_B_0X0              (0x0u<<0)
#define NVM_WRP2R2_PRG_SGN32_B_0X1              (0x1u<<0)

// WRM2R1_CUR Configuration

