Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_nvm.h
#define NVM_WRM2R2_CUR_SG63                     (0x1u<<31)
#define NVM_WRM2R2_CUR_SG62                     (0x1u<<30)
#define NVM_WRM2R2_CUR_SG61                     (0x1u<<29)
#define NVM_WRM2R2_CUR_SG60                     (0x1u<<28)
#define NVM_WRM2R2_CUR_SG59                     (0x1u<<27)
#define NVM_WRM2R2_CUR_SG58                     (0x1u<<26)
#define NVM_WRM2R2_CUR_SG57                     (0x1u<<25)
#define NVM_WRM2R2_CUR_SG56                     (0x1u<<24)
#define NVM_WRM2R2_CUR_SG55                     (0x1u<<23)
#define NVM_WRM2R2_CUR_SG54                     (0x1u<<22)
#define NVM_WRM2R2_CUR_SG53                     (0x1u<<21)
#define NVM_WRM2R2_CUR_SG52                     (0x1u<<20)
#define NVM_WRM2R2_CUR_SG51                     (0x1u<<19)
#define NVM_WRM2R2_CUR_SG50                     (0x1u<<18)
#define NVM_WRM2R2_CUR_SG49                     (0x1u<<17)
#define NVM_WRM2R2_CUR_SG48                     (0x1u<<16)
#define NVM_WRM2R2_CUR_SG47                     (0x1u<<15)
#define NVM_WRM2R2_CUR_SG46                     (0x1u<<14)
#define NVM_WRM2R2_CUR_SG45                     (0x1u<<13)
#define NVM_WRM2R2_CUR_SG44                     (0x1u<<12)
#define NVM_WRM2R2_CUR_SG43                     (0x1u<<11)
#define NVM_WRM2R2_CUR_SG42                     (0x1u<<10)
#define NVM_WRM2R2_CUR_SG41                     (0x1u<<9)
#define NVM_WRM2R2_CUR_SG40                     (0x1u<<8)
#define NVM_WRM2R2_CUR_SG39                     (0x1u<<7)
#define NVM_WRM2R2_CUR_SG38                     (0x1u<<6)
#define NVM_WRM2R2_CUR_SG37                     (0x1u<<5)
#define NVM_WRM2R2_CUR_SG36                     (0x1u<<4)
#define NVM_WRM2R2_CUR_SG35                     (0x1u<<3)
#define NVM_WRM2R2_CUR_SG34                     (0x1u<<2)
#define NVM_WRM2R2_CUR_SG33                     (0x1u<<1)
#define NVM_WRM2R2_CUR_SG32                     (0x1u<<0)

#define NVM_WRM2R2_CUR_SG63_B_0X0               (0x0u<<31)
#define NVM_WRM2R2_CUR_SG63_B_0X1               (0x1u<<31)
#define NVM_WRM2R2_CUR_SG62_B_0X0               (0x0u<<30)
#define NVM_WRM2R2_CUR_SG62_B_0X1               (0x1u<<30)
#define NVM_WRM2R2_CUR_SG61_B_0X0               (0x0u<<29)
#define NVM_WRM2R2_CUR_SG61_B_0X1               (0x1u<<29)
#define NVM_WRM2R2_CUR_SG60_B_0X0               (0x0u<<28)
#define NVM_WRM2R2_CUR_SG60_B_0X1               (0x1u<<28)
#define NVM_WRM2R2_CUR_SG59_B_0X0               (0x0u<<27)
#define NVM_WRM2R2_CUR_SG59_B_0X1               (0x1u<<27)
#define NVM_WRM2R2_CUR_SG58_B_0X0               (0x0u<<26)
#define NVM_WRM2R2_CUR_SG58_B_0X1               (0x1u<<26)
#define NVM_WRM2R2_CUR_SG57_B_0X0               (0x0u<<25)
#define NVM_WRM2R2_CUR_SG57_B_0X1               (0x1u<<25)
#define NVM_WRM2R2_CUR_SG56_B_0X0               (0x0u<<24)
#define NVM_WRM2R2_CUR_SG56_B_0X1               (0x1u<<24)
#define NVM_WRM2R2_CUR_SG55_B_0X0               (0x0u<<23)
#define NVM_WRM2R2_CUR_SG55_B_0X1               (0x1u<<23)
#define NVM_WRM2R2_CUR_SG54_B_0X0               (0x0u<<22)
#define NVM_WRM2R2_CUR_SG54_B_0X1               (0x1u<<22)
#define NVM_WRM2R2_CUR_SG53_B_0X0               (0x0u<<21)
#define NVM_WRM2R2_CUR_SG53_B_0X1               (0x1u<<21)
#define NVM_WRM2R2_CUR_SG52_B_0X0               (0x0u<<20)
#define NVM_WRM2R2_CUR_SG52_B_0X1               (0x1u<<20)
#define NVM_WRM2R2_CUR_SG51_B_0X0               (0x0u<<19)
#define NVM_WRM2R2_CUR_SG51_B_0X1               (0x1u<<19)
#define NVM_WRM2R2_CUR_SG50_B_0X0               (0x0u<<18)
#define NVM_WRM2R2_CUR_SG50_B_0X1               (0x1u<<18)
#define NVM_WRM2R2_CUR_SG49_B_0X0               (0x0u<<17)
#define NVM_WRM2R2_CUR_SG49_B_0X1               (0x1u<<17)
#define NVM_WRM2R2_CUR_SG48_B_0X0               (0x0u<<16)
#define NVM_WRM2R2_CUR_SG48_B_0X1               (0x1u<<16)
#define NVM_WRM2R2_CUR_SG47_B_0X0               (0x0u<<15)
#define NVM_WRM2R2_CUR_SG47_B_0X1               (0x1u<<15)
#define NVM_WRM2R2_CUR_SG46_B_0X0               (0x0u<<14)
#define NVM_WRM2R2_CUR_SG46_B_0X1               (0x1u<<14)
#define NVM_WRM2R2_CUR_SG45_B_0X0               (0x0u<<13)
#define NVM_WRM2R2_CUR_SG45_B_0X1               (0x1u<<13)
#define NVM_WRM2R2_CUR_SG44_B_0X0               (0x0u<<12)
#define NVM_WRM2R2_CUR_SG44_B_0X1               (0x1u<<12)
#define NVM_WRM2R2_CUR_SG43_B_0X0               (0x0u<<11)
#define NVM_WRM2R2_CUR_SG43_B_0X1               (0x1u<<11)
#define NVM_WRM2R2_CUR_SG42_B_0X0               (0x0u<<10)
#define NVM_WRM2R2_CUR_SG42_B_0X1               (0x1u<<10)
#define NVM_WRM2R2_CUR_SG41_B_0X0               (0x0u<<9)
#define NVM_WRM2R2_CUR_SG41_B_0X1               (0x1u<<9)
#define NVM_WRM2R2_CUR_SG40_B_0X0               (0x0u<<8)
#define NVM_WRM2R2_CUR_SG40_B_0X1               (0x1u<<8)
#define NVM_WRM2R2_CUR_SG39_B_0X0               (0x0u<<7)
#define NVM_WRM2R2_CUR_SG39_B_0X1               (0x1u<<7)
#define NVM_WRM2R2_CUR_SG38_B_0X0               (0x0u<<6)
#define NVM_WRM2R2_CUR_SG38_B_0X1               (0x1u<<6)
#define NVM_WRM2R2_CUR_SG37_B_0X0               (0x0u<<5)
#define NVM_WRM2R2_CUR_SG37_B_0X1               (0x1u<<5)
#define NVM_WRM2R2_CUR_SG36_B_0X0               (0x0u<<4)
#define NVM_WRM2R2_CUR_SG36_B_0X1               (0x1u<<4)
#define NVM_WRM2R2_CUR_SG35_B_0X0               (0x0u<<3)
#define NVM_WRM2R2_CUR_SG35_B_0X1               (0x1u<<3)
#define NVM_WRM2R2_CUR_SG34_B_0X0               (0x0u<<2)
#define NVM_WRM2R2_CUR_SG34_B_0X1               (0x1u<<2)
#define NVM_WRM2R2_CUR_SG33_B_0X0               (0x0u<<1)
#define NVM_WRM2R2_CUR_SG33_B_0X1               (0x1u<<1)
#define NVM_WRM2R2_CUR_SG32_B_0X0               (0x0u<<0)
#define NVM_WRM2R2_CUR_SG32_B_0X1               (0x1u<<0)

// WRM2R2_PRG Configuration

#define NVM_WRM2R2_PRG_SG63                     (0x1u<<31)
#define NVM_WRM2R2_PRG_SG62                     (0x1u<<30)
#define NVM_WRM2R2_PRG_SG61                     (0x1u<<29)
#define NVM_WRM2R2_PRG_SG60                     (0x1u<<28)
#define NVM_WRM2R2_PRG_SG59                     (0x1u<<27)
#define NVM_WRM2R2_PRG_SG58                     (0x1u<<26)
#define NVM_WRM2R2_PRG_SG57                     (0x1u<<25)
#define NVM_WRM2R2_PRG_SG56                     (0x1u<<24)
#define NVM_WRM2R2_PRG_SG55                     (0x1u<<23)
#define NVM_WRM2R2_PRG_SG54                     (0x1u<<22)
#define NVM_WRM2R2_PRG_SG53                     (0x1u<<21)
#define NVM_WRM2R2_PRG_SG52                     (0x1u<<20)
#define NVM_WRM2R2_PRG_SG51                     (0x1u<<19)
#define NVM_WRM2R2_PRG_SG50                     (0x1u<<18)
#define NVM_WRM2R2_PRG_SG49                     (0x1u<<17)
#define NVM_WRM2R2_PRG_SG48                     (0x1u<<16)
#define NVM_WRM2R2_PRG_SG47                     (0x1u<<15)
#define NVM_WRM2R2_PRG_SG46                     (0x1u<<14)
#define NVM_WRM2R2_PRG_SG45                     (0x1u<<13)
#define NVM_WRM2R2_PRG_SG44                     (0x1u<<12)
#define NVM_WRM2R2_PRG_SG43                     (0x1u<<11)
#define NVM_WRM2R2_PRG_SG42                     (0x1u<<10)
#define NVM_WRM2R2_PRG_SG41                     (0x1u<<9)
#define NVM_WRM2R2_PRG_SG40                     (0x1u<<8)
#define NVM_WRM2R2_PRG_SG39                     (0x1u<<7)
#define NVM_WRM2R2_PRG_SG38                     (0x1u<<6)
#define NVM_WRM2R2_PRG_SG37                     (0x1u<<5)
#define NVM_WRM2R2_PRG_SG36                     (0x1u<<4)
#define NVM_WRM2R2_PRG_SG35                     (0x1u<<3)
#define NVM_WRM2R2_PRG_SG34                     (0x1u<<2)
#define NVM_WRM2R2_PRG_SG33                     (0x1u<<1)
#define NVM_WRM2R2_PRG_SG32                     (0x1u<<0)

#define NVM_WRM2R2_PRG_SG63_B_0X0               (0x0u<<31)
#define NVM_WRM2R2_PRG_SG63_B_0X1               (0x1u<<31)
#define NVM_WRM2R2_PRG_SG62_B_0X0               (0x0u<<30)
#define NVM_WRM2R2_PRG_SG62_B_0X1               (0x1u<<30)
#define NVM_WRM2R2_PRG_SG61_B_0X0               (0x0u<<29)
#define NVM_WRM2R2_PRG_SG61_B_0X1               (0x1u<<29)
#define NVM_WRM2R2_PRG_SG60_B_0X0               (0x0u<<28)
#define NVM_WRM2R2_PRG_SG60_B_0X1               (0x1u<<28)
#define NVM_WRM2R2_PRG_SG59_B_0X0               (0x0u<<27)
#define NVM_WRM2R2_PRG_SG59_B_0X1               (0x1u<<27)
#define NVM_WRM2R2_PRG_SG58_B_0X0               (0x0u<<26)
#define NVM_WRM2R2_PRG_SG58_B_0X1               (0x1u<<26)
#define NVM_WRM2R2_PRG_SG57_B_0X0               (0x0u<<25)
#define NVM_WRM2R2_PRG_SG57_B_0X1               (0x1u<<25)
#define NVM_WRM2R2_PRG_SG56_B_0X0               (0x0u<<24)
#define NVM_WRM2R2_PRG_SG56_B_0X1               (0x1u<<24)
#define NVM_WRM2R2_PRG_SG55_B_0X0               (0x0u<<23)
#define NVM_WRM2R2_PRG_SG55_B_0X1               (0x1u<<23)
#define NVM_WRM2R2_PRG_SG54_B_0X0               (0x0u<<22)
#define NVM_WRM2R2_PRG_SG54_B_0X1               (0x1u<<22)
#define NVM_WRM2R2_PRG_SG53_B_0X0               (0x0u<<21)
#define NVM_WRM2R2_PRG_SG53_B_0X1               (0x1u<<21)
#define NVM_WRM2R2_PRG_SG52_B_0X0               (0x0u<<20)
#define NVM_WRM2R2_PRG_SG52_B_0X1               (0x1u<<20)
#define NVM_WRM2R2_PRG_SG51_B_0X0               (0x0u<<19)
#define NVM_WRM2R2_PRG_SG51_B_0X1               (0x1u<<19)
#define NVM_WRM2R2_PRG_SG50_B_0X0               (0x0u<<18)
#define NVM_WRM2R2_PRG_SG50_B_0X1               (0x1u<<18)
#define NVM_WRM2R2_PRG_SG49_B_0X0               (0x0u<<17)
#define NVM_WRM2R2_PRG_SG49_B_0X1               (0x1u<<17)
#define NVM_WRM2R2_PRG_SG48_B_0X0               (0x0u<<16)
#define NVM_WRM2R2_PRG_SG48_B_0X1               (0x1u<<16)
#define NVM_WRM2R2_PRG_SG47_B_0X0               (0x0u<<15)
#define NVM_WRM2R2_PRG_SG47_B_0X1               (0x1u<<15)
#define NVM_WRM2R2_PRG_SG46_B_0X0               (0x0u<<14)
#define NVM_WRM2R2_PRG_SG46_B_0X1               (0x1u<<14)
#define NVM_WRM2R2_PRG_SG45_B_0X0               (0x0u<<13)
#define NVM_WRM2R2_PRG_SG45_B_0X1               (0x1u<<13)
#define NVM_WRM2R2_PRG_SG44_B_0X0               (0x0u<<12)
#define NVM_WRM2R2_PRG_SG44_B_0X1               (0x1u<<12)
#define NVM_WRM2R2_PRG_SG43_B_0X0               (0x0u<<11)
#define NVM_WRM2R2_PRG_SG43_B_0X1               (0x1u<<11)
#define NVM_WRM2R2_PRG_SG42_B_0X0               (0x0u<<10)
#define NVM_WRM2R2_PRG_SG42_B_0X1               (0x1u<<10)
#define NVM_WRM2R2_PRG_SG41_B_0X0               (0x0u<<9)
#define NVM_WRM2R2_PRG_SG41_B_0X1               (0x1u<<9)
#define NVM_WRM2R2_PRG_SG40_B_0X0               (0x0u<<8)
#define NVM_WRM2R2_PRG_SG40_B_0X1               (0x1u<<8)
#define NVM_WRM2R2_PRG_SG39_B_0X0               (0x0u<<7)
#define NVM_WRM2R2_PRG_SG39_B_0X1               (0x1u<<7)
#define NVM_WRM2R2_PRG_SG38_B_0X0               (0x0u<<6)
#define NVM_WRM2R2_PRG_SG38_B_0X1               (0x1u<<6)
#define NVM_WRM2R2_PRG_SG37_B_0X0               (0x0u<<5)
#define NVM_WRM2R2_PRG_SG37_B_0X1               (0x1u<<5)
#define NVM_WRM2R2_PRG_SG36_B_0X0               (0x0u<<4)
#define NVM_WRM2R2_PRG_SG36_B_0X1               (0x1u<<4)
#define NVM_WRM2R2_PRG_SG35_B_0X0               (0x0u<<3)
#define NVM_WRM2R2_PRG_SG35_B_0X1               (0x1u<<3)
#define NVM_WRM2R2_PRG_SG34_B_0X0               (0x0u<<2)
#define NVM_WRM2R2_PRG_SG34_B_0X1               (0x1u<<2)
#define NVM_WRM2R2_PRG_SG33_B_0X0               (0x0u<<1)
#define NVM_WRM2R2_PRG_SG33_B_0X1               (0x1u<<1)
#define NVM_WRM2R2_PRG_SG32_B_0X0               (0x0u<<0)
#define NVM_WRM2R2_PRG_SG32_B_0X1               (0x1u<<0)

// EDATA2R_CUR Configuration

#define NVM_EDATA2R_CUR_EN                      (0x1u<<15)
#define NVM_EDATA2R_CUR_STRT                    (0xFu<<0)
#define NVM_EDATA2R_CUR_STRT_0                  (0x1u<<0)

#define NVM_EDATA2R_CUR_EN_B_0X0                (0x0u<<15)
#define NVM_EDATA2R_CUR_EN_B_0X1                (0x1u<<15)
#define NVM_EDATA2R_CUR_STRT_B_0X0              (0x0u<<0)
#define NVM_EDATA2R_CUR_STRT_B_0X1              (0x1u<<0)
#define NVM_EDATA2R_CUR_STRT_B_0X2              (0x2u<<0)
#define NVM_EDATA2R_CUR_STRT_B_0XF              (0xFu<<0)

// EDATA2R_PRG Configuration

