Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_nvm.h
#define NVM_EDATA2R_PRG_EN                      (0x1u<<15)
#define NVM_EDATA2R_PRG_STRT                    (0xFu<<0)
#define NVM_EDATA2R_PRG_STRT_0                  (0x1u<<0)

#define NVM_EDATA2R_PRG_EN_B_0X0                (0x0u<<15)
#define NVM_EDATA2R_PRG_EN_B_0X1                (0x1u<<15)
#define NVM_EDATA2R_PRG_STRT_B_0X0              (0x0u<<0)
#define NVM_EDATA2R_PRG_STRT_B_0X1              (0x1u<<0)
#define NVM_EDATA2R_PRG_STRT_B_0X2              (0x2u<<0)
#define NVM_EDATA2R_PRG_STRT_B_0XF              (0xFu<<0)

// HDPEXT2R Configuration

#define NVM_HDPEXT2R_EXT                        (0x1FFu<<0)
#define NVM_HDPEXT2R_EXT_0                      (0x1u<<0)

#define NVM_HDPEXT2R_EXT_B_0X0                  (0x0u<<0)
#define NVM_HDPEXT2R_EXT_B_0X1                  (0x1u<<0)
#define NVM_HDPEXT2R_EXT_B_0X2                  (0x2u<<0)
#define NVM_HDPEXT2R_EXT_B_0XFF                 (0xFFu<<0)

// LPC2R Configuration

#define NVM_LPC2R_PDREQ                         (0x1u<<0)

#define NVM_LPC2R_PDREQ_B_0X0                   (0x0u<<0)
#define NVM_LPC2R_PDREQ_B_0X1                   (0x1u<<0)

// LPS2R Configuration

#define NVM_LPS2R_PD                            (0x1u<<0)

#define NVM_LPS2R_PD_B_0X0                      (0x0u<<0)
#define NVM_LPS2R_PD_B_0X1                      (0x1u<<0)

// WRPLOCK2R_CUR Configuration

#define NVM_WRPLOCK2R_CUR_LOCK                  (0xFFu<<0)
#define NVM_WRPLOCK2R_CUR_LOCK_0                (0x1u<<0)

#define NVM_WRPLOCK2R_CUR_LOCK_B_0XB6           (0xB6u<<0)
#define NVM_WRPLOCK2R_CUR_LOCK_B_0X49           (0x49u<<0)

// WRPLOCK2R_PRG Configuration

#define NVM_WRPLOCK2R_PRG_LOCK                  (0xFFu<<0)
#define NVM_WRPLOCK2R_PRG_LOCK_0                (0x1u<<0)

#define NVM_WRPLOCK2R_PRG_LOCK_B_0XB6           (0xB6u<<0)
#define NVM_WRPLOCK2R_PRG_LOCK_B_0X49           (0x49u<<0)

// LOCKBB2R Configuration

#define NVM_LOCKBB2R_LOCKBB                     (0x1u<<0)

#define NVM_LOCKBB2R_LOCKBB_B_0X0               (0x0u<<0)
#define NVM_LOCKBB2R_LOCKBB_B_0X1               (0x1u<<0)
